<?php
// Version: 2.1.0; Drafts

// profile
$txt['drafts_show'] = 'খসড়া দেখান';
$txt['drafts_show_desc'] = 'এই এলাকায় আপনার সেভ করা সব খসড়া দেখানো হবে। এখান থেকে আপনি পোস্ট করার আগে সেগুলি সম্পাদনা করতে পারেন, অথবা আপনি সেগুলি মুছতে পারেন।';

// misc
$txt['drafts'] = 'খসড়া';
$txt['draft_save'] = 'খসড়া সংরক্ষণ করুন';
$txt['draft_save_note'] = 'এটি আপনার পোস্টের টেক্সট সংরক্ষণ করবে, তবে এটি সংযুক্তি, ভোট বা ইভেন্ট তথ্য সংরক্ষণ করবে না।';
$txt['draft_none'] = 'আপনার কোন খসড়া নেই।';
$txt['draft_edit'] = 'খসড়া সম্পাদনা করুন';
$txt['draft_hide'] = 'খসড়া লুকান';
$txt['draft_delete'] = 'খসড়া মুছুন';
$txt['draft_saved_on'] = 'খসড়া শেষবার সংরক্ষিত হয়েছে';
$txt['draft_days_ago'] = '%s দিন আগে';
$txt['draft_retain'] = 'এটি %s আরও দিন ধরে রাখা হবে';
$txt['draft_remove'] = 'এই খসড়া মুছুন';
$txt['draft_saved'] = 'বিষয়বস্তু একটি খসড়া হিসেবে সংরক্ষিত হয়েছে, এবং এটি আপনার <a href="%1$s">খসড়া দেখার এলাকায়</a> অ্যাক্সেসযোগ্য হবে।';
$txt['draft_pm_saved'] = 'বিষয়বস্তু একটি খসড়া হিসেবে সংরক্ষিত হয়েছে, এবং এটি আপনার <a href="%1$s">বার্তা কেন্দ্রের খসড়া দেখার এলাকায়</a> অ্যাক্সেসযোগ্য হবে।';
$txt['draft_save_warning'] = 'দয়া করে মনে রাখবেন যে সব খসড়া স্বয়ংক্রিয়ভাবে %1$d দিন পরে মুছে ফেলা হবে।';

// Admin options
$txt['drafts_autosave_enabled'] = 'খসড়ার স্বয়ংক্রিয় সংরক্ষণ সক্ষম করুন';
$txt['drafts_autosave_enabled_subnote'] = 'এটি একটি নির্দিষ্ট সময়সীমায় ব্যবহারকারীর খসড়াগুলি স্বয়ংক্রিয়ভাবে ব্যাকগ্রাউন্ডে সংরক্ষণ করবে। ব্যবহারকারীর কাছে সঠিক অনুমতি থাকতে হবে।';
$txt['drafts_show_saved_enabled'] = 'পোস্টিং স্ক্রীন থেকে খসড়া নির্বাচন সক্ষম করুন';
$txt['drafts_show_saved_enabled_subnote'] = 'এটি ব্যবহারকারীকে পোস্টিং স্ক্রীন থেকে উপযুক্ত খসড়াগুলি নির্বাচন এবং লোড করার অনুমতি দেবে। ব্যবহারকারীর কাছে সঠিক অনুমতি থাকতে হবে।';
$txt['drafts_keep_days'] = 'খসড়া রাখতে সর্বাধিক দিন সংখ্যা';
$txt['drafts_keep_days_subnote'] = 'অবিরাম রাখতে 0 লিখুন';
$txt['drafts_autosave_frequency'] = 'খসড়াগুলি কত ঘন ঘন স্বয়ংক্রিয়ভাবে সংরক্ষণ করা উচিত?';
$txt['drafts_autosave_frequency_subnote'] = 'ন্যূনতম অনুমোদিত মান 30 সেকেন্ড।';
$txt['drafts_pm_enabled'] = 'পিএম খসড়া সংরক্ষণ সক্ষম করুন';
$txt['drafts_post_enabled'] = 'পোস্ট খসড়া সংরক্ষণ সক্ষম করুন';
$txt['drafts_none'] = 'কোন বিষয় নেই';
$txt['drafts_saved'] = 'খসড়াটি সফলভাবে সংরক্ষিত হয়েছে';

?>
