<?php
 // সংস্করণ: 2.1.0;  খসড়া

 // প্রোফাইল
 $txt['drafts_show'] = 'খসড়া দেখান';
 $txt['drafts_show_desc'] = 'এই এলাকাটি আপনাকে দেখায় যে সব ড্রাফ্ট আপনি বর্তমানে সংরক্ষণ করেছেন।  এখান থেকে আপনি পোস্ট করার আগে এগুলি সম্পাদনা করতে পারেন, অথবা আপনি সেগুলি সরাতে পারেন';

 // বিবিধ
 $txt['drafts'] = 'খসড়া';
 $txt['draft_save'] = 'ড্রাফ্ট সংরক্ষণ করুন';
 $txt['draft_save_note'] = 'এটি আপনার পোস্টের পাঠ্য সংরক্ষণ করবে, কিন্তু এটি সংযুক্তি, পোল বা ইভেন্টের তথ্য সংরক্ষণ করবে না।';
 $txt['draft_none'] = 'আপনার কোনো খসড়া নেই।';
 $txt['draft_edit'] = 'খসড়া সম্পাদনা করুন';
 $txt['draft_hide'] = 'ড্রাফ্ট লুকান';
 $txt['draft_delete'] = 'খসড়া মুছুন';
 $txt['draft_saved_on'] = 'খসড়া সর্বশেষ সংরক্ষিত';
 $txt['draft_days_ago'] = '%s দিন আগে';
 $txt['draft_retain'] = 'এটি আরও %s দিন ধরে রাখা হবে';
 $txt['draft_remove'] = 'এই খসড়াটি সরান';
 $txt['draft_saved'] = 'বিষয়বস্তুগুলি একটি খসড়া হিসাবে সংরক্ষণ করা হয়েছে, এবং আপনার প্রোফাইলের <a href="%1$s">খসড়া এলাকা দেখান</a> থেকে অ্যাক্সেসযোগ্য হবে৷';
 $txt['draft_pm_saved'] = 'বিষয়বস্তুগুলি একটি খসড়া হিসাবে সংরক্ষণ করা হয়েছে, এবং আপনার বার্তা কেন্দ্রের <a href="%1$s">খসড়া এলাকা দেখান</a> থেকে অ্যাক্সেসযোগ্য হবে৷';
 $txt['draft_save_warning'] = 'অনুগ্রহ করে মনে রাখবেন যে সমস্ত ড্রাফ্ট %1$d দিন পরে স্বয়ংক্রিয়ভাবে মুছে যাবে।';

 // অ্যাডমিন বিকল্প
 $txt['drafts_autosave_enabled'] = 'ড্রাফ্ট স্বয়ংক্রিয়ভাবে সংরক্ষণ সক্ষম করুন';
 $txt['drafts_autosave_enabled_subnote'] = 'এটি স্বয়ংক্রিয়ভাবে একটি প্রদত্ত ফ্রিকোয়েন্সিতে ব্যাকগ্রাউন্ডে ব্যবহারকারীর খসড়া সংরক্ষণ করবে।  ব্যবহারকারীর অবশ্যই যথাযথ অনুমতি থাকতে হবে';
 $txt['drafts_show_saved_enabled'] = 'পোস্টিং স্ক্রীন থেকে খসড়া নির্বাচন সক্ষম করুন';
 $txt['drafts_show_saved_enabled_subnote'] = 'এটি ব্যবহারকারীকে পোস্টিং স্ক্রীন থেকে উপযুক্ত খসড়া নির্বাচন এবং লোড করার অনুমতি দেবে।  ব্যবহারকারীর অবশ্যই যথাযথ অনুমতি থাকতে হবে';
 $txt['drafts_keep_days'] = 'একটি খসড়া রাখার জন্য সর্বাধিক দিন';
 $txt['drafts_keep_days_subnote'] = 'খসড়া অনির্দিষ্টকালের জন্য রাখতে 0 লিখুন';
 $txt['drafts_autosave_frequency'] = 'কত ঘন ঘন খসড়া স্বয়ংক্রিয়ভাবে সংরক্ষণ করা উচিত?';
 $txt['drafts_autosave_frequency_subnote'] = 'সর্বনিম্ন অনুমোদিত মান 30 সেকেন্ড';
 $txt['drafts_pm_enabled'] = 'প্রধানমন্ত্রীর খসড়া সংরক্ষণ সক্ষম করুন';
 $txt['drafts_post_enabled'] = 'পোস্ট ড্রাফ্ট সংরক্ষণ সক্ষম করুন';
 $txt['drafts_none'] = 'কোন বিষয় নেই';
 $txt['drafts_saved'] = 'খসড়া সফলভাবে সংরক্ষিত হয়েছে';

 ?>