<?php
 // সংস্করণ: 2.1.0;  ইমেইল টেমপ্লেট

 // যেহেতু এই সমস্ত স্ট্রিং ইমেইলে ব্যবহার করা হচ্ছে, তাই সংখ্যাসূচক সত্তা ব্যবহার করা উচিত।

 // {} এর মধ্যে যা কিছু অনুবাদ করবেন না, সেগুলি প্রতিস্থাপন ভেরিয়েবল হিসাবে ব্যবহৃত হয় এবং সেগুলি যেমন আছে ঠিক তেমনই থাকতে হবে।
 // উপরন্তু, @additional_params: লাইন বা এটি অনুসরণকারী লাইনের পরিবর্তনশীল নাম অনুবাদ করবেন না।  আপনি পারেন
 // পরিবর্তনশীলের বর্ণনা অনুবাদ করুন।  @description: অনুবাদ করবেন না, তবে আপনি সেই লাইনের বাকি অংশ অনুবাদ করতে পারেন।

 // এই ফাইলে ব্লক মন্তব্য ব্যবহার করবেন না, তাদের বিশেষ অর্থ থাকবে।

 বিশ্বব্যাপী $txtBirthdayEmails;

 /**
 	 @additional_params: resend_activate_message
 		 REALNAME: ইমেল গ্রহণকারী সদস্যের প্রদর্শন নাম।
 		 USERNAME: ইমেল গ্রহণকারী সদস্যের ব্যবহারকারীর নাম।
 		 ACTIVATIONLINK: সদস্যের অ্যাকাউন্ট সক্রিয় করার URL লিঙ্ক।
 		 ACTIVATIONCODE: সদস্যের অ্যাকাউন্ট সক্রিয় করার জন্য প্রয়োজনীয় কোড।
 		 ACTIVATIONLINKWITHOUTCODE: পৃষ্ঠার URL যেখানে অ্যাক্টিভেশন কোড প্রবেশ করানো যেতে পারে।
 		 FORGOTPASSWORDLINK: "পাসওয়ার্ড ভুলে গেছেন" পৃষ্ঠার URL।
 	 @বর্ণনা:
 */
 $txt['resend_activate_message_subject'] = '{FORUMNAME} এ স্বাগতম';
 $txt['resend_activate_message_body'] = '{FORUMNAME} এ নিবন্ধন করার জন্য আপনাকে ধন্যবাদ।  আপনার ব্যবহারকারীর নাম হল {USERNAME}।  আপনি যদি আপনার পাসওয়ার্ড ভুলে যান, আপনি {FORGOTPASSWORDLINK} এ গিয়ে এটি পুনরায় সেট করতে পারেন৷

 আপনি লগ ইন করার আগে, আপনাকে প্রথমে নিম্নলিখিত লিঙ্কটি নির্বাচন করে আপনার অ্যাকাউন্ট সক্রিয় করতে হবে:

 {ACTIVATIONLINK}

 অ্যাক্টিভেশন নিয়ে আপনার কোনো সমস্যা হলে, অনুগ্রহ করে {ACTIVATIONLINKWITHOUTCODE} এ যান এবং "{ACTIVATIONCODE}" কোডটি লিখুন।

 {সম্পূর্ণ}';

 /**
 	 @additional_params: resend_pending_message
 		 REALNAME: ইমেল গ্রহণকারী সদস্যের প্রদর্শন নাম।
 		 USERNAME: ইমেল গ্রহণকারী সদস্যের ব্যবহারকারীর নাম।
 	 @বর্ণনা:
 */
 $txt['resend_pending_message_subject'] = '{FORUMNAME} এ স্বাগতম';
 $txt['resend_pending_message_body'] = 'হ্যালো {REALNAME}, {FORUMNAME} এ আপনার নিবন্ধনের অনুরোধ গৃহীত হয়েছে৷

 আপনার নিবন্ধিত ব্যবহারকারীর নাম ছিল {USERNAME}৷

 আপনি লগ ইন করতে এবং ফোরাম ব্যবহার শুরু করার আগে, আপনার অনুরোধ পর্যালোচনা করা হবে এবং অনুমোদিত হবে।

 {সম্পূর্ণ}';

 /**
 	 @additional_params: mc_group_approve
 		 USERNAME: ইমেল গ্রহণকারী সদস্যের ব্যবহারকারীর নাম।
 		 GROUPNAME: সদস্যগোষ্ঠীর নাম যেটিতে ব্যবহারকারী গৃহীত হয়েছিল।
 	 @description: একটি নির্দিষ্ট সদস্য গোষ্ঠীতে যোগদানের অনুরোধ গৃহীত হয়েছে।
 */
 $txt['mc_group_approve_subject'] = 'গ্রুপ মেম্বারশিপ অনুমোদন';
 $txt['mc_group_approve_body'] = '{USERNAME},

 আমরা আপনাকে জানাতে পেরে আনন্দিত যে আপনার {FORUMNAME}-এ "{GROUPNAME}" গ্রুপে যোগদানের আবেদন গৃহীত হয়েছে, এবং এই নতুন সদস্যগোষ্ঠীকে অন্তর্ভুক্ত করার জন্য আপনার অ্যাকাউন্ট আপডেট করা হয়েছে৷

 {সম্পূর্ণ}';

 /**
 	 @additional_params: mc_group_reject
 		 USERNAME: ইমেল গ্রহণকারী সদস্যের ব্যবহারকারীর নাম।
 		 GROUPNAME: সদস্যগোষ্ঠীর নাম যেটি থেকে ব্যবহারকারীকে প্রত্যাখ্যান করা হয়েছিল।
 	 @description: একটি নির্দিষ্ট সদস্য গোষ্ঠীতে যোগদানের অনুরোধ প্রত্যাখ্যান করা হয়েছে।
 */
 $txt['mc_group_reject_subject'] = 'গ্রুপ সদস্যপদ প্রত্যাখ্যান';
 $txt['mc_group_reject_body'] = '{USERNAME},

 আমরা আপনাকে জানাতে দুঃখিত যে আপনার {FORUMNAME}-এ "{GROUPNAME}" গ্রুপে যোগদানের আবেদন প্রত্যাখ্যান করা হয়েছে৷

 {সম্পূর্ণ}';

 /**
 	 @additional_params: mc_group_reject_reason
 		 USERNAME: ইমেল গ্রহণকারী সদস্যের ব্যবহারকারীর নাম।
 		 GROUPNAME: সদস্যগোষ্ঠীর নাম যেটি থেকে ব্যবহারকারীকে প্রত্যাখ্যান করা হয়েছিল।
 		 কারণ: প্রত্যাখ্যানের কারণ।
 	 @description: একটি নির্দিষ্ট সদস্য গোষ্ঠীতে যোগদানের অনুরোধ প্রদত্ত কারণ সহ প্রত্যাখ্যান করা হয়েছে।
 */
 $txt['mc_group_reject_reason_subject'] = 'গ্রুপ সদস্যপদ প্রত্যাখ্যান';
 $txt['mc_group_reject_reason_body'] = '{USERNAME},

 আমরা আপনাকে জানাতে দুঃখিত যে আপনার {FORUMNAME}-এ "{GROUPNAME}" গ্রুপে যোগদানের আবেদন প্রত্যাখ্যান করা হয়েছে৷

 এটি নিম্নলিখিত কারণে হয়েছে: {REASON}

 {সম্পূর্ণ}';

 /**
 	 @additional_params: admin_approve_accept
 		 নাম: সদস্যের প্রদর্শন নাম।
 		 USERNAME: ইমেল গ্রহণকারী সদস্যের ব্যবহারকারীর নাম।
 		 PROFILELINK: প্রোফাইল পৃষ্ঠার URL।
 		 FORGOTPASSWORDLINK: "পাসওয়ার্ড ভুলে গেছে" পৃষ্ঠার URL।
 	 @বর্ণনা:
 */
 $txt['admin_approve_accept_subject'] = '{FORUMNAME} এ স্বাগতম';
 $txt['admin_approve_accept_body'] = 'স্বাগতম, {NAME}

 আপনার অ্যাকাউন্ট অ্যাডমিন দ্বারা ম্যানুয়ালি সক্রিয় করা হয়েছে এবং আপনি এখন লগ ইন এবং পোস্ট করতে পারেন.  আপনার ব্যবহারকারীর নাম হল: {USERNAME}।  আপনি যদি আপনার পাসওয়ার্ড ভুলে যান, আপনি এটি {FORGOTPASSWORDLINK} এ পরিবর্তন করতে পারেন৷

 {সম্পূর্ণ}';

 /**
 	 @additional_params: admin_approve_activation
 		 USERNAME: ইমেল গ্রহণকারী সদস্যের ব্যবহারকারীর নাম।
 		 ACTIVATIONLINK: সদস্যের অ্যাকাউন্ট সক্রিয় করার URL লিঙ্ক।
 		 ACTIVATIONLINKWITHOUTCODE: পৃষ্ঠার URL যেখানে অ্যাক্টিভেশন কোড প্রবেশ করানো যেতে পারে।
 		 অ্যাক্টিভেশন কোড: অ্যাক্টিভেশন কোড।
 	 @বর্ণনা:
 */
 $txt['admin_approve_activation_subject'] = '{FORUMNAME} এ স্বাগতম';
 $txt['admin_approve_activation_body'] = 'স্বাগতম, {USERNAME}!

 {FORUMNAME}-এ আপনার অ্যাকাউন্ট ফোরাম প্রশাসক দ্বারা অনুমোদিত হয়েছে৷  আপনি লগ ইন করার আগে, আপনাকে প্রথমে নিম্নলিখিত লিঙ্কটি নির্বাচন করে আপনার অ্যাকাউন্ট সক্রিয় করতে হবে:

 {ACTIVATIONLINK}

 অ্যাক্টিভেশন নিয়ে আপনার কোনো সমস্যা হলে, অনুগ্রহ করে {ACTIVATIONLINKWITHOUTCODE} এ যান এবং "{ACTIVATIONCODE}" কোডটি লিখুন।

 {সম্পূর্ণ}';

 /**
 	 @additional_params: admin_approve_reject
 		 USERNAME: ইমেল গ্রহণকারী সদস্যের ব্যবহারকারীর নাম।
 	 @বর্ণনা:
 */
 $txt['admin_approve_reject_subject'] = 'নিবন্ধন প্রত্যাখ্যান';
 $txt['admin_approve_reject_body'] = '{USERNAME},

 দুঃখজনকভাবে, আপনার {FORUMNAME} এ যোগদানের আবেদন প্রত্যাখ্যান করা হয়েছে।

 {সম্পূর্ণ}';

 /**
 	 @additional_params: admin_approve_delete
 		 USERNAME: ইমেল গ্রহণকারী সদস্যের ব্যবহারকারীর নাম।
 	 @বর্ণনা:
 */
 $txt['admin_approve_delete_subject'] = 'অ্যাকাউন্ট মুছে ফেলা হয়েছে';
 $txt['admin_approve_delete_body'] = '{USERNAME},

 {FORUMNAME} এ আপনার অ্যাকাউন্ট মুছে ফেলা হয়েছে।  এটি হতে পারে কারণ আপনি কখনই আপনার অ্যাকাউন্ট সক্রিয় করেননি, এই ক্ষেত্রে আপনি আবার নিবন্ধন করতে সক্ষম হবেন।

 {সম্পূর্ণ}';

 /**
 	 @additional_params: admin_approve_remind
 		 USERNAME: ইমেল গ্রহণকারী সদস্যের ব্যবহারকারীর নাম।
 		 ACTIVATIONLINK: সদস্যের অ্যাকাউন্ট সক্রিয় করার URL লিঙ্ক।
 		 ACTIVATIONLINKWITHOUTCODE: পৃষ্ঠার URL যেখানে অ্যাক্টিভেশন কোড প্রবেশ করানো যেতে পারে।
 		 অ্যাক্টিভেশন কোড: অ্যাক্টিভেশন কোড।
 	 @বর্ণনা:
 */
 $txt['admin_approve_remind_subject'] = 'রেজিস্ট্রেশন রিমাইন্ডার';
 $txt['admin_approve_remind_body'] = '{USERNAME},
 আপনি এখনও {FORUMNAME} এ আপনার অ্যাকাউন্ট সক্রিয় করেননি৷

 আপনার অ্যাকাউন্ট সক্রিয় করতে নীচের লিঙ্কটি ব্যবহার করুন:
 {ACTIVATIONLINK}

 অ্যাক্টিভেশন নিয়ে আপনার কোনো সমস্যা হলে, অনুগ্রহ করে {ACTIVATIONLINKWITHOUTCODE} এ যান এবং "{ACTIVATIONCODE}" কোডটি লিখুন।

 {সম্পূর্ণ}';

 /**
 	 @অতিরিক্ত_পরম:
 		 USERNAME: ইমেল গ্রহণকারী সদস্যের ব্যবহারকারীর নাম।
 		 ACTIVATIONLINK: সদস্যের অ্যাকাউন্ট সক্রিয় করার URL লিঙ্ক।
 		 ACTIVATIONLINKWITHOUTCODE: পৃষ্ঠার URL যেখানে অ্যাক্টিভেশন কোড প্রবেশ করানো যেতে পারে।
 		 অ্যাক্টিভেশন কোড: অ্যাক্টিভেশন কোড।
 	 @বর্ণনা:
 */
 $txt['admin_register_activate_subject'] = '{FORUMNAME} এ স্বাগতম';
 $txt['admin_register_activate_body'] = '{FORUMNAME} এ নিবন্ধন করার জন্য আপনাকে ধন্যবাদ।  আপনার ব্যবহারকারীর নাম হল {USERNAME} এবং আপনার পাসওয়ার্ড হল {PASSWORD}৷

 আপনি লগ ইন করার আগে, আপনাকে প্রথমে নিম্নলিখিত লিঙ্কটি নির্বাচন করে আপনার অ্যাকাউন্ট সক্রিয় করতে হবে:

 {ACTIVATIONLINK}

 অ্যাক্টিভেশন নিয়ে আপনার কোনো সমস্যা হলে, অনুগ্রহ করে {ACTIVATIONLINKWITHOUTCODE} এ যান এবং "{ACTIVATIONCODE}" কোডটি লিখুন।

 {সম্পূর্ণ}';

 $txt['admin_register_immediate_subject'] = '{FORUMNAME} এ স্বাগতম';
 $txt['admin_register_immediate_body'] = '{FORUMNAME} এ নিবন্ধন করার জন্য আপনাকে ধন্যবাদ।  আপনার ব্যবহারকারীর নাম হল {USERNAME}, আপনার পাসওয়ার্ড হল {PASSWORD} এবং ফোরাম URL হল: {SCRIPTURL}৷

 {সম্পূর্ণ}';

 /**
 	 @অতিরিক্ত_পরম: নতুন_ঘোষণা
 		 টপিক সাবজেক্ট: যে বিষয়ের বিষয় ঘোষণা করা হচ্ছে।
 		 বার্তা: ঘোষিত বিষয়ের প্রথম পোস্টের মেসেজ বডি।
 		 TOPICLINK: বিষয়ের একটি লিঙ্ক ঘোষণা করা হচ্ছে।
 		 UNSUBSCRIBELINK: ঘোষণা থেকে সদস্যতা ত্যাগ করার লিঙ্ক।
 	 @বর্ণনা:
 */
 $txt['new_announcement_subject'] = 'নতুন ঘোষণা: {TOPICSUBJECT}';
 $txt['new_announcement_body'] = '{মেসেজ}

 আপনি এই লিঙ্কটি অনুসরণ করে সম্পূর্ণ ঘোষণা দেখতে পারেন:
 {TOPICLINK}

 এই ঘোষণাগুলি থেকে সদস্যতা ত্যাগ করতে, এই লিঙ্কটি অনুসরণ করুন:
 {UNSUBSCRIBELINK}

 আপনি যে ইমেল বিজ্ঞপ্তিগুলি পান তার উপর আরও নিয়ন্ত্রণের জন্য, ফোরামে লগইন করুন এবং আপনার প্রোফাইলের বিজ্ঞপ্তি এলাকায় যান৷

 {সম্পূর্ণ}';

 /**
 	 @additional_params: notify_boards_once_body
 		 TOPICSUBJECT: বিষয়ের বিষয় বিজ্ঞপ্তির কারণ
 		 TOPICLINK: বিষয়ের একটি লিঙ্ক।
 		 বার্তা: এটি বার্তার মূল অংশ।
 		 UNSUBSCRIBELINK: বিজ্ঞপ্তি থেকে সদস্যতা ত্যাগ করার লিঙ্ক।
 	 @বর্ণনা:
 */
['notify_boards_once_body_subject'] = 'নতুন বিষয়: {TOPICSUBJECT}';
 $txt['notify_boards_once_body_body'] = 'একটি নতুন বিষয়, \'{TOPICSUBJECT}\', একটি বোর্ডে তৈরি করা হয়েছে যা আপনি দেখছেন।

 আপনি এটা দেখতে পারেন
 {TOPICLINK}

 আরো বিষয় পোস্ট করা হতে পারে, কিন্তু আপনি এই বোর্ডের জন্য আরও ইমেল বিজ্ঞপ্তি পাবেন না যতক্ষণ না আপনি বোর্ডে ফিরে আসেন এবং সেগুলির কিছু না পড়েন।

 বিষয়ের পাঠ্য নীচে দেখানো হয়েছে:
 {মেসেজ}

 এই লিঙ্কটি ব্যবহার করে এই বোর্ড থেকে নতুন বিষয়গুলি থেকে সদস্যতা ত্যাগ করুন:
 {UNSUBSCRIBELINK}

 {সম্পূর্ণ}';

 /**
 	 @additional_params: notify_boards_one
 		 TOPICSUBJECT: বিষয়ের বিষয় বিজ্ঞপ্তির কারণ
 		 TOPICLINK: বিষয়ের একটি লিঙ্ক।
 		 UNSUBSCRIBELINK: বিজ্ঞপ্তি থেকে সদস্যতা ত্যাগ করার লিঙ্ক।
 	 @বর্ণনা:
 */
 $txt['notify_boards_once_subject'] = 'নতুন বিষয়: {TOPICSUBJECT}';
 $txt['notify_boards_once_body'] = 'একটি নতুন বিষয়, \'{TOPICSUBJECT}\', একটি বোর্ডে তৈরি করা হয়েছে যা আপনি দেখছেন।

 আপনি এটা দেখতে পারেন
 {TOPICLINK}

 আরো বিষয় পোস্ট করা হতে পারে, কিন্তু আপনি এই বোর্ডের জন্য আরও ইমেল বিজ্ঞপ্তি পাবেন না যতক্ষণ না আপনি বোর্ডে ফিরে আসেন এবং সেগুলির কিছু না পড়েন।

 এই লিঙ্কটি ব্যবহার করে এই বোর্ড থেকে নতুন বিষয়গুলি থেকে সদস্যতা ত্যাগ করুন:
 {UNSUBSCRIBELINK}

 {সম্পূর্ণ}';

 /**
 	 @additional_params: notify_boards_body
 		 TOPICSUBJECT: বিষয়ের বিষয় বিজ্ঞপ্তির কারণ
 		 TOPICLINK: বিষয়ের একটি লিঙ্ক।
 		 বার্তা: এটি বার্তার মূল অংশ।
 		 UNSUBSCRIBELINK: বিজ্ঞপ্তি থেকে সদস্যতা ত্যাগ করার লিঙ্ক।
 	 @বর্ণনা:
 */
 $txt['notify_boards_body_subject'] = 'নতুন বিষয়: {TOPICSUBJECT}';
 $txt['notify_boards_body_body'] = 'একটি নতুন বিষয়, \'{TOPICSUBJECT}\', একটি বোর্ডে তৈরি করা হয়েছে যা আপনি দেখছেন।

 আপনি এটা দেখতে পারেন
 {TOPICLINK}

 বিষয়ের পাঠ্য নীচে দেখানো হয়েছে:
 {মেসেজ}

 এই লিঙ্কটি ব্যবহার করে এই বোর্ড থেকে নতুন বিষয়গুলি থেকে সদস্যতা ত্যাগ করুন:
 {UNSUBSCRIBELINK}

 {সম্পূর্ণ}';

 /**
 	 @additional_params: notify_boards
 		 TOPICSUBJECT: বিষয়ের বিষয় বিজ্ঞপ্তির কারণ
 		 TOPICLINK: বিষয়ের একটি লিঙ্ক।
 		 UNSUBSCRIBELINK: বিজ্ঞপ্তি থেকে সদস্যতা ত্যাগ করার লিঙ্ক।
 	 @বর্ণনা:
 */
 $txt['notify_boards_subject'] = 'নতুন বিষয়: {TOPICSUBJECT}';
 $txt['notify_boards_body'] = 'একটি নতুন বিষয়, \'{TOPICSUBJECT}\', একটি বোর্ডে তৈরি করা হয়েছে যা আপনি দেখছেন৷

 আপনি এটা দেখতে পারেন
 {TOPICLINK}

 এই লিঙ্কটি ব্যবহার করে এই বোর্ড থেকে নতুন বিষয়গুলি থেকে সদস্যতা ত্যাগ করুন:
 {UNSUBSCRIBELINK}

 {সম্পূর্ণ}';

 /**
 	 @additional_params: alert_unapproved_reply
 		 SUBJECT: বিষয়বস্তু বিজ্ঞপ্তির কারণ
 		 LINK: বিষয়ের একটি লিঙ্ক।
 	 @বর্ণনা:
 */ 
 $txt['alert_unapproved_reply_subject'] = 'বিষয় উত্তর: {SUBJECT}';
 $txt['alert_unapproved_reply_body'] = '{POSTERNAME} দ্বারা \'{SUBJECT}\'-এ একটি উত্তর পোস্ট করা হয়েছে।

 আপনি এটা দেখতে পারেন
 {লিঙ্ক}

 {সম্পূর্ণ}';

 /**
 	 @অতিরিক্ত_পরম: অননুমোদিত_সংযুক্তি
 		 SUBJECT: বিষয়বস্তু বিজ্ঞপ্তির কারণ
 		 LINK: সংযুক্তি সহ বার্তার একটি লিঙ্ক।
 	 @বর্ণনা:
 */
 $txt['unapproved_attachment_subject'] = 'এতে নতুন অননুমোদিত সংযুক্তি: {SUBJECT}';
 $txt['unapproved_attachment_body'] = '\'{SUBJECT}\'-এ একটি নতুন সংযুক্তি করা হয়েছে যা অনুমোদন করা প্রয়োজন।

 আপনি নীচের লিঙ্ক থেকে এই সংযুক্তিটিকে অনুমোদন বা প্রত্যাখ্যান করতে পারেন যা আপনাকে বার্তায় নিয়ে যাবে যে এটি একটি অংশ।

 {লিঙ্ক}

 {সম্পূর্ণ}';

 /**
 	 @additional_params: alert_unapproved_post
 		 SUBJECT: বিষয়বস্তু বিজ্ঞপ্তির কারণ
 		 LINK: বিষয়ের একটি লিঙ্ক।
 	 @বর্ণনা:
 */
 $txt['alert_unapproved_post_subject'] = 'নতুন অননুমোদিত পোস্ট: {SUBJECT}';
 $txt['alert_unapproved_post_body'] = 'একটি নতুন পোস্ট করা হয়েছে যা অনুমোদন করা প্রয়োজন: \'{SUBJECT}\'

 আপনি নীচের লিঙ্কটি ব্যবহার করে এই পোস্টটি অনুমোদন বা প্রত্যাখ্যান করতে পারেন:
 {লিঙ্ক}

 {সম্পূর্ণ}';

 /**
 	 @additional_params: alert_unapproved_topic
 		 SUBJECT: বিষয়বস্তু বিজ্ঞপ্তির কারণ
 		 LINK: বিষয়ের একটি লিঙ্ক।
 	 @বর্ণনা:
 */
 $txt['alert_unapproved_topic_subject'] = 'নতুন অননুমোদিত বিষয়: {SUBJECT}';
 $txt['alert_unapproved_topic_body'] = 'একটি নতুন বিষয় তৈরি করা হয়েছে যা অনুমোদন করা প্রয়োজন: \'{SUBJECT}\'

 আপনি নীচের লিঙ্কটি ব্যবহার করে এই বিষয়টি অনুমোদন বা প্রত্যাখ্যান করতে পারেন:
 {লিঙ্ক}

 {সম্পূর্ণ}';

 /**
 	 @অতিরিক্ত_পরামর্শ: অনুরোধ_সদস্যতা
 		 RECPNAME: ইমেল গ্রহণকারী ব্যক্তির নাম
 		 APPLYNAME: গ্রুপ সদস্যতার জন্য আবেদনকারী ব্যক্তির নাম
 		 GROUPNAME: যে গোষ্ঠীতে প্রয়োগ করা হচ্ছে তার নাম৷
 		 কারণ: গ্রুপে যোগ দিতে চাওয়ার জন্য আবেদনকারীর দেওয়া কারণ।
 		 MODLINK: গ্রুপ মডারেশন পৃষ্ঠার লিঙ্ক।
 	 @বর্ণনা:
 */
 $txt['request_membership_subject'] = 'নতুন গ্রুপ অ্যাপ্লিকেশন';
 $txt['request_membership_body'] = '{RECPNAME},

 {APPLYNAME} "{GROUPNAME}" গ্রুপে সদস্যতার অনুরোধ করেছে৷  ব্যবহারকারী নিম্নলিখিত কারণ দিয়েছেন:

 {কারণ}

 আপনি নীচের লিঙ্কটি ব্যবহার করে এই আবেদনটি অনুমোদন বা প্রত্যাখ্যান করতে পারেন:

 {MODLINK}

 {সম্পূর্ণ}';

 /**
 	 @additional_params: পেইড_সাবস্ক্রিপশন
 		 REALNAME: ইমেল গ্রহণকারী ব্যক্তির আসল (প্রদর্শন) নাম।
 		 PROFILE_LINK: ইমেল গ্রহণকারী সদস্যের প্রোফাইলের লিঙ্ক যেখানে পুনর্নবীকরণ করা যেতে পারে।
 		 সাবস্ক্রিপশন: সাবস্ক্রিপশনের নাম।
 		 END_DATE: মেয়াদ শেষ হওয়ার তারিখ।
 	 @বর্ণনা:
 */
 $txt['paid_subscription_reminder_subject'] = 'সাবস্ক্রিপশনের মেয়াদ {FORUMNAME} এ শেষ হতে চলেছে';
 $txt['paid_subscription_reminder_body'] = '{REALNAME},

 {FORUMNAME} এ আপনার সদস্যতার মেয়াদ শেষ হতে চলেছে৷  আপনি যদি স্বয়ংক্রিয় পুনর্নবীকরণের জন্য নির্বাচিত হয়ে থাকেন তবে আপনাকে পদক্ষেপ নেওয়ার দরকার নেই;  অন্যথায়, আপনি আরও একবার সদস্যতা নেওয়ার কথা বিবেচনা করতে পারেন।  বিস্তারিত নিচে দেওয়া হল:

 সদস্যতার নাম: {SUBSCRIPTION}
 মেয়াদ শেষ হবে: {END_DATE}

 আপনার সদস্যতা সম্পাদনা করতে নিম্নলিখিত URL দেখুন:
 {PROFILE_LINK}

 {সম্পূর্ণ}';

 /**
 	 @additional_params: activate_reactivate
 		 ACTIVATIONLINK: সদস্যের অ্যাকাউন্ট পুনরায় সক্রিয় করার URL লিঙ্ক।
 		 ACTIVATIONCODE: সদস্যের অ্যাকাউন্ট পুনরায় সক্রিয় করার জন্য প্রয়োজনীয় কোড।
 		 ACTIVATIONLINKWITHOUTCODE: পৃষ্ঠার URL যেখানে অ্যাক্টিভেশন কোড প্রবেশ করানো যেতে পারে।
 	 @বর্ণনা:
 */
 $txt['activate_reactivate_subject'] = '{FORUMNAME} এ আবার স্বাগতম';
 $txt['activate_reactivate_body'] = 'আপনার ইমেল ঠিকানা পুনরায় যাচাই করার জন্য, আপনার অ্যাকাউন্ট নিষ্ক্রিয় করা হয়েছে।  এটি আবার সক্রিয় করতে নিম্নলিখিত লিঙ্কে ক্লিক করুন:
 {ACTIVATIONLINK}

 অ্যাক্টিভেশন নিয়ে আপনার কোনো সমস্যা হলে, অনুগ্রহ করে {ACTIVATIONLINKWITHOUTCODE} এ যান এবং "{ACTIVATIONCODE}" কোড ব্যবহার করুন।

 {সম্পূর্ণ}';

 /**
 	 @additional_params: ভুলে গেছি_পাসওয়ার্ড
 		 REALNAME: রিমাইন্ডার গ্রহণকারী ব্যক্তির আসল (প্রদর্শন) নাম।
 		 REMINDLINK: পাসওয়ার্ড রিসেট করার লিঙ্ক।
 		 আইপি: অনুরোধকারীর আইপি ঠিকানা।
 		 সদস্য নাম:
 	 @বর্ণনা:
 */
 $txt['forgot_password_subject'] = '{FORUMNAME}'-এর জন্য নতুন পাসওয়ার্ড;
 $txt['forgot_password_body'] = 'প্রিয় {REALNAME},
 এই মেলটি পাঠানো হয়েছে কারণ আপনার অ্যাকাউন্টে \'পাসওয়ার্ড ভুলে গেছি\' ফাংশন প্রয়োগ করা হয়েছে।  একটি নতুন পাসওয়ার্ড সেট করতে, নিম্নলিখিত লিঙ্কে ক্লিক করুন:
 {রিমাইন্ডলিঙ্ক}

 আইপি: {IP}
 ব্যবহারকারীর নাম: {MEMBERNAME}

 {সম্পূর্ণ}';

 /**
 	 @additional_params: send_email
 		 EMAILSUBJECT: ব্যবহারকারী যে বিষয়টি ইমেল করতে চায়।
 		 EMAILBODY: যে বডিটি ব্যবহারকারী ইমেল করতে চায়৷
 		 SENDERNAME: ইমেল পাঠানো সদস্যের নাম।
 		 RECPNAME: ইমেল গ্রহণকারী ব্যক্তির নাম।
 	 @বর্ণনা:
 */
 $txt['send_email_subject'] = '{EMAILSUBJECT}';
 $txt['send_email_body'] = '{EMAILBODY}';

 /**
 	 @additional_params: report_to_moderator
 		 বিষয় বিষয়: রিপোর্ট করা পোস্টের বিষয়।
 		 পোস্টারনাম: রিপোর্ট করা পোস্টের লেখকের নাম।
 		 রিপোর্টারনাম: পোস্টটি রিপোর্ট করা ব্যক্তির নাম৷
 		 TOPICLINK: পোস্টের URL যা রিপোর্ট করা হচ্ছে।
 		 REPORTLINK: মডারেশন সেন্টার রিপোর্টের URL।
 		 মন্তব্য: প্রতিবেদকের দ্বারা বামে মন্তব্য, তারা পোস্ট রিপোর্ট করছেন কেন ব্যাখ্যা করার জন্য আশা করি.
 	 @description: যখন কোনো ব্যবহারকারী কোনো পোস্টের প্রতিবেদন করেন তখন এই ইমেলটি সেই বোর্ডের মডারেটর এবং প্রশাসকদের কাছে পাঠানো হয়।
 */
 $txt['report_to_moderator_subject'] = 'রিপোর্ট করা পোস্ট: {POSTERNAME} দ্বারা {TOPICSUBJECT}';
 $txt['report_to_moderator_body'] = 'নিম্নলিখিত পোস্ট, "{TOPICSUBJECT}" {POSTERNAME}-এর দ্বারা {REPORTERNAME} একটি বোর্ডে রিপোর্ট করেছে যা আপনি মডারেট করেছেন:

 বিষয়: {TOPICLINK}
 নিয়ন্ত্রণ কেন্দ্র: {REPORTLINK}

 প্রতিবেদক নিম্নলিখিত মন্তব্য করেছেন:
 {মন্তব্য}

 {সম্পূর্ণ}';

 /**
 	 @additional_params: report_to_moderator
 		 বিষয় বিষয়: রিপোর্ট করা পোস্টের বিষয়।
 		 পোস্টারনাম: রিপোর্ট করা পোস্টের লেখকের নাম।
 		 মন্তব্যকারীর নাম: যে ব্যক্তি প্রতিবেদনটির উত্তর দিয়েছেন তার নাম৷
 		 TOPICLINK: পোস্টের URL যা রিপোর্ট করা হচ্ছে।
 		 REPORTLINK: মডারেশন সেন্টার রিপোর্টের URL।
 	 @description: যখন একজন মডারেটর একটি মডারেশন রিপোর্টের উত্তর দেয়, তখন এটি অন্য মডারেটরদের কাছে পাঠানো যেতে পারে যারা আগে উত্তর দিয়েছিল।
 */
 $txt['reply_to_moderator_subject'] = 'প্রতিবেদিত পোস্টের ফলো-আপ: {POSTERNAME} দ্বারা {TOPICSUBJECT};
 $txt['reply_to_moderator_body'] = 'আগে, "{TOPICSUBJECT}" মডারেটরদের কাছে রিপোর্ট করা হয়েছিল।

 তারপর থেকে, {COMMENTERNAME} রিপোর্টে একটি মন্তব্য যোগ করেছে৷  আরও তথ্য ফোরামে পাওয়া যাবে.

 বিষয়: {TOPICLINK}
 নিয়ন্ত্রণ কেন্দ্র: {REPORTLINK}

 {সম্পূর্ণ}';

 /**
 	 @additional_params: report_user_profile
 		 সদস্য নাম: রিপোর্ট করা ব্যবহারকারীর প্রদর্শন নাম
 		 রিপোর্টার নাম: প্রোফাইলে রিপোর্ট করা ব্যক্তির নাম
 		 PROFILELINK: প্রোফাইলের লিঙ্ক যা রিপোর্ট করা হয়েছে
 		 মন্তব্য: রিপোর্টার দ্বারা বাম মন্তব্য.
  	 @description: যখন একজন ব্যবহারকারীর প্রোফাইল রিপোর্ট করা হয়
 */
 $txt['report_member_profile_subject'] = 'প্রতিবেদিত প্রোফাইল: {MEMBERNAME}';
 $txt['report_member_profile_body'] = '"{MEMBERNAME}"-এর প্রোফাইল {REPORTERNAME} রিপোর্ট করেছে৷

 প্রোফাইল: {PROFILELINK}
 নিয়ন্ত্রণ কেন্দ্র: {REPORTLINK}

 প্রতিবেদক নিম্নলিখিত মন্তব্য করেছেন:
 {মন্তব্য}

 {সম্পূর্ণ}';

 /**
 	 @additional_params: report_user_profile
 		 সদস্য নাম: রিপোর্ট করা ব্যবহারকারীর প্রদর্শন নাম
 		 মন্তব্যকারীর নাম: যে ব্যক্তি মন্তব্যটি যোগ করেছেন তার নাম৷
 		 PROFILELINK: প্রোফাইলের লিঙ্ক যা রিপোর্ট করা হয়েছে
  	 @description: যখন কেউ একটি প্রোফাইল সম্পর্কে একটি প্রতিবেদনের উত্তর দেয়, তখন এটি অন্যদের কাছে পাঠানো যেতে পারে যারা উত্তর দিয়েছেন
 */
 $txt['reply_to_member_report_subject'] = 'প্রতিবেদিত প্রোফাইলে ফলো-আপ: {MEMBERNAME}';
 $txt['reply_to_member_report_body'] = 'আগে, {MEMBERNAME}-এর প্রোফাইল রিপোর্ট করা হয়েছিল।

 তারপর থেকে, {COMMENTERNAME} রিপোর্টে একটি মন্তব্য যোগ করেছে৷  আরও তথ্য ফোরামে পাওয়া যাবে.

 প্রোফাইল: {PROFILELINK}
 নিয়ন্ত্রণ কেন্দ্র: {REPORTLINK}

 {সম্পূর্ণ}';

 /**
 	 @অতিরিক্ত_পরামর্শ: পরিবর্তন_পাসওয়ার্ড
 		 USERNAME: ইমেল গ্রহণকারী সদস্যের ব্যবহারকারীর নাম।
 		 পাসওয়ার্ড: সদস্যের জন্য পাসওয়ার্ড।
 	 @বর্ণনা:
 */
 $txt['change_password_subject'] = 'নতুন পাসওয়ার্ডের বিবরণ';
 $txt['change_password_body'] = 'প্রিয় {USERNAME},

 {FORUMNAME} এ আপনার লগইন বিশদ পরিবর্তন করা হয়েছে এবং আপনার পাসওয়ার্ড পুনরায় সেট করা হয়েছে।  নীচে আপনার নতুন লগইন বিবরণ আছে.

 আপনার ব্যবহারকারীর নাম "{USERNAME}" এবং আপনার পাসওয়ার্ড হল "{PASSWORD}"৷

 আপনি প্রোফাইল পৃষ্ঠায় গিয়ে লগ ইন করার পরে, অথবা আপনি লগ ইন করার পরে এই পৃষ্ঠায় গিয়ে এটি পরিবর্তন করতে পারেন:
 {SCRIPTURL}?action=profile

 {সম্পূর্ণ}';

 /**
 	 @অতিরিক্ত_পরামর্শ: রেজিস্টার_অ্যাক্টিভেট
 		 REALNAME: ইমেল গ্রহণকারী সদস্যের প্রদর্শন নাম।
 		 USERNAME: ইমেল গ্রহণকারী সদস্যের ব্যবহারকারীর নাম।
 		 পাসওয়ার্ড: সদস্যের জন্য পাসওয়ার্ড।
 		 ACTIVATIONLINK: সদস্যের অ্যাকাউন্ট পুনরায় সক্রিয় করার URL লিঙ্ক।
 		 ACTIVATIONLINKWITHOUTCODE: পৃষ্ঠার URL যেখানে অ্যাক্টিভেশন কোড প্রবেশ করানো যেতে পারে।
 		 ACTIVATIONCODE: সদস্যের অ্যাকাউন্ট পুনরায় সক্রিয় করার জন্য প্রয়োজনীয় কোড।
 		 FORGOTPASSWORDLINK: "পাসওয়ার্ড ভুলে গেছেন" পৃষ্ঠার URL।
 	 @বর্ণনা:
 */
 $txt['register_activate_subject'] = '{FORUMNAME} এ স্বাগতম';
 $txt['register_activate_body'] = '{FORUMNAME} এ নিবন্ধন করার জন্য আপনাকে ধন্যবাদ।  আপনার ব্যবহারকারীর নাম হল {USERNAME}।  আপনি যদি আপনার পাসওয়ার্ড ভুলে যান, আপনি {FORGOTPASSWORDLINK} এ গিয়ে এটি পুনরায় সেট করতে পারেন৷

 আপনি লগ ইন করার আগে, আপনাকে প্রথমে আপনার অ্যাকাউন্ট সক্রিয় করতে হবে।  এটি করতে, অনুগ্রহ করে এই লিঙ্কটি অনুসরণ করুন:

 {ACTIVATIONLINK}

 অ্যাক্টিভেশন নিয়ে আপনার কোনো সমস্যা হলে, অনুগ্রহ করে {ACTIVATIONLINKWITHOUTCODE} এ যান এবং "{ACTIVATIONCODE}" কোড ব্যবহার করুন।

 {সম্পূর্ণ}';

 /**
 	 @অতিরিক্ত_পরামর্শ: রেজিস্টার_কোপা
 		 REALNAME: ইমেল গ্রহণকারী সদস্যের প্রদর্শন নাম।
 		 USERNAME: ইমেল গ্রহণকারী সদস্যের ব্যবহারকারীর নাম।
 		 পাসওয়ার্ড: সদস্যের জন্য পাসওয়ার্ড।
 		 COPPALINK: coppa ফর্মের URL লিঙ্ক।
 		 FORGOTPASSWORDLINK: "পাসওয়ার্ড ভুলে গেছেন" পৃষ্ঠার URL।
 	 @বর্ণনা:
 */
 $txt['register_coppa_subject'] = '{FORUMNAME} এ স্বাগতম';
 $txt['register_coppa_body'] = '{FORUMNAME} এ নিবন্ধন করার জন্য আপনাকে ধন্যবাদ।  আপনার ব্যবহারকারীর নাম হল {USERNAME}।  আপনি যদি আপনার পাসওয়ার্ড ভুলে যান, আপনি এটি {FORGOTPASSWORDLINK} এ পরিবর্তন করতে পারেন

 আপনি লগ ইন করার আগে, প্রশাসকের আপনার সম্প্রদায়ে যোগদানের জন্য আপনার পিতামাতা/অভিভাবকের সম্মতি প্রয়োজন৷  আপনি নীচের লিঙ্কে আরও তথ্য পেতে পারেন:

 {COPPALINK}

 {সম্পূর্ণ}';

 /**
 	 @অতিরিক্ত_পরামর্শ: register_immediate
 		 REALNAME: ইমেল গ্রহণকারী সদস্যের প্রদর্শন নাম।
 		 USERNAME: ইমেল গ্রহণকারী সদস্যের ব্যবহারকারীর নাম।
 		 পাসওয়ার্ড: সদস্যের জন্য পাসওয়ার্ড।
 		 FORGOTPASSWORDLINK: "পাসওয়ার্ড ভুলে গেছি" পৃষ্ঠার URL।
 	 @বর্ণনা:
 */
 $txt['register_immediate_subject'] = '{FORUMNAME} এ স্বাগতম';
 $txt['register_immediate_body'] = '{FORUMNAME} এ নিবন্ধন করার জন্য আপনাকে ধন্যবাদ।  আপনার ব্যবহারকারীর নাম হল {USERNAME}।  আপনি যদি আপনার পাসওয়ার্ড ভুলে যান, আপনি এটি {FORGOTPASSWORDLINK} এ পরিবর্তন করতে পারেন৷

 {সম্পূর্ণ}';

 /**
 	 @additional_params: register_pending
 		 REALNAME: ইমেল গ্রহণকারী সদস্যের প্রদর্শন নাম।
 		 USERNAME: ইমেল গ্রহণকারী সদস্যের ব্যবহারকারীর নাম।
 		 পাসওয়ার্ড: সদস্যের জন্য পাসওয়ার্ড।
 		 FORGOTPASSWORDLINK: "পাসওয়ার্ড ভুলে গেছি" পৃষ্ঠার URL।
 	 @বর্ণনা:
 */
 $txt['register_pending_subject'] = '{FORUMNAME} এ স্বাগতম';
 $txt['register_pending_body'] = 'হ্যালো {REALNAME}, {FORUMNAME} এ আপনার নিবন্ধনের অনুরোধ গৃহীত হয়েছে৷

 আপনি যে ব্যবহারকারীর নাম দিয়ে নিবন্ধন করতে চান সেটি ছিল {USERNAME}৷  আপনি যদি আপনার পাসওয়ার্ড ভুলে যান, আপনি এটি {FORGOTPASSWORDLINK} এ পরিবর্তন করতে পারেন৷

 আপনি লগ ইন করতে এবং ফোরাম ব্যবহার শুরু করার আগে, আপনার অনুরোধ পর্যালোচনা করা হবে এবং অনুমোদিত হবে।

 {সম্পূর্ণ}';

 /**
 	 @additional_params: বিজ্ঞপ্তি_উত্তর
 		 বিষয় বিষয়:
 		 পোস্টার নাম:
 		 টপিকলিঙ্ক:
 		 আনসাবস্ক্রাইব লিঙ্ক:
 	 @বর্ণনা:
 */
 $txt['notification_reply_subject'] = 'বিষয় উত্তর: {TOPICSUBJECT}';
 $txt['notification_reply_body'] = 'আপনি দেখছেন এমন একটি বিষয়ে, {POSTERNAME} দ্বারা একটি উত্তর পোস্ট করা হয়েছে৷

 উত্তরটি এখানে দেখুন: {TOPICLINK}

 এই লিঙ্কটি ব্যবহার করে এই বিষয় থেকে সদস্যতা ত্যাগ করুন: {UNSUBSCRIBELINK}

 {সম্পূর্ণ}';

 /**
 	 @additional_params: notification_reply_body
 		 বিষয় বিষয়:
 		 পোস্টার নাম:
 		 টপিকলিঙ্ক:
 		 আনসাবস্ক্রাইব লিঙ্ক:
 		 বার্তা:
 	 @বর্ণনা:
 */
 $txt['notification_reply_body_subject'] = 'বিষয় উত্তর: {TOPICSUBJECT}';
 $txt['notification_reply_body_body'] = 'আপনি যে বিষয়ে দেখছেন, সেখানে একটি উত্তর পোস্ট করেছেন {POSTERNAME}।

 উত্তরটি এখানে দেখুন: {TOPICLINK}

 এই লিঙ্কটি ব্যবহার করে এই বিষয় থেকে সদস্যতা ত্যাগ করুন: {UNSUBSCRIBELINK}

 উত্তরের পাঠ্য নীচে দেখানো হয়েছে:
 {মেসেজ}

 {সম্পূর্ণ}';

 /**
 	 @additional_params: notification_reply_one
 		 বিষয় বিষয়:
 		 পোস্টার নাম:
 		 টপিকলিঙ্ক:
 		 আনসাবস্ক্রাইব লিঙ্ক:
 	 @বর্ণনা:
 */
 $txt['notification_reply_once_subject'] = 'বিষয় উত্তর: {TOPICSUBJECT}';
 $txt['notification_reply_once_body'] = 'আপনি যে বিষয়ে দেখছেন, সেখানে একটি উত্তর পোস্ট করেছেন {POSTERNAME}।

 উত্তরটি এখানে দেখুন: {TOPICLINK}

 এই লিঙ্কটি ব্যবহার করে এই বিষয় থেকে সদস্যতা ত্যাগ করুন: {UNSUBSCRIBELINK}

 আরও উত্তর পোস্ট করা হতে পারে, কিন্তু আপনি এই বিষয়ের জন্য আর কোনো বিজ্ঞপ্তি পাবেন না যতক্ষণ না আপনি এটিতে যান৷

 {সম্পূর্ণ}';

 /**
 	 @additional_params: notification_reply_body_one
 		 বিষয় বিষয়:
 		 পোস্টার নাম:
 		 টপিকলিঙ্ক:
 		 আনসাবস্ক্রাইব লিঙ্ক:
 		 বার্তা:
 	 @বর্ণনা:
 */
 $txt['notification_reply_body_once_subject'] = 'বিষয় উত্তর: {TOPICSUBJECT}';
 $txt['notification_reply_body_once_body'] = 'আপনি দেখছেন এমন একটি বিষয়ে, {POSTERNAME} দ্বারা একটি উত্তর পোস্ট করা হয়েছে৷

 উত্তরটি এখানে দেখুন: {TOPICLINK}

 এই লিঙ্কটি ব্যবহার করে এই বিষয় থেকে সদস্যতা ত্যাগ করুন: {UNSUBSCRIBELINK}

 উত্তরের পাঠ্য নীচে দেখানো হয়েছে:
 {মেসেজ}

 আরও উত্তর পোস্ট করা হতে পারে, কিন্তু আপনি এই বিষয়ের জন্য আর কোনো বিজ্ঞপ্তি পাবেন না যতক্ষণ না আপনি এটিতে যান৷

 {সম্পূর্ণ}';

 /**
 	 @additional_params: বিজ্ঞপ্তি_স্টিকি
 	 @বর্ণনা:
 */
 $txt['notification_sticky_subject'] = 'বিষয় স্টিকি করা হয়েছে: {TOPICSUBJECT}';
 $txt['notification_sticky_body'] = 'আপনি যে বিষয় দেখছেন সেটি একটি স্টিকি বিষয় হিসেবে চিহ্নিত করা হয়েছে।

 বিষয়টি এখানে দেখুন: {TOPICLINK}

 এই লিঙ্কটি ব্যবহার করে এই বিষয় থেকে সদস্যতা ত্যাগ করুন: {UNSUBSCRIBELINK}

 {সম্পূর্ণ}';

 /**
 	 @additional_params: notification_lock
 	 @বর্ণনা:
 */
 $txt['notification_lock_subject'] = 'বিষয় লক করা হয়েছে: {TOPICSUBJECT}';
 $txt['notification_lock_body'] = 'আপনি যে বিষয় দেখছেন সেটি লক করা হয়েছে।

 বিষয়টি এখানে দেখুন: {TOPICLINK}

 এই লিঙ্কটি ব্যবহার করে এই বিষয় থেকে সদস্যতা ত্যাগ করুন: {UNSUBSCRIBELINK}

 {সম্পূর্ণ}';

 /**
 	 @additional_params: notification_unlock
 	 @বর্ণনা:
 */
 $txt['notification_unlock_subject'] = 'বিষয় আনলক করা হয়েছে: {TOPICSUBJECT}';
 $txt['notification_unlock_body'] = 'আপনি দেখছেন এমন একটি বিষয় আনলক করা হয়েছে।

 বিষয়টি এখানে দেখুন: {TOPICLINK}

 এই লিঙ্কটি ব্যবহার করে এই বিষয় থেকে সদস্যতা ত্যাগ করুন: {UNSUBSCRIBELINK}

 {সম্পূর্ণ}';

 /**
 	 @additional_params: notification_remove
 	 @বর্ণনা:
 */
 $txt['notification_remove_subject'] = 'বিষয় সরানো হয়েছে: {TOPICSUBJECT}';
 $txt['notification_remove_body'] = 'আপনি দেখছেন এমন একটি বিষয় সরিয়ে দেওয়া হয়েছে।

 {সম্পূর্ণ}';

 /**
 	 @additional_params: notification_move
 	 @বর্ণনা:
 */
 $txt['notification_move_subject'] = 'বিষয় সরানো হয়েছে: {TOPICSUBJECT}';
 $txt['notification_move_body'] = 'আপনি যে বিষয় দেখছেন সেটি অন্য বোর্ডে সরানো হয়েছে।

 বিষয়টি এখানে দেখুন: {TOPICLINK}

 এই লিঙ্কটি ব্যবহার করে এই বিষয় থেকে সদস্যতা ত্যাগ করুন: {UNSUBSCRIBELINK}

 {সম্পূর্ণ}';

 /**
 	 @additional_params: notification_merged
 	 @বর্ণনা:
 */
 $txt['notification_merge_subject'] = 'বিষয় একত্রিত হয়েছে: {TOPICSUBJECT}';
 $txt['notification_merge_body'] = 'আপনি যে বিষয়টি দেখছেন সেটি অন্য একটি বিষয়ের সাথে একত্রিত করা হয়েছে।

 নতুন মার্জ করা বিষয় এখানে দেখুন: {TOPICLINK}

 এই লিঙ্কটি ব্যবহার করে এই বিষয় থেকে সদস্যতা ত্যাগ করুন: {UNSUBSCRIBELINK}

 {সম্পূর্ণ}';

 /**
 	 @additional_params: notification_split
 	 @বর্ণনা:
 */
 $txt['notification_split_subject'] = 'বিষয় বিভাজন: {TOPICSUBJECT}';
 $txt['notification_split_body'] = 'আপনি যে বিষয় দেখছেন সেটি দুই বা ততোধিক বিষয়ে বিভক্ত করা হয়েছে।

 এই বিষয়ে কী অবশিষ্ট আছে তা দেখুন: {TOPICLINK}

 এই লিঙ্কটি ব্যবহার করে এই বিষয় থেকে সদস্যতা ত্যাগ করুন: {UNSUBSCRIBELINK}

 {সম্পূর্ণ}';

 /**
 	 @additional_params: admin_notify
 		 ব্যবহারকারীর নাম:
 		 প্রোফাইল লিঙ্ক:
 	 @বর্ণনা:
 */
 $txt['admin_notify_subject'] = 'একজন নতুন সদস্য যোগ দিয়েছেন';
 $txt['admin_notify_body'] = '{USERNAME} এইমাত্র আপনার ফোরামের একজন নতুন সদস্য হিসেবে সাইন আপ করেছেন৷  তাদের প্রোফাইল দেখতে নীচের লিঙ্কে ক্লিক করুন.
 {PROFILELINK}

 {সম্পূর্ণ}';

 /**
 	 @additional_params: admin_notify_approval
 		 ব্যবহারকারীর নাম:
 		 প্রোফাইল লিঙ্ক:
 		 অনুমোদন লিঙ্ক:
 	 @বর্ণনা:
 */
 $txt['admin_notify_approval_subject'] = 'একজন নতুন সদস্য যোগ দিয়েছেন';
 $txt['admin_notify_approval_body'] = '{USERNAME} এইমাত্র আপনার ফোরামের একজন নতুন সদস্য হিসেবে সাইন আপ করেছেন৷  তাদের প্রোফাইল দেখতে নীচের লিঙ্কে ক্লিক করুন.
 {PROFILELINK}

 এই সদস্য পোস্ট করা শুরু করার আগে তাদের প্রথমে তাদের অ্যাকাউন্ট অনুমোদিত হতে হবে।  অনুমোদন স্ক্রীনে যেতে নিচের লিঙ্কে ক্লিক করুন।
 {অনুমোদন}

 {সম্পূর্ণ}';

 /**
 	 @additional_params: admin_attachments_full
 		 আসল নাম:
 	 @বর্ণনা:
 */
 $txt['admin_attachments_full_subject'] = 'জরুরি!  সংযুক্তি ডিরেক্টরি প্রায় পূর্ণ';
 $txt['admin_attachments_full_body'] = '{REALNAME},

 {FORUMNAME} এ সংযুক্তি ডিরেক্টরি প্রায় পূর্ণ।  এই সমস্যা সমাধানের জন্য ফোরাম দেখুন.

 একবার সংযুক্তি ডিরেক্টরিটি তার সর্বাধিক অনুমোদিত আকারে পৌঁছে গেলে ব্যবহারকারীরা সংযুক্তিগুলি পোস্ট করা বা কাস্টম অবতারগুলি আপলোড করতে সক্ষম হবে না (যদি সক্ষম থাকে)।

 {সম্পূর্ণ}';

 /**
 	 @additional_params: পেইড_সাবস্ক্রিপশন_রিফান্ড
 		 নাম: সদস্যতা শিরোনাম৷
 		 REALNAME: প্রাপকদের নাম
 		 ফেরত প্রদানকারী: ব্যবহারকারীর নাম যিনি সদস্যতা নিয়েছেন।
 		 REFUNDNAME: ব্যবহারকারীর ডিসপ্লে নাম যিনি সদস্যতা নিয়েছেন।
 		 তারিখ: আজকের তারিখ।
 		 PROFILELINK: সদস্যদের প্রোফাইলের লিঙ্ক।
 	 @বর্ণনা:
 */
 $txt['paid_subscription_refund_subject'] = 'প্রদত্ত সাবস্ক্রিপশন ফেরত দেওয়া';
 $txt['paid_subscription_refund_body'] = '{REALNAME},

 একজন সদস্য প্রদত্ত সাবস্ক্রিপশনে অর্থ ফেরত পেয়েছেন।  নীচে এই সাবস্ক্রিপশনের বিশদ বিবরণ রয়েছে:

 	 সদস্যতা: {NAME}
 	 ব্যবহারকারীর নাম: {REFUNDNAME} ({REFUNDUSER})
 	 তারিখ: {DATE}

 আপনি নীচের লিঙ্কে ক্লিক করে এই সদস্যের প্রোফাইল দেখতে পারেন:
 {PROFILELINK}

 {সম্পূর্ণ}';

 /**
 	 @additional_params: পেইড_সাবস্ক্রিপশন_নতুন
 		 নাম: সদস্যতা শিরোনাম৷
 		 REALNAME: প্রাপকদের নাম
 		 সাবইমেল: যে ব্যবহারকারী সদস্যতা নিয়েছেন তার ইমেল ঠিকানা
 		 SUBUSER: ব্যবহারকারীর নাম যিনি সদস্যতা নিয়েছেন।
 		 SUBNAME: ব্যবহারকারীর প্রদর্শনের নাম যিনি সদস্যতা নিয়েছেন।
 		 তারিখ: আজকের তারিখ।
 		 PROFILELINK: সদস্যদের প্রোফাইলের লিঙ্ক।
 	 @বর্ণনা:
 */
 $txt['paid_subscription_new_subject'] = 'নতুন প্রদত্ত সাবস্ক্রিপশন';
 $txt['paid_subscription_new_body'] = '{REALNAME},

 একজন সদস্য একটি নতুন প্রদত্ত সাবস্ক্রিপশন নিয়েছেন।  নীচে এই সাবস্ক্রিপশনের বিশদ বিবরণ রয়েছে:

 	 সদস্যতা: {NAME}
 	 ব্যবহারকারীর নাম: {SUBNAME} ({SUBUSER})
 	 ব্যবহারকারীর ইমেল: {SUBEMAIL}
 	 মূল্য: {PRICE}
 	 তারিখ: {DATE}

 আপনি নীচের লিঙ্কে ক্লিক করে এই সদস্যের প্রোফাইল দেখতে পারেন:
 {PROFILELINK}

 {সম্পূর্ণ}';

 /**
 	 @additional_params: পেইড_সাবস্ক্রিপশন_ত্রুটি
 		 ত্রুটি: ত্রুটি বার্তা৷
 		 REALNAME: প্রাপকদের নাম
 	 @বর্ণনা:
 */
 $txt['paid_subscription_error_subject'] = 'প্রদেয় সাবস্ক্রিপশন ত্রুটি ঘটেছে';
 $txt['paid_subscription_error_body'] = 'প্রিয় {REALNAME},

 একটি প্রদত্ত সাবস্ক্রিপশন প্রক্রিয়া করার সময় নিম্নলিখিত ত্রুটি ঘটেছে৷
 --------------------------------------------------  -------------
 {ত্রুটি}

 {সম্পূর্ণ}';

 /**
 	 @অতিরিক্ত_পরম: new_pm
 		 বিষয়: ব্যক্তিগত বার্তা বিষয়.
 		 SENDER: ব্যক্তিগত বার্তা প্রেরণকারী সদস্যের ব্যবহারকারীর নাম।
 		 READLINK: পঠিত পৃষ্ঠাটি সরাসরি অ্যাক্সেস করার লিঙ্ক।
 		 REPLYLINK: সরাসরি উত্তর পৃষ্ঠা অ্যাক্সেস করার লিঙ্ক।
 	 @description: একটি ব্যক্তিগত বার্তা গ্রহণকারীদের কাছে পাঠানো একটি বিজ্ঞপ্তি ইমেল
 */
 $txt['new_pm_subject'] = 'নতুন ব্যক্তিগত বার্তা: {SUBJECT}';
 $txt['new_pm_body'] = 'আপনাকে এইমাত্র {FORUMNAME}-এ {SENDER} দ্বারা একটি ব্যক্তিগত বার্তা পাঠানো হয়েছে৷

 গুরুত্বপূর্ণ: মনে রাখবেন, এটি শুধুমাত্র একটি বিজ্ঞপ্তি।  দয়া করে এই ইমেলের উত্তর দেবেন না।

 এই ব্যক্তিগত বার্তাটি এখানে পড়ুন: {READLINK}

 এখানে এই ব্যক্তিগত বার্তার উত্তর দিন: {REPLYLINK}

 {সম্পূর্ণ}';

 /**
 	 @অতিরিক্ত_পরম: new_pm_body
 		 বিষয়: ব্যক্তিগত বার্তা বিষয়.
 		 SENDER: ব্যক্তিগত বার্তা প্রেরণকারী সদস্যের ব্যবহারকারীর নাম।
 		 বার্তা: ব্যক্তিগত বার্তার পাঠ্য।
 		 REPLYLINK: সরাসরি উত্তর পৃষ্ঠা অ্যাক্সেস করার লিঙ্ক।
 	 @description: একটি ব্যক্তিগত বার্তা গ্রহণকারীদের কাছে পাঠানো একটি বিজ্ঞপ্তি ইমেল
 */
 $txt['new_pm_body_subject'] = 'নতুন ব্যক্তিগত বার্তা: {SUBJECT}';
 $txt['new_pm_body_body'] = 'আপনাকে এইমাত্র {FORUMNAME}-এ {SENDER} দ্বারা একটি ব্যক্তিগত বার্তা পাঠানো হয়েছে৷

 গুরুত্বপূর্ণ: মনে রাখবেন, এটি শুধুমাত্র একটি বিজ্ঞপ্তি।  দয়া করে এই ইমেলের উত্তর দেবেন না।

 তারা আপনাকে যে বার্তাটি পাঠিয়েছে তা হল:

 {মেসেজ}

 এখানে এই ব্যক্তিগত বার্তার উত্তর দিন: {REPLYLINK}

 {সম্পূর্ণ}';

 /**
 	 @additional_params: new_pm_tolist
 		 বিষয়: ব্যক্তিগত বার্তা বিষয়.
 		 SENDER: ব্যক্তিগত বার্তা প্রেরণকারী সদস্যের ব্যবহারকারীর নাম।
 		 READLINK: পঠিত পৃষ্ঠাটি সরাসরি অ্যাক্সেস করার লিঙ্ক।
 		 REPLYLINK: সরাসরি উত্তর পৃষ্ঠা অ্যাক্সেস করার লিঙ্ক।
 		 TOLIST: ব্যবহারকারীদের তালিকা যারা ব্যক্তিগত বার্তা পাবেন।
 	 @description: একটি ব্যক্তিগত বার্তা গ্রহণকারীদের কাছে পাঠানো একটি বিজ্ঞপ্তি ইমেল
 */
 $txt['new_pm_tolist_subject'] = 'নতুন ব্যক্তিগত বার্তা: {SUBJECT}';
 $txt['new_pm_tolist_body'] = 'আপনাকে এবং {TOLIST} কে এইমাত্র {FORUMNAME}-এ {SENDER} দ্বারা একটি ব্যক্তিগত বার্তা পাঠানো হয়েছে৷

 গুরুত্বপূর্ণ: মনে রাখবেন, এটি শুধুমাত্র একটি বিজ্ঞপ্তি।  দয়া করে এই ইমেলের উত্তর দেবেন না।

 এই ব্যক্তিগত বার্তাটি এখানে পড়ুন: {READLINK}

 এই ব্যক্তিগত বার্তার উত্তর দিন (শুধুমাত্র প্রেরকের জন্য) এখানে: {REPLYLINK}

 {সম্পূর্ণ}';

 /**
 	 @অতিরিক্ত_পরম: new_pm_body_tolist
 		 বিষয়: ব্যক্তিগত বার্তা বিষয়.
 		 SENDER: ব্যক্তিগত বার্তা প্রেরণকারী সদস্যের ব্যবহারকারীর নাম।
 		 বার্তা: ব্যক্তিগত বার্তার পাঠ্য।
 		 REPLYLINK: সরাসরি উত্তর পৃষ্ঠা অ্যাক্সেস করার লিঙ্ক।
 		 TOLIST: ব্যবহারকারীদের তালিকা যারা ব্যক্তিগত বার্তা পাবেন।
 	 @description: একটি ব্যক্তিগত বার্তা গ্রহণকারীদের কাছে পাঠানো একটি বিজ্ঞপ্তি ইমেল
 */
 $txt['new_pm_body_tolist_subject'] = 'নতুন ব্যক্তিগত বার্তা: {SUBJECT}';
 $txt['new_pm_body_tolist_body'] = 'আপনি এবং {TOLIST} কে এইমাত্র {FORUMNAME}-এ {SENDER} দ্বারা একটি ব্যক্তিগত বার্তা পাঠানো হয়েছে৷

 গুরুত্বপূর্ণ: মনে রাখবেন, এটি শুধুমাত্র একটি বিজ্ঞপ্তি।  দয়া করে এই ইমেলের উত্তর দেবেন না।

 তারা আপনাকে যে বার্তাটি পাঠিয়েছে তা হল:

 {মেসেজ}

 এই ব্যক্তিগত বার্তার উত্তর দিন (শুধুমাত্র প্রেরকের জন্য) এখানে: {REPLYLINK}

 {সম্পূর্ণ}';

 /**
 	 @additional_params: msg_quote
 		 বিষয়বস্তু: পোস্ট বিষয়.
 		 উদ্ধৃতি নাম: উদ্ধৃতি তৈরি করা সদস্যের ব্যবহারকারীর নাম
 		 সদস্য নাম: উদ্ধৃত করা সদস্যের ব্যবহারকারীর নাম
 		 কন্টেন্টলিঙ্ক: পোস্টের লিঙ্ক
 	 @description: একটি পোস্টে উদ্ধৃত করা সদস্যদের কাছে পাঠানো একটি বিজ্ঞপ্তি ইমেল
  */
 $txt['msg_quote_subject'] = 'আপনাকে পোস্টে উদ্ধৃত করা হয়েছে: {CONTENTSUBJECT}';
 $txt['msg_quote_body'] = 'হ্যালো {MEMBERNAME},

 আপনাকে {QUOTENAME} এর "{CONTENTSUBJECT}" শিরোনামের পোস্টে উদ্ধৃত করা হয়েছে, আপনি এখানে পোস্টটি দেখতে পারেন:
 {CONTENTLINK}

 {সম্পূর্ণ}';

 /**
 	 @additional_params: msg_mention
 		 বিষয়বস্তু: পোস্ট বিষয়.
 		 উল্লেখ নাম: উল্লেখ তৈরি করা সদস্যের ব্যবহারকারীর নাম
 		 সদস্য নাম: উল্লেখ করা সদস্যের ব্যবহারকারীর নাম
 		 কন্টেন্টলিঙ্ক: পোস্টের লিঙ্ক
 	 @description: একটি পোস্টে উল্লেখ করা সদস্যদের কাছে পাঠানো একটি বিজ্ঞপ্তি ইমেল
  */
 $txt['msg_mention_subject'] = 'আপনাকে পোস্টে উল্লেখ করা হয়েছে: {CONTENTSUBJECT}';
 $txt['msg_mention_body'] = 'হ্যালো {MEMBERNAME},

 আপনাকে {MENTIONNAME} এর "{CONTENTSUBJECT}" শিরোনামের পোস্টে উল্লেখ করা হয়েছে, আপনি এখানে পোস্টটি দেখতে পারেন:
 {CONTENTLINK}

 {সম্পূর্ণ}';

 /**
 	 @অতিরিক্ত_পরম: শুভ_জন্মদিন
 		 REALNAME: জন্মদিনের বার্তা প্রাপ্ত ব্যক্তির আসল (প্রদর্শন) নাম।
 	 @description: সদস্যদের জন্মদিনে পাঠানো একটি বার্তা।
 */
 $txtBirthdayEmails['happy_birthday_subject'] = '{FORUMNAME} এর পক্ষ থেকে শুভ জন্মদিন।';
 $txtBirthdayEmails['happy_birthday_body'] = 'প্রিয় {REALNAME},

 আমরা এখানে {FORUMNAME} এ আপনাকে জন্মদিনের শুভেচ্ছা জানাতে চাই।  এই দিনটি এবং অনুসরণের বছরটি আনন্দে পূর্ণ হোক।

 {সম্পূর্ণ}';
 $txtBirthdayEmails['happy_birthday_author'] = '<a href="https://www.simplemachines.org/community/?action=profile;u=2676">Thantos</a>';

 $txtBirthdayEmails['karlbenson1_subject'] = 'আপনার জন্মদিনে...';
 $txtBirthdayEmails['karlbenson1_body'] = 'আমরা আপনাকে একটি জন্মদিনের কার্ড পাঠাতে পারতাম।  আমরা আপনাকে কিছু ফুল বা একটি কেক পাঠাতে পারতাম।

 কিন্তু আমরা তা করিনি।

 এমনকি আমরা আপনাকে জন্মদিনের শুভেচ্ছা জানাতে স্বয়ংক্রিয়ভাবে তৈরি হওয়া বার্তাগুলির মধ্যে একটি পাঠাতে পারতাম যেখানে আমাদের এমনকি INSERT NAME প্রতিস্থাপন করতে হবে না।

 কিন্তু আমরা তা করিনি।

 আমরা এই জন্মদিনের শুভেচ্ছা শুধু আপনার জন্য লিখেছি।

 আমরা আপনাকে একটি বিশেষ জন্মদিনের শুভেচ্ছা জানাতে চাই।

 {শুভেচ্ছা}

 //:: এই বার্তাটি স্বয়ংক্রিয়ভাবে তৈরি হয়েছে :://';
 $txtBirthdayEmails['karlbenson1_author'] = '<a href="https://www.simplemachines.org/community/?action=profile;u=63186">karlbenson</a>';

 $txtBirthdayEmails['nite0859_subject'] = 'শুভ জন্মদিন!';
 $txtBirthdayEmails['nite0859_body'] = 'আপনার {FORUMNAME} এর বন্ধুরা আপনাকে জন্মদিনের শুভেচ্ছা জানাতে আপনার কিছু মুহূর্ত নিতে চায়, {REALNAME}।  আপনি যদি সম্প্রতি তা না করে থাকেন, তাহলে অনুগ্রহ করে আমাদের সম্প্রদায়ে যান যাতে অন্যরা তাদের উষ্ণ অভিনন্দন জানার সুযোগ পায়।

 যদিও আজ আপনার জন্মদিন, {REALNAME}, আমরা আপনাকে মনে করিয়ে দিতে চাই যে আমাদের সম্প্রদায়ে আপনার সদস্যতা এখন পর্যন্ত আমাদের জন্য সেরা উপহার।

 শুভকামনা,
 {FORUMNAME}'-এর কর্মীরা;
 $txtBirthdayEmails['nite0859_author'] = '<a href="https://www.simplemachines.org/community/?action=profile;u=46625">nite0859</a>';

 $txtBirthdayEmails['zwaldowski_subject'] = '{REALNAME} কে জন্মদিনের শুভেচ্ছা';
 $txtBirthdayEmails['zwaldowski_body'] = 'প্রিয় {REALNAME},

 আপনার জীবনের আরও একটি বছর কেটে গেছে।  আমরা {FORUMNAME}-এ আশা করি এটি আনন্দে পূর্ণ হয়েছে, এবং আগামীতে আপনার সৌভাগ্য কামনা করছি।

 {সম্পূর্ণ}';
 $txtBirthdayEmails['zwaldowski_author'] = '<a href="https://www.simplemachines.org/community/?action=profile;u=72038">zwaldowski</a>';

 $txtBirthdayEmails['geezmo_subject'] = 'শুভ জন্মদিন, {REALNAME}!';
 $txtBirthdayEmails['geezmo_body'] = 'আপনি কি জানেন আজ কার জন্মদিন, {REALNAME}?

 আমরা জানি... আপনি!

 শুভ জন্মদিন!

 আপনি এখন এক বছরের বড় কিন্তু আমরা আশা করি আপনি গত বছরের তুলনায় অনেক বেশি সুখী।

 আপনার আজকের দিনটি উপভোগ করুন, {REALNAME}!

 - আপনার {FORUMNAME} পরিবার থেকে';
 $txtBirthdayEmails['geezmo_author'] = '<a href="https://www.simplemachines.org/community/?action=profile;u=48671">geezmo</a>';

 $txtBirthdayEmails['karlbenson2_subject'] = 'আপনার জন্মদিনের শুভেচ্ছা';
 $txtBirthdayEmails['karlbenson2_body'] = 'আমরা আশা করি আপনার জন্মদিনটি সর্বকালের সেরা;  মেঘলা, রোদ বা যাই হোক না কেন আবহাওয়া।
 অনেক জন্মদিনের কেক এবং মজা করুন, এবং আপনি কি করেছেন তা আমাদের বলুন।

 আমরা আশা করি এই বার্তাটি আপনাকে উত্সাহিত করেছে, এবং এটিকে স্থায়ী করবে, একই সময়ে, পরের বছর পর্যন্ত।

 {সম্পূর্ণ}';
 $txtBirthdayEmails['karlbenson2_author'] = '<a href="https://www.simplemachines.org/community/?action=profile;u=63186">karlbenson</a>';

 ?>