<?php
 // সংস্করণ: 2.1.3;  সাহায্য

 বিশ্বব্যাপী $helptxt, $scripturl;

 $txt['close_window'] = 'জানালা বন্ধ করুন';

 $helptxt['manage_boards'] = '
 	 <strong>বোর্ড সম্পাদনা করুন</strong><br>
 	 এই পৃষ্ঠায় আপনি বোর্ড এবং বিভাগগুলি তৈরি/পুনঃক্রম/সরাতে পারেন
 	 তাদের উপরে।  উদাহরণস্বরূপ, যদি আপনি একটি বিস্তৃত ছিল
 	 যে সাইট &quot;ক্রীড়া&quot;  এবং &quot;গাড়ি&quot;  এবং &quot;সঙ্গীত&quot;, এগুলো
 	 আপনি তৈরি করবেন শীর্ষ-স্তরের বিভাগগুলি।  এই প্রতিটি অধীনে
 	 আপনি সম্ভবত &quot;বোর্ড&quot; তৈরি করতে চান এমন বিভাগ  প্রতিটি বিষয়ের জন্য।  এই কাঠামোর সাথে এটি একটি সাধারণ শ্রেণিবিন্যাস: <br>
 	 <ul class="normallist">
 		 <li>
 			 <strong>খেলাধুলা</strong>
 			 &nbsp;- A &quot;শ্রেণি&quot;
 			 <ul class="normallist">
 				 <li>
 					 <strong>বেসবল</strong>
 					 &nbsp;- &quot;ক্রীড়া&quot; বিভাগের অধীনে একটি বোর্ড
 					 <ul class="normallist">
 						 <li>
 							 <strong>পরিসংখ্যান</strong>
 							 &nbsp;- &quot;বেসবল&quot; বোর্ডের অধীনে একটি সাব-বোর্ড
 						 </li>
 					 </ul>
 				 </li>
 				 <li><strong>ফুটবল</strong>
 				 &nbsp;- &quot;স্পোর্টস&quot;</li> বিভাগের অধীনে একটি বোর্ড
 			 </ul>
 		 </li>
 	 </ul>
 	 বিভাগগুলি আপনাকে বোর্ডগুলিকে বিস্তৃত বিষয়গুলিতে বিভক্ত করার অনুমতি দেয় (&quot;কার,
 	 খেলাধুলা&quot;), এবং &quot;বোর্ড&quot;  তাদের অধীনে ব্যবহারকারীদের প্রকৃত বিষয় পোস্ট করার অনুমতি দেয়.
 	 পিন্টোসে আগ্রহী একজন ব্যবহারকারী &quot;কারস->পিন্টো&quot; এর অধীনে একটি বার্তা পোস্ট করবেন।
 	 এই পৃষ্ঠার প্রশাসনিক কাজ হল নতুন বোর্ড তৈরি করা
 	 প্রতিটি বিভাগের অধীনে, সেগুলিকে পুনরায় সাজাতে (নিচে &quot;চেভি&quot; &quot;পিন্টো&quot; রাখুন), অথবা
 	 বোর্ড সম্পূর্ণ মুছে ফেলার জন্য।';

 $helptxt['edit_news'] = '
 	 <ul class="normallist">
 		 <li>
 			 <strong>সংবাদ</strong><br>
 			 এই পৃষ্ঠাটি আপনাকে বোর্ড সূচক পৃষ্ঠায় প্রদর্শিত সংবাদ আইটেমগুলির জন্য পাঠ্য সেট করার অনুমতি দেয়।
 			 আপনি যে কোনো আইটেম যোগ করুন (যেমন, &quot;এই মঙ্গলবার সম্মেলন মিস করবেন না&quot;)।  প্রতিটি সংবাদ আইটেম এলোমেলোভাবে প্রদর্শিত হয় এবং একটি পৃথক বাক্সে স্থাপন করা উচিত।
 		 </li>
 		 <li>
 			 <strong>নিউজলেটার</strong><br>
 			 এই পৃষ্ঠাটি আপনাকে ব্যক্তিগত বার্তা বা ইমেলের মাধ্যমে ফোরামের সদস্যদের কাছে নিউজলেটার পাঠাতে দেয়।  প্রথমে আপনি যে গ্রুপগুলি নিউজলেটার পেতে চান এবং যেগুলিকে আপনি নিউজলেটার পেতে চান না সেগুলি নির্বাচন করুন৷  আপনি যদি চান, আপনি নিউজলেটার পাবেন যে অতিরিক্ত সদস্য এবং ইমেল ঠিকানা যোগ করতে পারেন.  অবশেষে, আপনি যে বার্তাটি পাঠাতে চান সেটি ইনপুট করুন এবং আপনি সদস্যদের ব্যক্তিগত বার্তা বা একটি ইমেল হিসাবে পাঠাতে চান কিনা তা নির্বাচন করুন।
 		 </li>
 		 <li>
 			 <strong>সেটিংস</strong><br>৷
 				 এই পৃষ্ঠাটিতে কয়েকটি সেটিংস রয়েছে যা সংবাদ এবং নিউজলেটারগুলির সাথে সম্পর্কিত, যার মধ্যে কোন গ্রুপ ফোরামের সংবাদ সম্পাদনা করতে পারে বা নিউজলেটার পাঠাতে পারে তা নির্বাচন করে৷  আপনি ফোরামে নিউজ ফিডগুলি সক্ষম করতে চান কিনা তা কনফিগার করার জন্য একটি সেটিংও রয়েছে, পাশাপাশি ফিডে প্রদর্শিত প্রতিটি নতুন পোস্টের জন্য দৈর্ঘ্য (কতটি অক্ষর প্রদর্শিত হবে) কনফিগার করার একটি সেটিং রয়েছে৷
 		 </li>
 	 </ul>';

$helptxt['view_members'] = '
 	 <ul class="normallist">
 		 <li>
 			 <strong>সকল সদস্যকে দেখুন</strong><br>
 			 ফোরামের সকল সদস্যদের দেখুন।  আপনাকে সদস্যদের নামের একটি হাইপারলিঙ্ক করা তালিকা উপস্থাপন করা হয়েছে।  আপনি ক্লিক করতে পারেন
 			 সদস্যদের বিশদ বিবরণ (হোমপেজ, বয়স, ইত্যাদি) এবং প্রশাসক হিসাবে খুঁজে পেতে যেকোনো নামের উপর
 			 আপনি এই পরামিতিগুলি সংশোধন করতে সক্ষম।  সদস্যদের উপর আপনার সম্পূর্ণ নিয়ন্ত্রণ রয়েছে, সহ
 			 ফোরাম থেকে তাদের মুছে ফেলার ক্ষমতা।<br><br>
 		 </li>
 		 <li>
 			 <strong>অনুমোদনের অপেক্ষায়</strong><br>
 			 আপনি সমস্ত নতুন নিবন্ধনের প্রশাসক অনুমোদন সক্ষম করলেই এই পৃষ্ঠাটি দেখানো হবে৷  যে কেউ আপনার যোগদানের জন্য নিবন্ধন
 			 ফোরাম শুধুমাত্র একজন প্রশাসক দ্বারা অনুমোদিত হলেই পূর্ণ সদস্য হবে।  পৃষ্ঠায় সেই সমস্ত সদস্যদের তালিকা রয়েছে যারা
 			 তাদের ইমেল এবং আইপি ঠিকানা সহ এখনও অনুমোদনের অপেক্ষায় রয়েছে৷  আপনি গ্রহণ বা প্রত্যাখ্যান (মুছুন) বেছে নিতে পারেন
 			 সদস্যের পাশের বাক্সটি চেক করে এবং নীচের ড্রপ-ডাউন বক্স থেকে অ্যাকশন বেছে নিয়ে তালিকায় থাকা যেকোনো সদস্যকে
 			 পৃষ্ঠার  কোনো সদস্যকে প্রত্যাখ্যান করার সময় আপনি সদস্যকে আপনার সিদ্ধান্তের বিষয়ে অবহিত না করে বা না করেই মুছে ফেলার সিদ্ধান্ত নিতে পারেন।<br><br>
 		 </li>
 		 <li>
 			 <strong>অ্যাক্টিভেশনের অপেক্ষায়</strong><br>
 			 এই পৃষ্ঠাটি কেবল তখনই দৃশ্যমান হবে যদি আপনি ফোরামে নতুন সদস্য অ্যাকাউন্টগুলির ইমেল সক্রিয়করণ সক্ষম করেন।  এই পৃষ্ঠায় সব তালিকা করা হবে
 			 সদস্য যারা এখনও তাদের নতুন অ্যাকাউন্ট সক্রিয় করেনি।  এই পৃষ্ঠা থেকে আপনি গ্রহণ, প্রত্যাখ্যান বা স্মরণ করিয়ে দিতে বেছে নিতে পারেন
 			 অসামান্য নিবন্ধন সহ সদস্য.  উপরের হিসাবে আপনি সদস্যকে তাদের অবহিত করার জন্য ইমেল করতেও বেছে নিতে পারেন
 			 আপনি যে পদক্ষেপ নিয়েছেন।<br><br>
 		 </li>
 	 </ul>';

$helptxt['ban_members'] = '<strong>সদস্যদের নিষিদ্ধ করুন</strong><br>
 	 SMF "নিষিদ্ধ" করার ক্ষমতা প্রদান করে  ব্যবহারকারী, যা ব্যবহারকারীদের বিরুদ্ধে একটি কার্যকর পদক্ষেপ হতে পারে
 	 স্প্যামিং বা ট্রোলিং ইত্যাদির মাধ্যমে ফোরামের বিশ্বাস লঙ্ঘন করেছে৷ এটি আপনাকে ক্ষতিকারক ব্যবহারকারীদের বাদ দিতে দেয়৷
 	 আপনার ফোরামে।  একজন প্রশাসক হিসাবে, আপনি যখন আপনার ফোরামে করা পোস্টগুলি দেখেন, আপনি পোস্ট করার সময় ব্যবহারকারীর আইপি ঠিকানাটি দেখতে পারেন।
 	 নিষেধাজ্ঞার তালিকায়, আপনি কেবল সেই আইপি ঠিকানাটি টাইপ করুন, সংরক্ষণ করুন এবং তারা সেই অবস্থান থেকে আর পোস্ট করতে পারবে না।<br>আপনিও করতে পারেন।
 	 লোকেদের তাদের ইমেল ঠিকানার মাধ্যমে নিষিদ্ধ করুন।';

 $helptxt['featuresettings'] = '<strong>বৈশিষ্ট্য এবং বিকল্প</strong><br>
 	 এই পৃষ্ঠায় বেশ কিছু বৈশিষ্ট্য রয়েছে যা আপনার পছন্দ অনুযায়ী পরিবর্তন করা যেতে পারে।';

 $helptxt['modsettings'] = '<strong>পরিবর্তন সেটিংস</strong><br>
 	 এই পৃষ্ঠায় আপনার ফোরামে ইনস্টল করা পরিবর্তন দ্বারা যোগ করা যেকোনো সেটিংস রয়েছে।';

 $helptxt['time_format'] = '<strong>সময় বিন্যাস</strong><br>
 	 আপনার নিজের জন্য সময় এবং তারিখ কীভাবে দেখায় তা সামঞ্জস্য করার ক্ষমতা আপনার আছে।  অনেক ছোট অক্ষর আছে, কিন্তু এটা বেশ সহজ।
 	 কনভেনশনগুলি PHP এর strftime ফাংশন অনুসরণ করে এবং নীচে বর্ণনা করা হয়েছে (আরও বিশদ <a href="https://php.net/manual/function.strftime.php" target="_blank" rel="-এ পাওয়া যাবে  noopener">php.net</a>).<br>
 	 <br>
 	 নিম্নলিখিত অক্ষর বিন্যাস স্ট্রিং স্বীকৃত হয়: <br>
 	 <span class="smalltext">
 	 &nbsp;&nbsp;%a - সংক্ষিপ্ত সাপ্তাহিক দিনের নাম<br>
 	 &nbsp;&nbsp;%A - পুরো সপ্তাহের দিন নাম<br>
 	 &nbsp;&nbsp;%b - সংক্ষিপ্ত মাসের নাম<br>
 	 &nbsp;&nbsp;%B - পুরো মাসের নাম<br>
 	 &nbsp;&nbsp;%d - মাসের দিন (01 থেকে 31) <br>
 	 &nbsp;&nbsp;%D<strong>*</strong> - %m/%d/%y <br> এর মতো
 	 &nbsp;&nbsp;%e<strong>*</strong> - মাসের দিন (1 থেকে 31) <br>
 	 &nbsp;&nbsp;%H - ঘন্টা 24-ঘন্টা ব্যবহার করে (পরিসীমা 00 থেকে 23) <br>
 	 &nbsp;&nbsp;%I - ঘন্টা একটি 12-ঘন্টা ঘড়ি ব্যবহার করে (পরিসীমা 01 থেকে 12) <br>
 	 &nbsp;&nbsp;%m - একটি সংখ্যা হিসাবে মাস (01 থেকে 12) <br>
 	 &nbsp;&nbsp;%M - একটি সংখ্যা হিসাবে মিনিট <br>
 	 &nbsp;&nbsp;%p - হয় &quot;আমি&quot;  অথবা &quot;pm&quot;  প্রদত্ত সময় অনুযায়ী<br>
 	 &nbsp;&nbsp;%R<strong>*</strong> - 24 ঘন্টা স্বরলিপিতে সময় <br>
 	 &nbsp;&nbsp;%S - দশমিক সংখ্যা হিসাবে সেকেন্ড <br>
 	 &nbsp;&nbsp;%T<strong>*</strong> - বর্তমান সময়, সমান %H:%M:%S <br>
 	 &nbsp;&nbsp;%y - 2 সংখ্যার বছর (00 থেকে 99) <br>
 	 &nbsp;&nbsp;%Y - 4 সংখ্যার বছর<br>
 	 &nbsp;&nbsp;%% - একটি আক্ষরিক \'%\' অক্ষর <br>
 	 <br>
 	 <em>* Windows-ভিত্তিক সার্ভারে কাজ করে না।</em></span>';

$helptxt['live_news'] = '<strong>লাইভ ঘোষণা</strong><br>
 	 এই বক্সটি <a href="https://www.simplemachines.org/" target="_blank" rel="noopener">www.simplemachines.org</a> থেকে সাম্প্রতিক আপডেট করা ঘোষণাগুলি দেখায়৷
 	 সিম্পল মেশিনস থেকে আপডেট, নতুন রিলিজ এবং গুরুত্বপূর্ণ তথ্যের জন্য আপনাকে প্রতিবার এখানে চেক করা উচিত।';

 $helptxt['registrations'] = '<strong>নিবন্ধন ব্যবস্থাপনা</strong><br>
 	 এই পৃষ্ঠায় সমস্ত ফাংশন রয়েছে যা ফোরামে নতুন নিবন্ধন পরিচালনার জন্য প্রয়োজনীয় হতে পারে।  এটি চারটি পর্যন্ত ধারণ করে
 	 আপনার ফোরাম সেটিংসের উপর নির্ভর করে দৃশ্যমান পৃষ্ঠাগুলি।  এগুলো হল:<br><br>
 	 <ul class="normallist">
 		 <li>
 			 <strong>নতুন সদস্য নিবন্ধন করুন</strong><br>
 			 এই পৃষ্ঠা থেকে আপনি তাদের পক্ষ থেকে নতুন সদস্যদের জন্য অ্যাকাউন্ট নিবন্ধন করতে পারেন।  এটি এমন ফোরামগুলিতে কার্যকর হতে পারে যেখানে নিবন্ধন বন্ধ রয়েছে
 			 নতুন সদস্যদের কাছে, অথবা এমন ক্ষেত্রে যেখানে প্রশাসক একটি পরীক্ষা অ্যাকাউন্ট তৈরি করতে চান।  সেটিং করতে হলে অ্যাকাউন্ট সক্রিয় করতে হবে
 			 নির্বাচিত হলে সদস্যকে একটি অ্যাক্টিভেশন লিঙ্ক ইমেল করা হবে যা অ্যাকাউন্ট ব্যবহার করার আগে ক্লিক করতে হবে।  একইভাবে আপনি পারেন
 			 উল্লেখিত ইমেল ঠিকানায় ব্যবহারকারীর নতুন পাসওয়ার্ড ইমেল করতে নির্বাচন করুন।<br><br>
 		 </li>
 		 <li>
 			 <strong>নিবন্ধন চুক্তি সম্পাদনা করুন</strong><br>
 			 এই পৃষ্ঠাটি আপনাকে আপনার ফোরামে সদস্যরা সাইন আপ করার সময় প্রদর্শিত নিবন্ধন চুক্তির জন্য পাঠ্য সেট করতে দেয়।
 			 আপনি ডিফল্ট রেজিস্ট্রেশন চুক্তি থেকে যেকোনো কিছু যোগ করতে বা সরাতে পারেন, যা SMF-এ অন্তর্ভুক্ত।<br><br>
 		 </li>
 		 <li>
 			 <strong>সংরক্ষিত নাম সেট করুন</strong><br>
 			 এই পৃষ্ঠাটি ব্যবহার করে আপনি এমন শব্দ বা নাম নির্দিষ্ট করতে পারেন যা আপনার ব্যবহারকারীরা ব্যবহার নাও করতে পারে৷<br><br>৷
 		 </li>
 		 <li>
 			 <strong>সেটিংস</strong><br>৷
 			 এই পৃষ্ঠাটি কেবল তখনই দৃশ্যমান হবে যদি আপনার কাছে ফোরাম পরিচালনা করার অনুমতি থাকে।  এই পৃষ্ঠা থেকে আপনি নিবন্ধন পদ্ধতি সম্পর্কে সিদ্ধান্ত নিতে পারেন
 			 আপনার ফোরামে ব্যবহার করতে, সেইসাথে অন্যান্য নিবন্ধন সম্পর্কিত সেটিংস।
 		 </li>
 	 </ul>';

 $helptxt['modlog'] = '<strong>মডারেশন লগ</strong><br>
 	 এই পৃষ্ঠাটি মডারেশন টিমের সদস্যদেরকে ফোরামের মডারেটররা সম্পাদিত সমস্ত মডারেশন অ্যাকশন ট্র্যাক করার অনুমতি দেয়৷  উল্লেখ্য যে
 	 অপব্যবহার রোধ করতে লগ সাফ করা লগ করা হবে।';
 $helptxt['adminlog'] = '<strong>প্রশাসন লগ</strong><br>
 	 এই পৃষ্ঠাটি প্রশাসক দলের সদস্যদের ফোরামে ঘটেছে এমন কিছু প্রশাসনিক ক্রিয়াকলাপ ট্র্যাক করার অনুমতি দেয়৷  উল্লেখ্য যে
 	 অপব্যবহার রোধ করতে লগ সাফ করা লগ করা হবে।';
 $helptxt['userlog'] = '<strong>প্রোফাইল সম্পাদনা লগ</strong><br>
 	 এই পৃষ্ঠাটি প্রশাসক দলের সদস্যদের তাদের প্রোফাইলে ব্যবহারকারীদের করা পরিবর্তনগুলি দেখতে দেয় এবং এটি একটি ব্যবহারকারীর প্রোফাইল এলাকা থেকে উপলব্ধ৷';
 $helptxt['warning_enable'] = '<strong>ব্যবহারকারী সতর্কতা সিস্টেম</strong><br>
 	 এই বৈশিষ্ট্যটি প্রশাসক এবং মডারেশন টিমের সদস্যদের সদস্যদের সতর্কতা জারি করতে এবং সদস্যদের সতর্কতা স্তর ব্যবহার করতে সক্ষম করে
 	 ফোরামে তাদের জন্য উপলব্ধ কর্ম.  এই বৈশিষ্ট্য সক্রিয় করার পরে একটি অনুমতি সংজ্ঞায়িত করার অনুমতি পৃষ্ঠার মধ্যে উপলব্ধ হবে
 	 কোন গ্রুপ সদস্যদের সতর্কতা বরাদ্দ করতে পারে.  সতর্কতা মাত্রা একজন সদস্যের প্রোফাইল থেকে সামঞ্জস্য করা যেতে পারে।';
 $helptxt['warning_watch'] = 'এই সেটিংটি নির্ধারণ করে যে শতাংশ সতর্কতা স্তর একজন সদস্যকে স্বয়ংক্রিয়ভাবে একটি &quot;ঘড়ি&quot; বরাদ্দ করতে পৌঁছাতে হবে।  সদস্যের কাছে।  যে কোনো সদস্য যাকে &quot;দেখা হচ্ছে&quot;  মডারেশন সেন্টারে দেখা সদস্যদের তালিকায় উপস্থিত হবে।';
 $helptxt['warning_moderate'] = 'যেকোন সদস্য এই সেটিংটির মান পাস করলে ফোরাম সম্প্রদায়ে উপস্থিত হওয়ার আগে তাদের সমস্ত পোস্ট মডারেটরের অনুমোদনের প্রয়োজন হবে।  এটি পোস্ট মডারেশন সম্পর্কিত যে কোনও স্থানীয় বোর্ডের অনুমতিগুলিকে ওভাররাইড করবে৷';
 $helptxt['warning_mute'] = 'যদি এই সতর্কতা স্তরটি কোনো সদস্যের দ্বারা পাস করা হয় তবে তারা পোস্ট নিষেধাজ্ঞার আওতায় পড়বে।  সদস্য সকল পোস্টিং অধিকার হারাবেন।';
 $helptxt['user_limit'] = 'এই সেটিংটি চব্বিশ ঘণ্টার মধ্যে কোনো নির্দিষ্ট সদস্যকে কোনো মডারেটর যোগ/সরানোর পয়েন্টের পরিমাণ সীমাবদ্ধ করে।  এই
 			 অল্প সময়ের মধ্যে একজন মডারেটর যা করতে পারে তা সীমিত করতে ব্যবহার করা যেতে পারে।  এটিকে শূন্যের মান নির্ধারণ করে নিষ্ক্রিয় করা যেতে পারে।  উল্লেখ্য যে
 			 প্রশাসকের অনুমতি সহ কোনো সদস্য এই মান দ্বারা প্রভাবিত হয় না।';

$helptxt['error_log'] = '<strong>ত্রুটি লগ</strong><br>
 	 ত্রুটি লগ আপনার ফোরামের ব্যবহারকারীদের দ্বারা সম্মুখীন প্রতিটি গুরুতর ত্রুটি ট্র্যাক করে.  এটি তারিখ অনুসারে এই সমস্ত ত্রুটিগুলি তালিকাভুক্ত করে, যা বাছাই করা যেতে পারে
 	 প্রতিটি তারিখের পাশে কালো তীরটিতে ক্লিক করে।  অতিরিক্তভাবে আপনি প্রতিটি ত্রুটি পরিসংখ্যানের পাশের ছবিতে ক্লিক করে ত্রুটিগুলি ফিল্টার করতে পারেন।  এই
 	 আপনাকে ফিল্টার করতে দেয়, উদাহরণস্বরূপ, সদস্য দ্বারা।  যখন একটি ফিল্টার সক্রিয় থাকে তখন শুধুমাত্র সেই ফলাফলগুলি প্রদর্শিত হবে যা সেই ফিল্টারের সাথে মেলে৷';
 $helptxt['theme_settings'] = '<strong>থিম সেটিংস</strong><br>
 	 সেটিংস পৃষ্ঠা আপনাকে একটি থিমের জন্য নির্দিষ্ট সেটিংস পরিবর্তন করতে দেয়।  এই সেটিংস যেমন থিম ডিরেক্টরি এবং URL তথ্য হিসাবে বিকল্প অন্তর্ভুক্ত কিন্তু
 	 এছাড়াও বিকল্পগুলি যা আপনার ফোরামে একটি থিমের বিন্যাসকে প্রভাবিত করে৷  বেশীরভাগ থিমগুলিতে ব্যবহারকারীর কনফিগারযোগ্য বিভিন্ন সেটিংস থাকবে, যা আপনাকে একটি থিম মানিয়ে নিতে দেয়
 	 আপনার ব্যক্তিগত ফোরামের প্রয়োজন অনুসারে।';
 $helptxt['smileys'] = '<strong>স্মাইলি সেন্টার</strong><br>
 	 এখানে আপনি স্মাইলি এবং স্মাইলি সেট যোগ এবং মুছে ফেলতে পারেন।  যদি একটি স্মাইলি একটি সেটে উপস্থিত থাকে তবে এটি সমস্ত সেটে উপস্থিত থাকা উচিত - অন্যথায়, এটি হতে পারে
 	 বিভিন্ন সেট ব্যবহার করে আপনার ব্যবহারকারীদের জন্য বিভ্রান্তিকর হয়ে উঠুন।<br><br>

 	 আপনি এখান থেকে বার্তা আইকন সম্পাদনা করতে সক্ষম হবেন, যদি আপনি সেগুলি সেটিংস পৃষ্ঠায় সক্ষম করে থাকেন।';
 $helptxt['calendar'] = '<strong>ক্যালেন্ডার পরিচালনা করুন</strong><br>
 	 এখানে আপনি বর্তমান ক্যালেন্ডার সেটিংস পরিবর্তন করতে পারেন সেইসাথে ক্যালেন্ডারে প্রদর্শিত ছুটির দিনগুলি যোগ এবং মুছে ফেলতে পারেন৷';
 $helptxt['cal_export'] = 'অন্যান্য ক্যালেন্ডার অ্যাপ্লিকেশনে আমদানি করার জন্য iCal বিন্যাসে একটি টেক্সট ফাইল রপ্তানি করে';
 $helptxt['cal_highlight_events'] = 'এই সেটিং আপনাকে মিনি ক্যালেন্ডার, প্রধান ক্যালেন্ডার, উভয় স্থানে ইভেন্ট হাইলাইট করতে বা ইভেন্ট হাইলাইটিং অক্ষম করতে দেয়।';
 $helptxt['cal_highlight_holidays'] = 'এই সেটিংটি আপনাকে মিনি ক্যালেন্ডার, প্রধান ক্যালেন্ডার, উভয় স্থানে ছুটির দিনগুলি হাইলাইট করতে বা ইভেন্ট হাইলাইটিং অক্ষম করতে দেয়।';
 $helptxt['cal_highlight_birthdays'] = 'এই সেটিংটি আপনাকে মিনি ক্যালেন্ডার, প্রধান ক্যালেন্ডার, উভয় স্থানে জন্মদিন হাইলাইট করতে বা ইভেন্ট হাইলাইটিং অক্ষম করতে দেয়।';
 $helptxt['cal_disable_prev_next'] = 'যদি এই সেটিংটি চেক করা হয়, পৃষ্ঠার বাম দিকের তিন মাসের ব্লকগুলি নিষ্ক্রিয় করা হবে।';
 $helptxt['cal_display_type'] = 'এই সেটিং আপনাকে ক্যালেন্ডারের প্রদর্শনের ধরন পরিবর্তন করতে দেয়।<br><br><strong>আরামদায়ক:</strong> ক্যালেন্ডারের সারিগুলিকে বড় করে তোলে।<br><strong>  >কমপ্যাক্ট:</strong> ক্যালেন্ডারের সারি ছোট করে।';
 $helptxt['cal_week_links'] = 'যদি এই সেটিংটি চেক করা থাকে, ক্যালেন্ডারে প্রতি সপ্তাহের পাশাপাশি লিঙ্ক যোগ করা হবে।';
 $helptxt['cal_prev_next_links'] = 'যদি এই সেটিংটি চেক করা থাকে, সহজে নেভিগেশনের জন্য আগের মাস এবং পরের মাসের লিঙ্কগুলি প্রতি মাসের শীর্ষে যোগ করা হবে।';
 // যুক্তি(গুলি): $txt['months_short'][1], $txt['months_titles'][1]
 $helptxt['cal_short_months'] = 'যদি এই সেটিংটি চেক করা থাকে, ক্যালেন্ডারের মধ্যে মাসের নামগুলি ছোট করা হবে৷<br><br><strong>সক্ষম:</strong> %1$s 1<br><strong>  অক্ষম:</strong> %2$s 1';
 // যুক্তি(গুলি): $txt['days_short'][1], $txt['days'][1]
 $helptxt['cal_short_days'] = 'যদি এই সেটিংটি চেক করা থাকে, ক্যালেন্ডারের মধ্যে দিনের নামগুলি ছোট করা হবে৷<br><br><strong>সক্ষম:</strong> %1$s<br><strong>অক্ষম  :</strong> %2$s';

 $helptxt['serversttings'] = '<strong>সার্ভার সেটিংস</strong><br>
 	 এখানে আপনি আপনার ফোরামের জন্য কিছু মূল কনফিগারেশন করতে পারেন।  এই পৃষ্ঠায় ডাটাবেস এবং URL সেটিংস, সেইসাথে অন্যান্য অন্তর্ভুক্ত রয়েছে৷
 	 গুরুত্বপূর্ণ কনফিগারেশন আইটেম যেমন মেল সেটিংস এবং ক্যাশিং।  যখনই এই সেটিংস সম্পাদনা করার সময় একটি ত্রুটি হতে পারে তখন সাবধানে চিন্তা করুন
 	 ফোরামটি প্রবেশযোগ্য নয়';
 $helptxt['manage_files'] = '
 	 <ul class="normallist">
 		 <li>
 			 <strong>ফাইলগুলি ব্রাউজ করুন</strong><br>৷
 			 SMF দ্বারা সংরক্ষিত সমস্ত সংযুক্তি, অবতার এবং থাম্বনেইলগুলি ব্রাউজ করুন৷<br><br>
 		 </li><li>
 			 <strong>সংযুক্তি সেটিংস</strong><br>৷
 			 সংযুক্তিগুলি কোথায় সংরক্ষণ করা হবে তা কনফিগার করুন এবং সংযুক্তির প্রকারের উপর সীমাবদ্ধতা সেট করুন৷<br><br>৷
 		 </li><li>
 			 <strong>অবতার সেটিংস</strong><br>৷
 			 অবতারগুলি কোথায় সংরক্ষণ করা হয়েছে তা কনফিগার করুন এবং অবতারগুলির আকার পরিবর্তন পরিচালনা করুন৷<br><br>
 		 </li><li>
 			 <strong>ফাইল রক্ষণাবেক্ষণ</strong><br>
 			 অ্যাটাচমেন্ট ডাইরেক্টরিতে যেকোন ত্রুটি চেক করুন এবং মেরামত করুন এবং নির্বাচিত অ্যাটাচমেন্ট মুছে দিন।<br><br>
 		 </li>
 	 </ul>';

 $helptxt['topicSummaryPosts'] = 'এটি আপনাকে উত্তর পৃষ্ঠায় বিষয়ের সারাংশে দেখানো আগের পোস্টের সংখ্যা সেট করতে দেয়।';
 $helptxt['enableAllMessages'] = 'এটিকে <em>সর্বোচ্চ</em> পোস্টের সংখ্যায় সেট করুন একটি বিষয়ের <em>সমস্ত</em> লিঙ্ক দেখানোর জন্য।  এটিকে &quot;বিষয় পৃষ্ঠায় প্রদর্শনের জন্য সর্বাধিক বার্তাগুলির চেয়ে কম সেট করা হচ্ছে&quot;  এর সহজ অর্থ হল এটি কখনই দেখানো হবে না, এবং এটিকে খুব বেশি রাখলে আপনার ফোরাম ধীর হয়ে যেতে পারে।';
 $helptxt['allow_guestAccess'] = 'এই বক্সটি আনচেক করা অতিথিদের আপনার ফোরামে - লগইন, রেজিস্টার, পাসওয়ার্ড রিমাইন্ডার ইত্যাদি - আপনার ফোরামে খুব প্রাথমিক অ্যাকশন ছাড়া আর কিছু করা বন্ধ করবে।  এটি বোর্ডে অতিথিদের প্রবেশাধিকার নিষিদ্ধ করার মতো নয়।';
 $helptxt['userLanguage'] = 'এই সেটিংটি চালু করলে ব্যবহারকারীরা কোন ভাষা ফাইল ব্যবহার করেন তা নির্বাচন করতে পারবেন।  এটা প্রভাবিত করবে না
 		 ডিফল্ট নির্বাচন।';
 $helptxt['trackStats'] = 'পরিসংখ্যান:<br>এটি ব্যবহারকারীদের আপনার ফোরামে সর্বশেষ পোস্ট এবং সর্বাধিক জনপ্রিয় বিষয়গুলি দেখতে অনুমতি দেবে৷
 		 এটি বেশ কয়েকটি পরিসংখ্যানও দেখাবে, যেমন অনলাইনে সর্বাধিক সদস্য, নতুন সদস্য এবং নতুন বিষয়৷<hr>
 		 পৃষ্ঠা দর্শন:<br>আপনার ফোরামে পৃষ্ঠা দর্শনের সংখ্যা সহ পরিসংখ্যান পৃষ্ঠায় আরেকটি কলাম যোগ করে।';
 $helptxt['titlesEnable'] = 'কাস্টম টাইটেল চালু করলে প্রাসঙ্গিক অনুমতি থাকা সদস্যরা নিজেদের জন্য একটি বিশেষ শিরোনাম তৈরি করতে পারবেন।
 		 এটি নামের নিচে দেখানো হবে।<br><em>উদাহরণস্বরূপ:</em><br>জেফ<br>কুল গাই';
 $helptxt['onlineEnable'] = 'এটি সদস্য অনলাইন নাকি অফলাইন তা নির্দেশ করার জন্য একটি ছবি দেখাবে';
 $helptxt['todayMod'] = 'এটি দেখাবে &quot;আজ&quot;  অথবা &quot;গতকাল&quot;  তারিখের পরিবর্তে।<br><br>
 		 <strong>উদাহরণ:</strong><br><br>
 		 <ul class="normallist">
 			 <li>
 			 <strong>অক্ষম</strong><br>৷
 			 অক্টোবর 3, 2009 12:59:18 am</li>৷
 			 <li><strong>শুধুমাত্র আজ</strong><br>
 			 আজ 12:59:18 am</li>
 			 <li><strong>আজ &amp;  গতকাল</strong><br>
 			 গতকাল 09:36:55 pm</li>
 		 </ul>';
 $helptxt['disableCustomPerPage'] = 'ব্যবহারকারীদের যথাক্রমে মেসেজ ইনডেক্স এবং টপিক ডিসপ্লে পৃষ্ঠায় প্রতি পৃষ্ঠায় প্রদর্শিত বার্তা এবং বিষয়গুলির পরিমাণ কাস্টমাইজ করা থেকে বিরত রাখতে এই সেটিংটি পরীক্ষা করুন।';
 $helptxt['enablePreviousNext'] = 'এটি পরবর্তী এবং আগের বিষয়ের একটি লিঙ্ক দেখাবে।';
 $helptxt['pollMode'] = 'এটি নির্বাচন করে যে পোল সক্রিয় করা হয়েছে কি না।  পোল অক্ষম করা হলে, বিদ্যমান যেকোন পোল লুকিয়ে রাখা হবে
 		 বিষয় তালিকা থেকে.  আপনি নির্বাচন করে তাদের পোল ছাড়াই নিয়মিত বিষয় দেখানো চালিয়ে যেতে পারেন
 		 &quot;বিদ্যমান পোলগুলিকে বিষয় হিসাবে দেখান৷<br><br>কে পোল পোস্ট করতে পারে, পোল দেখতে এবং অনুরূপ করতে পারে তা চয়ন করতে, আপনি
 		 অনুমতি দিতে পারে এবং সেই অনুমতিগুলি অস্বীকার করতে পারে।  ভোট যদি কাজ না করে তাহলে এটা মনে রাখবেন।';
 $helptxt['enableCompressedOutput'] = 'এই সেটিংটি ব্যান্ডউইথের খরচ কমানোর জন্য আউটপুটকে সংকুচিত করবে, তবে এটির প্রয়োজন
 		 zlib ইনস্টল করা হবে।';
$helptxt['httponlyCookies'] = 'কুকিজ স্ক্রিপ্টিং ভাষা, যেমন জাভাস্ক্রিপ্ট দ্বারা অ্যাক্সেসযোগ্য হবে না।  এই সেটিং XSS আক্রমণের মাধ্যমে পরিচয় চুরি কমাতে সাহায্য করতে পারে।  এটি তৃতীয় পক্ষের স্ক্রিপ্টগুলির সাথে সমস্যা সৃষ্টি করতে পারে তবে যেখানেই সম্ভব সেখানে থাকা উচিত।';
 $helptxt['samesiteCookies'] = 'সেট-কুকি HTTP প্রতিক্রিয়া শিরোনামের একইসাইট বৈশিষ্ট্য আপনাকে ঘোষণা করতে দেয় যে আপনার কুকি একটি প্রথম-পক্ষ বা একই-সাইট প্রসঙ্গে সীমাবদ্ধ করা উচিত কিনা।  আরও তথ্যের জন্য, অনুগ্রহ করে <a href="https://developer.mozilla.org/docs/Web/HTTP/Headers/Set-Cookie/SameSite">MDN</a>' দেখুন;
 $helptxt['databaseSession_enable'] = 'এই সেটিংটি সেশন স্টোরেজের জন্য ডাটাবেস ব্যবহার করে - এটি ভারসাম্যপূর্ণ সার্ভার লোড করার জন্য সর্বোত্তম, তবে সমস্ত টাইমআউট সমস্যার সাথে সাহায্য করে এবং ফোরামটিকে দ্রুততর করতে পারে।';
 $helptxt['databaseSession_loose'] = 'এটি চালু করলে আপনার ফোরামের ব্যান্ডউইথ কমে যাবে এবং আবার ক্লিক করলে পৃষ্ঠাটি পুনরায় লোড হবে না - নেতিবাচক দিক হল (নতুন) আইকনগুলি অন্যান্য জিনিসের মধ্যে আপডেট হবে না  .  (যদি না আপনি সেই পৃষ্ঠায় ফিরে যাওয়ার পরিবর্তে ক্লিক করুন)।';
 $helptxt['databaseSession_lifetime'] = 'এটি সেশনের সেকেন্ডের সংখ্যা যা সেগুলি অ্যাক্সেস না করার পরে স্থায়ী হয়৷  যদি একটি অধিবেশন খুব বেশি সময় ধরে অ্যাক্সেস না করা হয়, তবে এটিকে "টাইম আউট" বলা হয়।  2400-এর চেয়ে বেশি কিছু বাঞ্ছনীয়।';
 $helptxt['tfa_mode'] = 'আপনি <a href="https://en.wikipedia.org/wiki/Two_factor_authentication">টু ফ্যাক্টর প্রমাণীকরণ</a> সক্ষম করে আপনার ফোরামে নিরাপত্তার দ্বিতীয় স্তর যোগ করতে পারেন৷  2FA আপনার ব্যবহারকারীদের নিয়মিত লগইন করার পরে একটি মেশিন-জেনারেটেড কোড যোগ করতে বাধ্য করে।  আপনি অন্য ব্যবহারকারীদের কাছে জোর করতে সক্ষম হওয়ার আগে আপনাকে 2FA কনফিগার করতে হবে!';
 $helptxt['cache_enable'] = 'SMF বিভিন্ন স্তরে ক্যাশিং সঞ্চালন করে।  ক্যাশিং এর স্তর যত বেশি সক্ষম হবে তত বেশি CPU সময় ক্যাশে করা তথ্য পুনরুদ্ধার করতে ব্যয় হবে।  যদি আপনার মেশিনে ক্যাশিং উপলব্ধ থাকে তবে প্রথমে লেভেল 1 এ ক্যাশে করার চেষ্টা করার পরামর্শ দেওয়া হয়।';
 $helptxt['cache_memcached'] = 'আপনি যদি মেমক্যাচেড ব্যবহার করেন তাহলে আপনাকে সার্ভারের বিশদ বিবরণ দিতে হবে।  নীচের উদাহরণে দেখানো হিসাবে এটি একটি কমা বিভক্ত তালিকা হিসাবে প্রবেশ করা উচিত:<br><br> &quot;server1,server2,server3:port,server4&quot;<br><br>উল্লেখ্য যে যদি কোনো পোর্ট নির্দিষ্ট করা না থাকে তাহলে SMF ব্যবহার করবে  পোর্ট 11211 যদি হোস্টে একটি স্ল্যাশ না থাকে, তাহলে এটি একটি বিকল্প পরিবহন বলে ধরে নেওয়া হয় এবং পোর্টটি 0 এ সেট করা হবে। SMF নির্দিষ্ট সার্ভার জুড়ে রুক্ষ/এলোমেলো লোড ব্যালেন্স করার চেষ্টা করবে।';
 $helptxt['cache_cachedir'] = 'এই সেটিংটি শুধুমাত্র smf ফাইল-ভিত্তিক ক্যাশে সিস্টেমের জন্য।  এটি ক্যাশে ডিরেক্টরির পথ নির্দিষ্ট করে।  এটা বাঞ্ছনীয় যে আপনি এটিকে /tmp/ এ রাখুন যদি আপনি এটি ব্যবহার করতে যাচ্ছেন, যদিও এটি যেকোনো ডিরেক্টরিতে কাজ করবে';
 $helptxt['cache_sqlite_cachedir'] = 'এই সেটিংটি শুধুমাত্র SQLite ডাটাবেস ক্যাশে সিস্টেমের জন্য।  এটি ক্যাশে ডিরেক্টরির পথ নির্দিষ্ট করে।  এটা বাঞ্ছনীয় যে আপনি এটিকে /tmp/ এ রাখুন যদি আপনি এটি ব্যবহার করতে যাচ্ছেন, যদিও এটি যেকোনো ডিরেক্টরিতে কাজ করবে';
 $helptxt['enableErrorLogging'] = 'এটি ব্যর্থ লগইনের মতো যেকোনো ত্রুটি লগ করবে, যাতে আপনি দেখতে পারেন কী ভুল হয়েছে।';
 $helptxt['enableErrorQueryLogging'] = 'এটি ত্রুটির লগে ডাটাবেসে পাঠানো সম্পূর্ণ কোয়েরি অন্তর্ভুক্ত করবে।  এটির জন্য ত্রুটি লগিং চালু করা প্রয়োজন৷<br><br><strong>দ্রষ্টব্য: এটি ত্রুটি বার্তা দ্বারা ত্রুটি লগ ফিল্টার করার ক্ষমতাকে প্রভাবিত করবে৷</strong>';
 $helptxt['disallow_sendBody'] = 'এই সেটিংটি বিজ্ঞপ্তি ইমেলে উত্তর, পোস্ট এবং ব্যক্তিগত বার্তার পাঠ্য পাওয়ার বিকল্পটি সরিয়ে দেয়।<br><br>প্রায়শই, সদস্যরা বিজ্ঞপ্তি ইমেলের উত্তর দেয়, যা বেশিরভাগ ক্ষেত্রেই  মানে ওয়েবমাস্টার উত্তর পায়।';
 $helptxt['enable_ajax_alerts'] = 'এই বিকল্পটি আপনার সদস্যদের AJAX বিজ্ঞপ্তি পেতে অনুমতি দেয়।  এর অর্থ হল নতুন বিজ্ঞপ্তি পেতে সদস্যদের পৃষ্ঠাটি রিফ্রেশ করার প্রয়োজন নেই৷<br><strong>মনে রাখবেন:</strong> এই বিকল্পটি অনলাইনে অনেক ব্যবহারকারীর সাথে আপনার সার্ভারে একটি গুরুতর লোড হতে পারে৷';
 $helptxt['alerts_auto_purge'] = 'একবার একটি সতর্কতা পড়া হয়ে গেলে, এটি খুব কমই প্রয়োজন হয়।  কর্মক্ষমতার কারণে, কিছুক্ষণ পরে স্বয়ংক্রিয়ভাবে সেগুলি মুছে ফেলা একটি ভাল ধারণা৷';
 $helptxt['jquery_source'] = 'এটি jQuery লাইব্রেরি লোড করতে ব্যবহৃত উৎস নির্ধারণ করবে।  <em>Google CDN, jQuery CDN</em> এবং <em>Microsoft CDN</em> সংশ্লিষ্ট CDN নেটওয়ার্ক থেকে jQuery লাইব্রেরি লোড করবে।  <em>স্থানীয়</em> শুধুমাত্র স্থানীয় উৎস ব্যবহার করবে।  <em>কাস্টম</em> আপনাকে লাইব্রেরির জন্য একটি কাস্টম URL নির্দিষ্ট করতে দেয়।';
 $helptxt['compactTopicPagesEnable'] = 'এটি শুধুমাত্র পৃষ্ঠার সংখ্যার একটি নির্বাচন দেখাবে।<br><em>উদাহরণ:</em>
 		 &quot;3&quot;  প্রদর্শনের জন্য: 1 ... 4 [5] 6 ... 9 <br>
 		 &quot;5&quot;  প্রদর্শনের জন্য: 1 ... 3 4 [5] 6 7 ... 9';
 $helptxt['timeLoadPageEnable'] = 'এটি বোর্ডের নীচে পৃষ্ঠাটি তৈরি করতে SMF কত সেকেন্ডে সময় নিয়েছে তা দেখাবে।';
 $helptxt['removeNestedQuotes'] = 'কোট লিঙ্কের মাধ্যমে প্রশ্নে থাকা পোস্টটি উদ্ধৃত করার সময় এটি একটি পোস্ট থেকে নেস্টেড উদ্ধৃতিগুলি সরিয়ে ফেলবে।';
 $helptxt['max_image_width'] = 'এটি আপনাকে পোস্ট করা ছবির জন্য সর্বোচ্চ আকার নির্ধারণ করতে দেয়।  সর্বোচ্চ থেকে ছোট ছবি প্রভাবিত হবে না.  থাম্বনেইলে ক্লিক করার সময় সংযুক্ত ছবিগুলি কীভাবে প্রদর্শিত হবে তাও এটি নির্ধারণ করে।';
 $helptxt['mail_type'] = 'এই সেটিংটি আপনাকে হয় PHP এর ডিফল্ট সেটিংস বেছে নিতে বা SMTP দিয়ে সেই সেটিংস ওভাররাইড করতে দেয়।  PHP SMTP এর সাথে প্রমাণীকরণ ব্যবহার সমর্থন করে না (যা এখন অনেক হোস্টের প্রয়োজন), তাই আপনি যদি চান যে আপনার SMTP নির্বাচন করা উচিত।  দয়া করে মনে রাখবেন যে SMTP ধীর হতে পারে, এবং কিছু সার্ভার ব্যবহারকারীর নাম এবং পাসওয়ার্ড গ্রহণ করবে না৷<br><br>আপনাকে SMTP সেটিংস পূরণ করতে হবে না যদি এটি PHP এর ডিফল্টে সেট করা থাকে৷';
 $helptxt['attachment_manager_settings'] = 'সংযুক্তি হল এমন ফাইল যা সদস্যরা পোস্টে আপলোড এবং সংযুক্ত করতে পারে।  বিভিন্ন সাইট বিভিন্ন উপায়ে এগুলি ব্যবহার করতে পারে, যা আপনি এখানে কনফিগার করতে পারেন।';
 $helptxt['attachmentCheckExtensions'] = 'কিছু সম্প্রদায়ের জন্য, আপনি এক্সটেনশন চেক করে ব্যবহারকারীরা আপলোড করতে পারেন এমন ফাইলের ধরন সীমিত করতে চাইতে পারেন: যেমন  myphoto.jpg-এ jpg এর একটি এক্সটেনশন রয়েছে।';
 // রেফারেন্স সেটিং অ্যাটাচমেন্ট চেক এক্সটেনশন
 $helptxt['attachmentExtensions'] = 'উপরে "অ্যাটাচমেন্টের এক্সটেনশন চেক করুন" সক্ষম করা থাকলে, এই এক্সটেনশনগুলি নতুন সংযুক্তির জন্য অনুমোদিত হবে।';
 $helptxt['attachmentUploadDir'] = 'সার্ভারে আপনার সংযুক্তি ফোল্ডারের পথ<br>(উদাহরণ: /home/sites/yoursite/www/forum/attachments)';
 $helptxt['attachmentDirSizeLimit'] = 'সংযুক্তি ফোল্ডারটি কত বড় হতে পারে তা নির্বাচন করুন, এর মধ্যে থাকা সমস্ত ফাইল সহ।';
 $helptxt['attachmentPostLimit'] = 'প্রতি পোস্টে করা সমস্ত সংযুক্তির সর্বোচ্চ ফাইলের আকার (কেবিতে) নির্বাচন করুন।  যদি এটি প্রতি-সংযুক্তি সীমার চেয়ে কম হয় তবে এটি সীমা হবে।';
 $helptxt['attachmentSizeLimit'] = 'প্রতিটি পৃথক সংযুক্তির সর্বোচ্চ ফাইলের আকার নির্বাচন করুন।';
 $helptxt['attachmentNumPerPostLimit'] = 'একজন ব্যক্তি প্রতি পোস্টে কতগুলো সংযুক্তি করতে পারে তা নির্বাচন করুন।';
 $helptxt['attachmentShowImages'] = 'আপলোড করা ফাইলটি যদি একটি ছবি হয়, তাহলে সেটি পোস্টের নিচে প্রদর্শিত হবে।';
 $helptxt['attachmentThumbnails'] = 'যদি উপরের সেটিংটি নির্বাচন করা হয়, তাহলে এটি ব্যান্ডউইথ কমাতে থাম্বনেইলের জন্য একটি পৃথক (ছোট) সংযুক্তি সংরক্ষণ করবে।';
 $helptxt['attachmentThumbWidth'] = 'শুধুমাত্র &quot;পোস্টের নিচে দেখানোর সময় চিত্রের আকার পরিবর্তন করুন&quot;  সেটিং  সংযুক্তিগুলির আকার পরিবর্তন করার জন্য এটি সর্বাধিক প্রস্থ।  তাদের আনুপাতিক আকার পরিবর্তন করা হবে।';
 $helptxt['attachmentThumbHeight'] = 'শুধুমাত্র পোস্টের নিচে দেখানোর সময় ইমেজ রিসাইজ করা হয়'  সেটিং  সংযুক্তিগুলির আকার পরিবর্তন করার জন্য এটি সর্বাধিক উচ্চতা।  তাদের আনুপাতিক আকার পরিবর্তন করা হবে।';
 $helptxt['attachmentDirFileLimit'] = 'ডিরেক্টরি প্রতি ফাইলের সর্বোচ্চ সংখ্যা';
 $helptxt['attachmentEnable'] = 'এই সেটিং আপনাকে কীভাবে সংযুক্তিগুলি তৈরি করা যায় তা কনফিগার করতে সক্ষম করে৷<br><br>
 	 <ul class="normallist">
 		 <li>
 			 <strong>সমস্ত সংযুক্তি নিষ্ক্রিয় করুন</strong><br>
 			 সমস্ত সংযুক্তি নিষ্ক্রিয় করা হয়.  বিদ্যমান সংযুক্তিগুলি মুছে ফেলা হয় না, তবে সেগুলি দৃশ্য থেকে লুকানো হয় (এমনকি প্রশাসকরাও সেগুলি দেখতে পারে না)৷  অনুমতি নির্বিশেষে নতুন সংযুক্তিগুলিও করা যাবে না৷<br><br>৷
 		 </li>
 		 <li>
 			 <strong>সমস্ত সংযুক্তি সক্ষম করুন</strong><br>
 			 সবকিছু স্বাভাবিক হিসাবে আচরণ করে, যে ব্যবহারকারীদের সংযুক্তিগুলি দেখার অনুমতি দেওয়া হয়েছে তারা তা করতে পারে, যে ব্যবহারকারীদের আপলোড করার অনুমতি দেওয়া হয়েছে তারা তা করতে পারে৷<br><br>
 		 </li>
 		 <li>
 			 <strong>নতুন সংযুক্তিগুলি অক্ষম করুন</strong><br>৷
 			 বিদ্যমান সংযুক্তিগুলি এখনও অ্যাক্সেসযোগ্য, তবে অনুমতি নির্বিশেষে কোনো নতুন সংযুক্তি যোগ করা যাবে না৷
 		 </li>
 	 </ul>';
 $helptxt['attachment_image_paranoid'] = 'এই সেটিংটি নির্বাচন করা ছবি সংযুক্তিগুলিতে অত্যন্ত কঠোর নিরাপত্তা পরীক্ষা সক্ষম করবে৷  <strong>সতর্কতা!</strong> এই বিস্তৃত চেকগুলি বৈধ ছবিতেও ব্যর্থ হতে পারে৷  এটি দৃঢ়ভাবে সুপারিশ করা হয় যে শুধুমাত্র এই সেটিংটি ইমেজ রি-এনকোডিংয়ের সাথে একসাথে ব্যবহার করার জন্য, যাতে SMF সেই ছবিগুলিকে পুনরায় নমুনা করার চেষ্টা করে যা নিরাপত্তা পরীক্ষায় ব্যর্থ হয়: সফল হলে, সেগুলি স্যানিটাইজ এবং আপলোড করা হবে।  অন্যথায়, ইমেজ রি-এনকোডিং সক্ষম না হলে, চেক ব্যর্থ হওয়া সমস্ত সংযুক্তি প্রত্যাখ্যান করা হবে।';
 $helptxt['attachment_image_reencode'] = 'এই সেটিংটি নির্বাচন করলে আপলোড করা ছবি সংযুক্তিগুলিকে পুনরায় এনকোড করার চেষ্টা করা সম্ভব হবে৷  ইমেজ রি-এনকোডিং ভালো নিরাপত্তা প্রদান করে।  তবে মনে রাখবেন যে ইমেজ রি-এনকোডিং সমস্ত অ্যানিমেটেড ছবিকে স্ট্যাটিক রেন্ডার করে।  <br> এই বৈশিষ্ট্যটি শুধুমাত্র তখনই সম্ভব যদি আপনার সার্ভারে জিডি মডিউল ইনস্টল করা থাকে।';
 $helptxt['attachment_thumb_memory'] = 'সোর্স ইমেজ (আকার এবং প্রস্থ x উচ্চতা) যত বড় হবে, সফলভাবে থাম্বনেইল ইমেজ তৈরি করতে সিস্টেমের জন্য মেমরির প্রয়োজনীয়তা তত বেশি।<br>এই সেটিং চেক করলে, সিস্টেম অনুমান করবে  প্রয়োজনীয় মেমরি এবং তারপর সেই পরিমাণ অনুরোধ করবে।  যদি সফল হয়, তবেই এটি থাম্বনেইল তৈরি করার চেষ্টা করবে৷<br>এর ফলে কম সাদা পৃষ্ঠার ত্রুটি দেখা দেবে কিন্তু এর ফলে কম থাম্বনেল তৈরি হতে পারে৷  চেক না করে রেখে দিলে সিস্টেম সবসময় থাম্বনেইল তৈরি করার চেষ্টা করবে (একটি নির্দিষ্ট পরিমাণ মেমরি সহ)।  এর ফলে আরও সাদা পাতার ত্রুটি হতে পারে।';
 $helptxt['attachmentRecodeLineEndings'] = 'স্ক্রিপ্টটি আপনার সার্ভার অনুযায়ী লাইনের শেষগুলি পুনরায় কোড করবে।';
 $helptxt['automanage_attachments'] = 'ডিফল্টরূপে, SMF একটি একক ফোল্ডারে নতুন সংযুক্তি রাখে।  বেশিরভাগ সাইটের জন্য এটি একটি সমস্যা নয়, কিন্তু একটি সাইট বাড়ার সাথে সাথে সংযুক্তিগুলি সংরক্ষণ করার জন্য একাধিক ফোল্ডার থাকা উপযোগী হতে পারে৷<br><br>এই সেটিংটি আপনি নিজে এই ফোল্ডারগুলি পরিচালনা করবেন কিনা তা সেট করতে দেয় (যেমন একটি সেকেন্ড তৈরি করা  ফোল্ডার এবং আপনি যখন প্রস্তুত তখন এটিতে চলে যান) অথবা আপনি SMF কে এটি করতে দেন কিনা, মানদণ্ডের উপর ভিত্তি করে, যেমন যখন বর্তমান ডিরেক্টরি একটি নির্দিষ্ট আকারে পৌঁছে যায়, বা খুব ব্যস্ত সাইটগুলিতে বছর বা এমনকি মাস ধরে ফোল্ডারগুলি ভেঙে ফেলা।';
 $helptxt['dont_show_attach_under_post'] = 'সক্রিয় থাকলে, পোস্টে এম্বেড করা অ্যাটাচমেন্ট পোস্টের নিচে প্রদর্শিত হবে না, কিন্তু এখনও মুছে ফেলা হবে।';
 $helptxt['use_subdirectories_for_attachments'] = 'নতুন ডিরেক্টরি তৈরি করুন।';
 $helptxt['max_image_height'] = 'সর্বোচ্চ প্রস্থের মতো, এই সেটিংটি নির্দেশ করে যে একটি পোস্ট করা ছবির সর্বোচ্চ উচ্চতা হতে পারে।';
 $helptxt['avatar_paranoid'] = 'এই সেটিংটি নির্বাচন করা অবতারের উপর অত্যন্ত কঠোর নিরাপত্তা পরীক্ষা সক্ষম করবে।  <strong>সতর্কতা!</strong> এই বিস্তৃত চেকগুলি বৈধ ছবিতেও ব্যর্থ হতে পারে৷  এটি দৃঢ়ভাবে সুপারিশ করা হয় যে শুধুমাত্র এই সেটিংটি অবতার রি-এনকোডিংয়ের সাথে একসাথে ব্যবহার করার জন্য, যাতে SMF সেই ছবিগুলিকে পুনরায় নমুনা করার চেষ্টা করে যা নিরাপত্তা পরীক্ষায় ব্যর্থ হয়: সফল হলে, সেগুলি স্যানিটাইজ করা হবে এবং আপলোড করা হবে৷  অন্যথায়, যদি অবতারের পুনরায় এনকোডিং সক্ষম না করা হয়, চেক ব্যর্থ হওয়া সমস্ত অবতার বাতিল করা হবে৷';
 $helptxt['avatar_reencode'] = 'এই সেটিংটি নির্বাচন করলে আপলোড করা অবতারগুলিকে পুনরায় এনকোড করার চেষ্টা করা সম্ভব হবে৷  ইমেজ রি-এনকোডিং ভালো নিরাপত্তা প্রদান করে।  উল্লেখ্য, যাইহোক, সেই ইমেজ রি-এনকোডিং সব অ্যানিমেটেড ইমেজকে স্ট্যাটিক রেন্ডার করে।  <br> এই বৈশিষ্ট্যটি শুধুমাত্র তখনই সম্ভব যদি আপনার সার্ভারে GD মডিউল ইনস্টল করা থাকে।';
 $helptxt['cal_enabled'] = 'ক্যালেন্ডারটি জন্মদিন দেখানোর জন্য বা আপনার সম্প্রদায়ের গুরুত্বপূর্ণ ঘটনাগুলি দেখানোর জন্য ব্যবহার করা যেতে পারে।  এই সেটিং ক্যালেন্ডার এবং এর সমস্ত বৈশিষ্ট্য সক্রিয় করে।';
 $helptxt['cal_link_postevent'] = 'এটি সদস্যদের সেই দিনের ইভেন্ট পোস্ট করার অনুমতি দেবে, যখন তারা সেই তারিখে ক্লিক করবে';
 $helptxt['cal_maxdays_advance'] = 'যদি এটি 7 এ সেট করা হয়, তাহলে পরের সপ্তাহের ইভেন্টের মূল্য দেখানো হবে';
 $helptxt['cal_allow_unlinkedevents'] = 'সদস্যদের একটি বোর্ডের পোস্টের সাথে লিঙ্ক করার প্রয়োজন ছাড়াই ইভেন্টগুলি পোস্ট করার অনুমতি দিন';
 $helptxt['cal_min_year'] = '&quot;প্রথম&quot; নির্বাচন করুন  ক্যালেন্ডার তালিকায় বছর';
 $helptxt['cal_max_year'] = '&quot;শেষ&quot; নির্বাচন করুন;  ক্যালেন্ডার তালিকায় বছর';
 $helptxt['cal_maxevent_span'] = 'একটি ইভেন্ট যত দিন জুড়ে থাকতে পারে তার সর্বোচ্চ সংখ্যা নির্বাচন করুন';
 $helptxt['localCookies'] = 'SMF ক্লায়েন্ট কম্পিউটারে লগইন তথ্য সংরক্ষণ করতে কুকিজ ব্যবহার করে।
 	 কুকিজ বিশ্বব্যাপী (myserver.com) বা স্থানীয়ভাবে (myserver.com/path/to/forum) সংরক্ষণ করা যেতে পারে।<br><br>
 	 আপনি যদি ব্যবহারকারীদের স্বয়ংক্রিয়ভাবে লগ আউট হওয়ার সমস্যার সম্মুখীন হন তবে এই সেটিংটি ব্যবহার করে দেখুন৷<hr>৷
 	 শেয়ার্ড ওয়েব সার্ভারে (যেমন ট্রাইপড) ব্যবহার করা হলে বিশ্বব্যাপী সঞ্চিত কুকিজ কম সুরক্ষিত থাকে।<hr>
 	 স্থানীয় কুকিগুলি ফোরাম ডিরেক্টরির বাইরে কাজ করে না তাই, যদি আপনার ফোরাম www.myserver.com/forum এ সংরক্ষিত থাকে, www.myserver.com/index.php এর মতো পৃষ্ঠাগুলি অ্যাকাউন্টের তথ্য অ্যাক্সেস করতে পারে না৷<br><br>
 	 SSI.php ব্যবহার করার সময় গ্লোবাল কুকিজ বিশেষভাবে সুপারিশ করা হয় তবে তাদের নিজস্ব ডোমেনে বেশিরভাগ সাইটের জন্য ভাল কাজ করে।';
 $helptxt['enableBBC'] = 'এই সেটিংটি নির্বাচন করলে আপনার সদস্যরা পুরো ফোরাম জুড়ে বুলেটিন বোর্ড কোড (বিবিসি) ব্যবহার করতে পারবে, ব্যবহারকারীদের ছবি, টাইপ ফরম্যাটিং এবং আরও অনেক কিছু দিয়ে তাদের পোস্ট ফরম্যাট করার অনুমতি দেবে।';
 $helptxt['legacy_bbc'] = 'লিগেসি বিবিকোডগুলি অপ্রচলিত এবং নতুন পোস্টে ব্যবহার করা যাবে না৷  যাইহোক, এখানে সক্ষম হলে সেগুলি বিদ্যমান পোস্টগুলিতে পার্স করা হবে৷<br><br>লেগ্যাসি BBCcodes সক্ষম করা শুধুমাত্র তখনই উপযোগী যদি আপনার ফোরামটি SMF এর পূর্ববর্তী সংস্করণ থেকে আপগ্রেড করা হয়৷<br><br>এছাড়াও, এমনকি যখন সেগুলি সক্রিয় থাকে  , কিছু লিগ্যাসি BBCcodes একইভাবে রেন্ডার করা হবে না যেভাবে তারা আগে ছিল।  উদাহরণস্বরূপ, [ফ্ল্যাশ] বিবিকোড ফ্ল্যাশ বিষয়বস্তুকে এম্বেড করার পরিবর্তে একটি লিঙ্ক দেখাবে।';
 $helptxt['default_timezone'] = 'এটি ফোরাম জুড়ে সময় প্রদর্শনের জন্য ব্যবহৃত ডিফল্ট টাইমজোন।';
 $helptxt['timezone_priority_countries'] = 'এই সেটিংটি আপনাকে একটি নির্দিষ্ট দেশ বা দেশের জন্য সময় অঞ্চলগুলিকে নির্বাচনযোগ্য টাইম জোনের তালিকার শীর্ষে ঠেলে দিতে দেয় যা দেখানো হয় যখন ব্যবহারকারীরা তাদের প্রোফাইল কনফিগার করছেন, ক্যালেন্ডার ইভেন্টগুলি তৈরি করছেন ইত্যাদি৷<  br><br>উদাহরণস্বরূপ, যদি আপনার ফোরামের অনেক সদস্য নিউজিল্যান্ড বা ফিজিতে থাকেন, তাহলে আপনি "NZ,FJ" লিখতে পারেন যাতে তাদের জন্য সবচেয়ে প্রাসঙ্গিক সময় অঞ্চলগুলি দ্রুত খুঁজে পাওয়া সহজ হয়৷<br>  <br>আপনি "<a href="https://www.google.com/search?q=iso+3166-1+alpha-2" target= এর জন্য ইন্টারনেট অনুসন্ধান করে ISO দেশের কোডগুলির সম্পূর্ণ তালিকা খুঁজে পেতে পারেন  "_blank" rel="noopener">ISO 3166-1 আলফা-2</a>"।';
 $helptxt['spamWaitTime'] = 'এখানে আপনি পোস্ট করার মধ্যে যে পরিমাণ সময় পার করতে হবে তা নির্বাচন করতে পারেন।  লোকেরা কত ঘন ঘন পোস্ট করতে পারে তা সীমিত করে আপনার ফোরামকে "স্প্যামিং" থেকে আটকাতে এটি ব্যবহার করা যেতে পারে৷';

 $helptxt['enablePostHTML'] = 'এটি কিছু মৌলিক HTML ট্যাগ পোস্ট করার অনুমতি দেবে:
 	 <ul class="normallist">
 		 <li>&lt;b&gt;, &lt;u&gt;, &lt;i&gt;, &lt;s&gt;, &lt;em&gt;, &lt;strong&gt;, &lt;ins&gt;, &lt;del&gt;</li>
 		 <li>&lt;a href=&quot;&quot;&gt;</li>
 		 <li>&lt;img src=&quot;&quot;  alt=&quot;&quot;  /&gt;</li>
 		 <li>&lt;br&gt;, &lt;hr&gt;</li>
 		 <li>&lt;pre&gt;, &lt;blockquote&gt;</li>
 	 </ul>';

 $helptxt['themes_manage'] = 'এখানে আপনি নতুন থিম ইন্সটল করতে পারবেন এবং আপনার ব্যবহারকারীরা কোন থিম থেকে বেছে নিতে পারবেন, নতুন ব্যবহারকারী এবং অতিথিরা যে ডিফল্ট থিম ব্যবহার করবেন, সেইসাথে অন্যান্য থিম নির্বাচন সেটিংস নির্বাচন করতে পারবেন।';
 $helptxt['theme_install'] = 'এটি আপনাকে নতুন থিম ইনস্টল করতে দেয়।  আপনি একটি বিদ্যমান ডিরেক্টরি থেকে, থিমের জন্য একটি সংরক্ষণাগার আপলোড করে বা ডিফল্ট থিম অনুলিপি করে এটি করতে পারেন৷<br><br>মনে রাখবেন যে সংরক্ষণাগার বা ডিরেক্টরির একটি <pre>theme_info.xml</pre> সংজ্ঞা থাকতে হবে  ফাইল।';
 $helptxt['xmlnews_enable'] = 'লোকেদের <a href="%1$s?action=.xml;sa=news" target="_blank" rel="noopener">সাম্প্রতিক সংবাদ</a> লিঙ্ক করার অনুমতি দেয়
 	 এবং অনুরূপ ডেটা।  এটাও বাঞ্ছনীয় যে আপনি সাম্প্রতিক পোস্ট/সংবাদের আকার সীমিত করুন কারণ কিছু ক্লায়েন্ট আশা করে যে RSS ডেটা প্রদর্শনের জন্য কেটে যাবে।';
 $helptxt['xmlnews_attachments'] = 'আপনার XML/RSS ফিডের মধ্যে সংযুক্তির লিঙ্কগুলিকে আবদ্ধ করার অনুমতি দেয়৷  আপনি যদি আপনার ফোরামকে পডকাস্টিং, ব্রডক্যাচিং বা অনুরূপ সামগ্রী বিতরণ প্ল্যাটফর্ম হিসাবে ব্যবহার করতে চান তবে এটি চালু করুন৷
 	 <br><br>
 	 "সংযুক্তিগুলি দেখুন" অনুমতি এই সেটিংকে প্রভাবিত করে৷  সদস্য এবং অতিথিরা শুধুমাত্র ফিডে একটি পোস্টের সংযুক্তি দেখতে পাবেন যদি তারা পোস্টের ওয়েব পৃষ্ঠায় সংযুক্তিগুলিও দেখতে পান৷  মনে রাখবেন যে বেশিরভাগ ফিড পাঠক অতিথি হিসাবে আপনার ফিডগুলি অ্যাক্সেস করবে৷
 	 <br><br>
     কিছু ফিড ফরম্যাট শুধুমাত্র প্রতি পোস্টে একটি সংযুক্ত সংযুক্তির অনুমতি দেয়।  যদি একটি পোস্টে একাধিক সংযুক্তি থাকে, তাহলে SMF এই ফিডগুলিতে সবচেয়ে বড়টি সংযুক্ত করবে৷';
 $helptxt['globalCookies'] = 'সাবডোমেন জুড়ে লগ ইন কুকিজ উপলব্ধ করে।  উদাহরণস্বরূপ, যদি...<br>
 	 আপনার সাইট হল https://www.example.com/,<br>
 	 এবং আপনার ফোরাম হল https://forum.example.com/,<br>
 	 এই সেটিং ব্যবহার করে আপনি আপনার সাইটে ফোরামের কুকি অ্যাক্সেস করতে পারবেন।  অন্য সাবডোমেন (যেমন hacker.example.com) আপনার দ্বারা নিয়ন্ত্রিত না হলে এটি সক্ষম করবেন না৷<br><br>
 	 স্থানীয় কুকিজ সক্রিয় থাকলে এই সেটিং কাজ করে না।';
 $helptxt['globalCookiesDomain'] = 'সাবডোমেন স্বাধীন কুকিজ (গ্লোবাল কুকিজ) ব্যবহার করার সময়, আপনি তাদের জন্য কোন ডোমেন ব্যবহার করা উচিত তা উল্লেখ করতে পারেন।  এটি অবশ্যই আপনার প্রধান ডোমেনে সেট করা উচিত - উদাহরণস্বরূপ, আপনি যদি <em>forum.example.com</em> এবং <em>www.example.com</em> ব্যবহার করেন তবে ডোমেনটি হল <  em>example.com</em> এই ক্ষেত্রে।  আপনি এটির সামনে <em>http://</em> বা <em>https://</em> অংশ রাখবেন না।';
 $helptxt['secureCookies'] = 'এই সেটিং সক্রিয় করা আপনার ফোরামে ব্যবহারকারীদের জন্য তৈরি করা কুকিগুলিকে সুরক্ষিত হিসাবে চিহ্নিত করতে বাধ্য করবে৷  আপনি যদি আপনার সাইটে জুড়ে HTTPS ব্যবহার করেন তবেই কেবল এই সেটিংটি সক্ষম করুন, অন্যথায় এর অর্থ হবে যে কেউ সঠিকভাবে লগ ইন করতে পারবে না!';
 $helptxt['securityDisable'] = 'সক্রিয় করা হলে, এটি প্রশাসনিক পৃষ্ঠার জন্য অতিরিক্ত পাসওয়ার্ড চেক <em>অক্ষম</em> করে।  এটা বাঞ্ছনীয় নয়!';
 $helptxt['securityDisable_why'] = 'আপনার বর্তমান পাসওয়ার্ড লিখুন।  (যেটি আপনি লগইন করতে ব্যবহার করেন।)<br><br>এটি প্রবেশ করার প্রয়োজনীয়তা নিশ্চিত করতে সাহায্য করে যে আপনি যে প্রশাসনই করছেন তা আপনি করতে চান এবং এটি <strong>আপনি</strong> করছেন।'  ;
 $helptxt['securityDisable_moderate'] = 'সক্রিয় করা হলে, এটি মডারেশন পৃষ্ঠার জন্য অতিরিক্ত পাসওয়ার্ড চেক <em>অক্ষম</em> করে।  এই সেটিং ডিফল্টরূপে সক্রিয় করা হয়.';
 $helptxt['securityDisable_moderate_why'] = 'আপনার বর্তমান পাসওয়ার্ড লিখুন।  (যেটি আপনি লগইন করতে ব্যবহার করেন।)<br><br>এটি প্রবেশ করার প্রয়োজনীয়তা নিশ্চিত করতে সাহায্য করে যে আপনি যা কিছু সংযম করছেন তা আপনি করতে চান এবং এটি <strong>আপনি</strong> করছেন।'  ;
 $helptxt['allow_cors'] = 'ক্রস অরিজিন রিসোর্স শেয়ারিং বা CORS হল আধুনিক ব্রাউজারদের বিভিন্ন ডোমেনে অনুরোধ করা রিসোর্সকে বিশ্বাস করার জন্য একটি নীতি।   যদি সক্ষম করা থাকে, তাহলে এটি বিভিন্ন ডোমেন থেকে ফোরাম সংস্থান অ্যাক্সেস করার স্ক্রিপ্টগুলির জন্য CORS নীতির সমাধান করার চেষ্টা করবে৷   যদি সাবডোমেন স্বাধীন কুকিজ (গ্লোবাল কুকিজ) সক্ষম করা হয়, তাহলে সঠিক ডোমেইন নির্ধারণ করার চেষ্টা করা হয়।   ডোমেনগুলির একটি কমা দ্বারা পৃথক তালিকা সহ অতিরিক্ত CORS ডোমেনগুলি সরবরাহ করা অতিরিক্ত ডোমেনের জন্য অনুমতি দেয়৷   ফর্ম্যাটটি হওয়া উচিত {SCHEMA}://{DOMAIN}৷   যদি ডোমেনে একটি ওয়াইল্ডকার্ড (*) সরবরাহ করা হয়, তাহলে ওয়াইল্ডকার্ডটি সমাধান করার চেষ্টা করা হয়।   যদি একটি ওয়াইল্ডকার্ড (*) শুধুমাত্র অতিরিক্ত ডোমেন হিসাবে সরবরাহ করা হয়, তবে সমস্ত ডোমেন অনুমোদিত হয় এবং এটি আপনার ফোরামে একটি নিরাপত্তা ঝুঁকি উপস্থাপন করতে পারে এবং চরম ক্ষেত্রে ছাড়া ব্যবহার করা উচিত নয়।   অতিরিক্ত শিরোনামগুলি একটি কমা পৃথক তালিকায় সরবরাহ করা যেতে পারে এবং এই শিরোনামগুলি সম্বলিত অনুরোধের সময় অনুমতি দেওয়া হবে এবং ওয়াইল্ডকার্ড (*) অনুমোদিত।';
 $helptxt['frame_security'] = 'আধুনিক ব্রাউজার এখন X-Frame-Options নামক সার্ভার দ্বারা উপস্থাপিত একটি নিরাপত্তা শিরোনাম বোঝে।  এই বিকল্পটি সেট করে আপনি নির্দিষ্ট করেন যে আপনি কীভাবে আপনার সাইটকে ফ্রেমসেট বা আইফ্রেমের মধ্যে ফ্রেম করার অনুমতি দিতে চান।  নিষ্ক্রিয় কোনো শিরোনাম পাঠাবে না এবং সবচেয়ে অনিরাপদ, তবে সর্বাধিক স্বাধীনতার অনুমতি দেয়।  অস্বীকার সম্পূর্ণরূপে সমস্ত ফ্রেম প্রতিরোধ করবে এবং সবচেয়ে সীমাবদ্ধ এবং নিরাপদ.  একই উত্সকে অনুমতি দিলে শুধুমাত্র আপনার ডোমেন যেকোন ফ্রেম ইস্যু করতে পারবে এবং পূর্ববর্তী দুটি বিকল্পের জন্য একটি মধ্যম স্থল প্রদান করবে।';
 $helptxt['proxy_ip_header'] = 'এটি সার্ভার হেডার যা প্রকৃত ব্যবহারকারীদের আইপি ঠিকানা ধারণ করার জন্য SMF দ্বারা বিশ্বস্ত হবে।  এই সেটিং পরিবর্তন করলে সদস্যদের উপর অপ্রত্যাশিত IP ফলাফল হতে পারে।  এই সেটিংস পরিবর্তন করার আগে আপনার সার্ভার অ্যাডমিনিস্ট্রেটর, CDN প্রদানকারী বা প্রক্সি অ্যাডমিনিস্ট্রেটরের সাথে চেক করুন।  অধিকাংশ প্রদানকারী HTTP_X_FORWARDED_FOR বুঝতে এবং ব্যবহার করবে৷  নিরাপত্তার জন্য রিভার্স প্রক্সি হেডার পাঠানো সার্ভারের তালিকা আপনার পূরণ করা উচিত যাতে এই শিরোনামগুলি শুধুমাত্র বৈধ উৎস থেকে আসে।';
 $helptxt['email_members'] = 'এই বার্তাটিতে আপনি কয়েকটি &quot;ভেরিয়েবল&quot; ব্যবহার করতে পারেন।  এগুলো হল:<br>
 	 {$board_url} - আপনার ফোরামের URL৷<br>৷
 	 {$current_time} - বর্তমান সময়।<br>
 	 {$member.email} - বর্তমান সদস্যের ইমেল৷<br>৷
 	 {$member.link} - বর্তমান সদস্যের লিঙ্ক৷<br>৷
 	 {$member.id} - বর্তমান সদস্যের আইডি৷<br>৷
 	 {$member.name} - বর্তমান সদস্যের নাম।  (ব্যক্তিগতকরণের জন্য)।<br>
 	 {$latest_member.link} - অতি সম্প্রতি নিবন্ধিত সদস্যের লিঙ্ক৷<br>৷
 	 {$latest_member.id} - অতি সম্প্রতি নিবন্ধিত সদস্যের আইডি৷<br>৷
 	 {$latest_member.name} - অতি সম্প্রতি নিবন্ধিত সদস্যের নাম।';

 $helptxt['failed_login_threshold'] = 'ব্যবহারকারীকে পাসওয়ার্ড রিমাইন্ডার পৃষ্ঠায় পাঠানোর আগে ব্যর্থ লগইন প্রচেষ্টার সংখ্যা সেট করুন।';
 $helptxt['loginHistoryDays'] = 'ব্যবহারকারী প্রোফাইল ট্র্যাকিংয়ের অধীনে লগইন ইতিহাস রাখার জন্য দিনের সংখ্যা।  ডিফল্ট 30 দিন।';
 $helptxt['oldTopicDays'] = 'যদি এই সেটিংটি সক্ষম করা থাকে, ব্যবহারকারীর কাছে একটি সতর্কতা প্রদর্শিত হবে যখন একটি বিষয়ের উত্তর দেওয়ার চেষ্টা করা হবে যেখানে এই সেটিং দ্বারা নির্দিষ্ট সময়ের জন্য কোন নতুন উত্তর দেওয়া হয়নি।  .  বৈশিষ্ট্যটি নিষ্ক্রিয় করতে এই সেটিংটি 0 এ সেট করুন।';
 $helptxt['edit_wait_time'] = 'শেষ সম্পাদনার তারিখ লগ করার আগে একটি পোস্ট সম্পাদনা করার জন্য অনুমোদিত সেকেন্ডের সংখ্যা।';
 $helptxt['edit_disable_time'] = 'ব্যবহারকারী তার করা পোস্ট এডিট করতে না পারার আগে পাস করার অনুমতি দেওয়া মিনিটের সংখ্যা।  0 নিষ্ক্রিয় সেট করুন।  <br><br><em>দ্রষ্টব্য: এটি এমন কোনো ব্যবহারকারীকে প্রভাবিত করবে না যার অন্য ব্যক্তির পোস্ট সম্পাদনা করার অনুমতি আছে৷</em>';
 $helptxt['preview_characters'] = 'এই সেটিংটি প্রথম এবং শেষ বার্তা বিষয়ের পূর্বরূপের জন্য উপলব্ধ অক্ষরের সংখ্যা নির্ধারণ করে।';
 $helptxt['quote_expand'] = 'এই সেটিংটি বড় উদ্ধৃতিগুলিকে ভেঙে ফেলার অনুমতি দেয়, ব্যবহারকারীকে তাদের সম্পূর্ণ দৈর্ঘ্যে প্রসারিত করার বিকল্প দেয়।  এই সেটিং থেকে ছোট উদ্ধৃতি প্রভাবিত হবে না৷';
 $helptxt['posts_require_captcha'] = 'এই সেটিংটি ব্যবহারকারীদের প্রতিবার বোর্ডে পোস্ট করার সময় অ্যান্টি-স্প্যাম বট যাচাইকরণ পাস করতে বাধ্য করবে।  শুধুমাত্র সংখ্যা সেটের নীচে একটি পোস্ট গণনা সহ ব্যবহারকারীদের কোডটি প্রবেশ করতে হবে - এটি স্বয়ংক্রিয় স্প্যামিং স্ক্রিপ্টগুলির বিরুদ্ধে লড়াই করতে সহায়তা করবে৷';
 $helptxt['disable_wysiwyg'] = 'এই সেটিংটি সমস্ত ব্যবহারকারীকে পোস্ট পৃষ্ঠায় WYSIWYG (&quot;আপনি যা দেখেন তা আপনি যা পান&quot;) সম্পাদক ব্যবহার করতে নিষেধ করে।';
 $helptxt['lastActive'] = 'বোর্ড সূচকে X মিনিটের মধ্যে লোকেদের সক্রিয় দেখানোর জন্য মিনিটের সংখ্যা সেট করুন।  ডিফল্ট হল 15 মিনিট।';

 $helptxt['customoptions'] = 'এটি বিকল্পগুলিকে সংজ্ঞায়িত করে যা একজন ব্যবহারকারী ড্রপ ডাউন তালিকা থেকে বেছে নিতে পারে।  এই পৃষ্ঠায় লক্ষ্য করার জন্য কয়েকটি মূল পয়েন্ট রয়েছে:
 	 <ul class="normallist">
 		 <li><strong>ডিফল্ট সেটিং:</strong> যে কোনো চেক বক্সে &quot;রেডিও বোতাম&quot;  ব্যবহারকারী যখন তাদের প্রোফাইলে প্রবেশ করেন তখন এটির পাশে নির্বাচিতটি ডিফল্ট নির্বাচন হবে৷</li>
 		 <li><strong>বিকল্প অপসারণ:</strong> একটি বিকল্প সরাতে কেবলমাত্র সেই বিকল্পের জন্য পাঠ্য বাক্সটি খালি করুন - যে সমস্ত ব্যবহারকারীরা নির্বাচন করেছেন তাদের বিকল্পটি সাফ হয়ে যাবে৷</li>
 		 <li><strong>পুনঃক্রমের বিকল্পগুলি:</strong> আপনি বাক্সগুলির মধ্যে পাঠ্যকে ঘুরিয়ে দিয়ে বিকল্পগুলিকে পুনরায় সাজাতে পারেন৷  যাইহোক - একটি গুরুত্বপূর্ণ দ্রষ্টব্য - আপনাকে অবশ্যই নিশ্চিত করতে হবে যে বিকল্পগুলি পুনরায় সাজানোর সময় আপনি পাঠ্য পরিবর্তন <strong>করবেন না</strong> কারণ অন্যথায় ব্যবহারকারীর ডেটা হারিয়ে যাবে৷</li>
 	 </ul>';

 $helptxt['autoFixDatabase'] = 'এটি স্বয়ংক্রিয়ভাবে ভাঙা টেবিল ঠিক করবে এবং আবার শুরু করবে যেন কিছুই হয়নি।  যখন এটি ঘটে তখন এটি আপনাকে ইমেল করে৷<br>আপনি যদি এই বিকল্পটি অক্ষম করতে চান তবে আপনার ফোরামটি বন্ধ থাকবে যতক্ষণ না আপনি লক্ষ্য করবেন এবং ম্যানুয়ালি সমস্যার সমাধান করবেন৷';
 // যুক্তি(গুলি): scripturl
 $helptxt['pgFulltextSearch'] = 'এই সেটিংটি PostgreSQL এর ফুলটেক্সট অনুসন্ধানের জন্য ব্যবহার করার জন্য ভাষা নির্ধারণ করে।  আপনার ফোরাম আসলে যে ভাষা ব্যবহার করে তার সাথে সবচেয়ে ঘনিষ্ঠভাবে মেলে এমন ভাষা বেছে নিন।  যদি আপনার ফোরামের ভাষা তালিকাভুক্ত না হয়, অথবা যদি আপনার ফোরামটি বহুভাষিক হয়, তাহলে "সহজ" বিকল্পটি বেছে নিন।  <br>
 এই সেটিংটি আপনার প্রধান SMF ভাষা সেটিংস থেকে স্বাধীন এবং SMF-এর জন্য ইনস্টল করা ভাষার সাথে সম্পর্কিত নয়।  <br>
 আপনি যখন এই সেটিং পরিবর্তন করবেন তখন আপনাকে <a href="%1$s?action=admin;area=managesearch;sa=method" target="_blank" rel="noopener">পূর্ণ পাঠ্য অনুসন্ধান সূচী পুনর্নির্মাণ করতে হবে</a>  .<br>
 আপনার প্রয়োজনীয় কোনো ভাষা তালিকাভুক্ত না হলে, আপনার ডাটাবেস অ্যাডমিনকে সেই ভাষার জন্য PostgreSQL ভাষা সমর্থন ইনস্টল করতে বলুন।';

 $helptxt['enableParticipation'] = 'এটি ব্যবহারকারীর পোস্ট করা বিষয়গুলির উপর একটি ছোট আইকন দেখায়।';

 $helptxt['db_persist'] = 'এটি কর্মক্ষমতা বাড়াতে সংযোগটিকে সক্রিয় রাখে।  আপনি একটি ডেডিকেটেড সার্ভারে না থাকলে, এটি আপনার হোস্টের সাথে সমস্যা সৃষ্টি করতে পারে৷<br>
 এই বিকল্পটি নিষ্ক্রিয় থাকলে, আপনাকে আপনার php.ini ফাইলে mysqli.allow_persistent বা pgsql.allow_persistent সেটিং সক্রিয় করতে হতে পারে।';
 $helptxt['ssi_db_user'] = 'আপনি যখন SSI.php ব্যবহার করছেন তখন একটি ভিন্ন ডাটাবেস ব্যবহারকারী এবং পাসওয়ার্ড ব্যবহার করার জন্য ঐচ্ছিক সেটিং';

 // আর্গুমেন্ট(গুলি): হয় $helptxt['queryless_urls_supported'] অথবা $helptxt['queryless_urls_unsupported'], সার্ভার একটি সমর্থিত ওয়েব সার্ভার ব্যবহার করে কিনা তার উপর নির্ভর করে
 $helptxt['queryless_urls'] = 'এটি URL-এর বিন্যাসকে কিছুটা পরিবর্তন করে যাতে সার্চ ইঞ্জিনগুলি সেগুলিকে আরও ভালোভাবে পছন্দ করবে৷  এগুলো দেখতে index.php/topic,1.0.html এর মত হবে।<br><br>%1$s';
 // শর্তসাপেক্ষে $helptxt['queryless_urls'] এর অংশ হিসাবে ব্যবহৃত হয়
 $helptxt['queryless_urls_supported'] = 'এই বৈশিষ্ট্যটি আপনার সার্ভারে কাজ করবে।';
 // শর্তসাপেক্ষে $helptxt['queryless_urls'] এর অংশ হিসাবে ব্যবহৃত হয়
 $helptxt['queryless_urls_unsupported'] = 'এই বৈশিষ্ট্যটি আপনার সার্ভারে কাজ করবে না।';
 $helptxt['minimize_files'] = 'এই বিকল্পটি আপনার ফোরামে ব্যবহৃত CSS এবং JavaScript ফাইলগুলিকে কমিয়ে দেবে, আপনার সার্ভারে অনুরোধ কলগুলিকে কমিয়ে দেবে এবং আপনার ব্যবহারকারীদের জন্য লোডের সময়কে দ্রুত করবে৷<br><br>আপনার সাধারণত এটি ছেড়ে দেওয়া উচিত৷  বিকল্প সক্রিয়।  আপনি যখন আপনার সাইটে ব্যবহৃত CSS বা JavaScript ফাইলগুলিকে পরিবর্তন করার প্রক্রিয়ার মধ্যে থাকেন তখনই আপনি এটিকে সাময়িকভাবে নিষ্ক্রিয় করতে চাইতে পারেন (উদাহরণস্বরূপ, আপনার থিম ফাইলগুলি সম্পাদনা করার সময় বা একটি পরিবর্তন বিকাশ করার সময়)।';
 $helptxt['boardindex_max_depth'] = 'সাব-বোর্ডে নতুন পোস্ট খোঁজার সময় কতগুলি সাব-বোর্ড স্তর SMF চেক করবে এই সেটিং নিয়ন্ত্রণ করে।  "অভিভাবকের মোটে সাব-বোর্ডের পোস্টগুলি গণনা করুন" বিকল্পটি সক্রিয় থাকলে কোন বোর্ডগুলি অন্তর্ভুক্ত করা হবে তাও এটি প্রভাবিত করে৷<br><br>উদাহরণস্বরূপ, যদি এটি 1 তে সেট করা হয়, একটি সাব-বোর্ড হবে  শুধুমাত্র সূচী পৃষ্ঠায় "নতুন" হিসাবে চিহ্নিত করা হবে যদি সাব-বোর্ডে একটি নতুন পোস্ট থাকে।  যদি এটি 2 তে সেট করা হয়, সাব-বোর্ডে বা সাব-সাব-বোর্ডে একটি নতুন পোস্ট থাকলে সাব-বোর্ডটিকে "নতুন" হিসাবে চিহ্নিত করা হবে।  যদি এটি 10-এ সেট করা হয়, তাহলে উপ-বোর্ডে একটি নতুন পদ, একটি উপ-উপ-বোর্ড, একটি উপ-উপ-উপ-বোর্ড, ইত্যাদি পর্যন্ত, উপ-বোর্ড "নতুন" হিসাবে চিহ্নিত হবে  10 স্তর গভীর।<br><br>বড়, সক্রিয় ফোরাম সার্ভার সংস্থান সংরক্ষণের জন্য এই মানটিকে কম সংখ্যায় সেট করতে চাইতে পারে।';
 $helptxt['countChildPosts'] = 'এই সেটিং চেক করার অর্থ হল একটি বোর্ডের সাব-বোর্ডের পোস্ট এবং বিষয়গুলিকে সূচী পৃষ্ঠায় তার মোট সংখ্যার দিকে গণনা করা হবে৷<br><br>এর মানে হল একটি প্যারেন্ট বোর্ড যেখানে নেই  এর সাব-বোর্ডে কোনো পোস্ট থাকলে এটির পোস্টগুলি \'0\' দেখাবে না।';
 $helptxt['allow_ignore_boards'] = 'এই সেটিং চেক করা ব্যবহারকারীদের তারা উপেক্ষা করতে চান এমন বোর্ড নির্বাচন করতে অনুমতি দেবে।';
 $helptxt['deny_boards_access'] = 'এই সেটিংটি চেক করা আপনাকে সদস্যগোষ্ঠীর অ্যাক্সেসের উপর ভিত্তি করে নির্দিষ্ট বোর্ডগুলিতে অ্যাক্সেস অস্বীকার করার অনুমতি দেবে';
 
 // যুক্তি(গুলি): scripturl
 $helptxt['who_enabled'] = 'এই সেটিং আপনাকে <a href="%1$s?action=who" target="_blank" rel="noopener">কে অনলাইনে চালু বা বন্ধ করতে দেয়৷  /a> পৃষ্ঠা, যা দেখায় কে ফোরাম ব্রাউজ করছে এবং তারা কি করছে।';

 $helptxt['recycle_enable'] = '&quot;রিসাইকেল&quot;  মুছে ফেলা বিষয় এবং নির্দিষ্ট বোর্ডের পোস্ট.';

 $helptxt['enableReportPM'] = 'এই সেটিংটি আপনার ব্যবহারকারীদের প্রশাসনিক দলের কাছে প্রাপ্ত ব্যক্তিগত বার্তাগুলিকে রিপোর্ট করতে দেয়।  ব্যক্তিগত মেসেজিং সিস্টেমের কোনো অপব্যবহার ট্র্যাক করতে সাহায্য করতে এটি কার্যকর হতে পারে।';
 $helptxt['max_pm_recipients'] = 'এই সেটিং আপনাকে একজন ফোরাম সদস্যের পাঠানো একক ব্যক্তিগত বার্তায় অনুমোদিত প্রাপকদের সর্বোচ্চ পরিমাণ সেট করতে দেয়।  এটি PM সিস্টেমের স্প্যাম অপব্যবহার বন্ধ করতে সাহায্য করতে ব্যবহার করা যেতে পারে।  নোট করুন যে ব্যবহারকারীদের নিউজলেটার পাঠানোর অনুমতি আছে তারা এই সীমাবদ্ধতা থেকে অব্যাহতিপ্রাপ্ত।  কোন সীমার জন্য শূন্য সেট করুন।';
 $helptxt['pm_posts_verification'] = 'এই সেটিংটি ব্যবহারকারীদের প্রতিবার ব্যক্তিগত বার্তা পাঠানোর সময় একটি যাচাইকরণ ছবিতে দেখানো একটি কোড লিখতে বাধ্য করবে।  শুধুমাত্র সংখ্যা সেটের নীচে একটি পোস্ট গণনা সহ ব্যবহারকারীদের কোডটি প্রবেশ করতে হবে - এটি স্বয়ংক্রিয় স্প্যামিং স্ক্রিপ্টগুলির বিরুদ্ধে লড়াই করতে সহায়তা করবে৷';
 $helptxt['pm_posts_per_hour'] = 'এটি ব্যক্তিগত বার্তার সংখ্যা সীমিত করবে যা একজন ব্যবহারকারীর দ্বারা এক ঘন্টার মধ্যে পাঠানো হতে পারে।  এটি অ্যাডমিন বা মডারেটরদের প্রভাবিত করে না।';

 $helptxt['default_personal_text'] = 'একজন নতুন ব্যবহারকারীর &quot;ব্যক্তিগত পাঠ্য&quot; হিসেবে ডিফল্ট পাঠ্য সেট করে।  যখন ব্যক্তিগত পাঠ্য নিষ্ক্রিয় করা হয়, বা ব্যবহারকারীরা নিজেদের জন্য নিবন্ধনের জন্য ব্যক্তিগত পাঠ্য সেট করতে পারেন তখন এই সেটিংটি উপলব্ধ নয়৷';

 $helptxt['registration_method'] = 'এই সেটিংটি নির্ধারণ করে যে আপনার ফোরামে যোগদান করতে ইচ্ছুক ব্যক্তিদের জন্য নিবন্ধনের পদ্ধতি কী ব্যবহার করা হবে।  আপনি এখান থেকে নির্বাচন করতে পারেন:<br><br>
 	 <ul class="normallist">
 		 <li>
 			 <strong>নিবন্ধন নিষ্ক্রিয়</strong><br>
 				 নিবন্ধন প্রক্রিয়া নিষ্ক্রিয় করে, যার অর্থ হল আপনার ফোরামে যোগদানের জন্য কোনো নতুন সদস্য নিবন্ধন করতে পারবে না৷<br>
 		 </li><li>
 			 <strong>অবিলম্বে নিবন্ধন</strong><br>
 				 নতুন সদস্যরা আপনার ফোরামে নিবন্ধন করার সাথে সাথে লগইন করতে এবং পোস্ট করতে পারে৷<br>৷
 		 </li><li>
 			 <strong>ইমেল সক্রিয়করণ</strong><br>৷
 				 যখন এই সেটিংটি সক্ষম করা হয় তখন ফোরামে নিবন্ধন করা সদস্যদের একটি সক্রিয়করণ লিঙ্ক তাদের কাছে ইমেল করা হবে যেটিতে তাদের পূর্ণ সদস্য হওয়ার আগে ক্লিক করতে হবে।<br>
 		 </li><li>
 			 <strong>প্রশাসকের অনুমোদন</strong><br>৷
 				 এই সেটিংটি এটি তৈরি করবে যাতে আপনার ফোরামে নিবন্ধন করা সমস্ত নতুন সদস্য সদস্য হওয়ার আগে প্রশাসকের দ্বারা অনুমোদিত হতে হবে৷
 		 </li>
 	 </ul>';
 
 $helptxt['send_validation_onChange'] = 'যখন এই সেটিংটি চেক করা হয় যে সমস্ত সদস্যরা তাদের প্রোফাইলে তাদের ইমেল ঠিকানা পরিবর্তন করে তাদের সেই ঠিকানায় পাঠানো একটি ইমেল থেকে তাদের অ্যাকাউন্ট পুনরায় সক্রিয় করতে হবে';
 $helptxt['approveAccountDeletion'] = 'যখন এই সেটিংটি চেক করা হয়, তার নিজের অ্যাকাউন্ট মুছে ফেলার জন্য যেকোনো ব্যবহারকারীর অনুরোধ একজন প্রশাসকের দ্বারা অনুমোদিত হতে হবে';

 $helptxt['send_welcomeEmail'] = 'যখন এই সেটিংটি সক্ষম করা হয় তখন সমস্ত নতুন সদস্যদের আপনার সম্প্রদায়ে স্বাগত জানিয়ে একটি ইমেল পাঠানো হবে';
 $helptxt['password_strength'] = 'এই সেটিংটি আপনার ফোরাম ব্যবহারকারীদের দ্বারা নির্বাচিত পাসওয়ার্ডের জন্য প্রয়োজনীয় শক্তি নির্ধারণ করে।  পাসওয়ার্ড যত শক্তিশালী হবে, সদস্যদের অ্যাকাউন্টে আপস করা তত কঠিন হবে।
 	 এর সম্ভাব্য সেটিংস হল:
 	 <ul class="normallist">
 		 <li><strong>নিম্ন:</strong> পাসওয়ার্ডটি কমপক্ষে চারটি অক্ষরের হতে হবে৷</li>৷
 		 <li><strong>মাঝারি:</strong> পাসওয়ার্ডটি কমপক্ষে আট অক্ষরের হতে হবে এবং এটি কোনও ব্যবহারকারীর নাম বা ইমেল ঠিকানার অংশ হতে পারে না৷</li>
 		 <li><strong>উচ্চ:</strong> মাধ্যম হিসাবে, পাসওয়ার্ড ছাড়া অবশ্যই বড় এবং ছোট হাতের অক্ষরের মিশ্রণ এবং কমপক্ষে একটি সংখ্যা থাকতে হবে।</li>
 	 </ul>';
 $helptxt['enable_password_conversion'] = 'এই সেটিং সক্রিয় করার মাধ্যমে, SMF অন্যান্য ফরম্যাটে সংরক্ষিত পাসওয়ার্ড সনাক্ত করার চেষ্টা করবে এবং সেগুলিকে SMF ব্যবহার করা ফর্ম্যাটে রূপান্তর করবে৷  সাধারণত এটি SMF তে রূপান্তরিত ফোরামের জন্য ব্যবহৃত হয়, তবে এর অন্যান্য ব্যবহারও থাকতে পারে।  এটি নিষ্ক্রিয় করা একজন ব্যবহারকারীকে একটি রূপান্তরের পরে তাদের পাসওয়ার্ড ব্যবহার করে লগ ইন করতে বাধা দেয় এবং তাদের তাদের পাসওয়ার্ড পুনরায় সেট করতে হবে।';

 $helptxt['coppaAge'] = 'এই বাক্সে উল্লিখিত মানটি ফোরামে অবিলম্বে প্রবেশাধিকার পাওয়ার জন্য নতুন সদস্যদের ন্যূনতম বয়স নির্ধারণ করবে।
 	 নিবন্ধনের সময় তাদের এই বয়সের বেশি কিনা তা নিশ্চিত করতে বলা হবে, এবং যদি না হয় তবে তাদের আবেদন প্রত্যাখ্যান করা হবে বা পিতামাতার অনুমোদনের অপেক্ষায় স্থগিত করা হবে - নির্বাচিত বিধিনিষেধের ধরণের উপর নির্ভর করে।
 	 যদি এই সেটিংটির জন্য 0-এর একটি মান বেছে নেওয়া হয় তবে অন্যান্য সমস্ত বয়স সীমাবদ্ধতা সেটিংস উপেক্ষা করা হবে৷';
 $helptxt['coppaType'] = 'যদি বয়সের বিধিনিষেধ সক্ষম করা থাকে, তাহলে এই সেটিংটি নির্ধারণ করবে যে ন্যূনতম বয়সের নিচের কোনো ব্যবহারকারী আপনার ফোরামে নিবন্ধন করার চেষ্টা করলে কী ঘটবে৷  দুটি সম্ভাব্য পছন্দ আছে:
 	 <ul class="normallist">
 		 <li>
 			 <strong>তাদের নিবন্ধন প্রত্যাখ্যান করুন:</strong><br>
 				 ন্যূনতম বয়সের নিচে যেকোন নতুন সদস্যের নিবন্ধন অবিলম্বে বাতিল হয়ে যাবে।<br>
 		 </li><li>
 			 <strong>অভিভাবক/অভিভাবকের অনুমোদন প্রয়োজন</strong><br>
 				 যে কোনো নতুন সদস্য যারা নিবন্ধন করার চেষ্টা করে এবং ন্যূনতম অনুমোদিত বয়সের নিচে তাদের অ্যাকাউন্ট অনুমোদনের অপেক্ষায় চিহ্নিত করা হবে এবং একটি ফর্ম উপস্থাপন করা হবে যার উপর তাদের পিতামাতাকে অবশ্যই ফোরামের সদস্য হওয়ার অনুমতি দিতে হবে।
 				 তাদের সেটিংস পৃষ্ঠায় প্রবেশ করা ফোরামের যোগাযোগের বিবরণও উপস্থাপন করা হবে, যাতে তারা প্রশাসকের কাছে মেইল ​​বা ফ্যাক্সের মাধ্যমে ফর্মটি পাঠাতে পারে।
 		 </li>
 	 </ul>';
 $helptxt['coppaPost'] = 'যোগাযোগ বাক্সগুলি প্রয়োজন যাতে অপ্রাপ্তবয়স্কদের নিবন্ধনের অনুমতি প্রদানকারী ফর্মগুলি ফোরাম প্রশাসকের কাছে পাঠানো যায়৷  এই বিবরণগুলি সমস্ত নতুন নাবালকদের দেখানো হবে এবং পিতামাতা/অভিভাবকের অনুমোদনের জন্য প্রয়োজন৷  অন্তত একটি ডাক ঠিকানা বা ফ্যাক্স নম্বর অবশ্যই প্রদান করতে হবে।';
 
 $helptxt['allow_hideOnline'] = 'এই সেটিংটি সক্ষম করার মাধ্যমে সমস্ত সদস্য অন্যান্য ব্যবহারকারীদের থেকে তাদের অনলাইন স্থিতি লুকিয়ে রাখতে সক্ষম হবে (প্রশাসক ছাড়া)।  মনে রাখবেন যে এই সেটিংটি নিষ্ক্রিয় করা কোনো বিদ্যমান সদস্যের স্থিতি পরিবর্তন করবে না - এটি কেবল তাদের ভবিষ্যতে নিজেদের লুকিয়ে রাখা থেকে বিরত রাখে৷';
 $helptxt['meta_keywords'] = 'এই কীওয়ার্ডগুলি আপনার সাইটের মূল বিষয়বস্তু সার্চ ইঞ্জিনকে (ইত্যাদি) নির্দেশ করার জন্য প্রতিটি পৃষ্ঠার আউটপুটে পাঠানো হয়।  সেগুলি শব্দের একটি কমা দ্বারা বিভক্ত তালিকা হওয়া উচিত এবং HTML ব্যবহার করা উচিত নয়৷';

 $helptxt['latest_themes'] = 'এই এলাকাটি <a href="https://www.simplemachines.org/" target="_blank" rel="noopener">www থেকে সাম্প্রতিকতম এবং সবচেয়ে জনপ্রিয় থিমগুলির কয়েকটি দেখায়  .simplemachines.org</a>।  আপনার কম্পিউটার <a href="https://www.simplemachines.org/" target="_blank" rel="noopener">www.simplemachines.org</a> খুঁজে না পেলে এটি সঠিকভাবে প্রদর্শিত নাও হতে পারে  , যদিও।';

 $helptxt['secret_why_blank'] = 'আপনার নিরাপত্তার জন্য, আপনার পাসওয়ার্ড এবং আপনার গোপন প্রশ্নের উত্তর এনক্রিপ্ট করা হয়েছে যাতে SMF সফ্টওয়্যার আপনাকে বা অন্য কাউকে বলতে পারে না যে তারা কী।';
 $helptxt['moderator_why_missing'] = 'যেহেতু মডারেশন বোর্ড-বাই-বোর্ড ভিত্তিতে করা হয়, তাই আপনাকে <a href="%1$s?action=admin;area=manageboards" target= থেকে সদস্যদের মডারেটর করতে হবে  "_blank" rel="noopener">বোর্ড ম্যানেজমেন্ট ইন্টারফেস</a>।';

 $helptxt['permissions'] = 'অনুমতি হল আপনি কীভাবে গোষ্ঠীগুলিকে অনুমতি দেন বা নির্দিষ্ট কিছু করার জন্য গোষ্ঠীগুলিকে অস্বীকার করেন৷<br><br>আপনি চেকবক্সগুলির সাহায্যে একাধিক বোর্ড একবারে পরিবর্তন করতে পারেন, বা অনুমতিগুলি দেখতে পারেন৷  \'সংশোধন করুন।\' ক্লিক করে একটি নির্দিষ্ট গ্রুপ;
 $helptxt['permissions_board'] = 'যদি একটি বোর্ড \'Global\' সেট করা হয়, তাহলে এর অর্থ হল বোর্ডের কোনো বিশেষ অনুমতি থাকবে না।  \'স্থানীয়\' মানে এর নিজস্ব অনুমতি থাকবে - বিশ্বব্যাপী থেকে আলাদা।  এটি আপনাকে প্রতিটি বোর্ডের জন্য সেট করার প্রয়োজন ছাড়াই একটি বোর্ডের অনুমতি দেয় যার অন্যটির চেয়ে বেশি বা কম অনুমতি রয়েছে৷';
 $helptxt['permissions_quickgroups'] = 'এগুলি আপনাকে &quot;ডিফল্ট&quot;  অনুমতি সেটআপ - <em>মানক</em> মানে \'বিশেষ কিছু নেই\', <em>নিষেধমূলক</em> মানে \'অতিথির মতো\', <em>মডারেটর</em> মানে \'কী একজন মডারেটর  আছে\', এবং সবশেষে <em>রক্ষণাবেক্ষণ</em> মানে \'অনুমতি একজন প্রশাসকের খুব কাছাকাছি\'।';
 $helptxt['permissions_deny'] = 'অনুমতি অস্বীকার করা উপকারী হতে পারে যখন আপনি নির্দিষ্ট সদস্যদের কাছ থেকে অনুমতি কেড়ে নিতে চান।  আপনি যে সদস্যদের অনুমতি প্রত্যাখ্যান করতে চান তাদের \'অস্বীকার\'-অনুমতি সহ আপনি একটি সদস্যগোষ্ঠী যোগ করতে পারেন।<br><br><strong>সতর্কতার সাথে ব্যবহার করুন</strong>, অস্বীকৃত অনুমতি যা কিছুই থাকুক না কেন তা অস্বীকৃত থাকবে।  অন্যান্য সদস্য গোষ্ঠীতে সদস্য রয়েছে।';
 $helptxt['permissions_postgroups'] = 'পোস্টের সংখ্যার উপর ভিত্তি করে গোষ্ঠীগুলির জন্য অনুমতিগুলি সক্ষম করা হলে আপনি নির্দিষ্ট পরিমাণ বার্তা পোস্ট করেছেন এমন সদস্যদের অনুমতিগুলিকে বৈশিষ্ট্যযুক্ত করতে পারবেন৷  পোস্ট গণনা ভিত্তিক গোষ্ঠীগুলির অনুমতিগুলি নিয়মিত সদস্য গোষ্ঠীগুলির অনুমতিগুলিতে <em>যোগ করা হয়</em>৷';
 $helptxt['membergroup_guests'] = 'অতিথি সদস্যগোষ্ঠী এমন সব ব্যবহারকারীর জন্য যারা লগ ইন করেননি।';
 $helptxt['membergroup_regular_members'] = 'নিয়মিত সদস্যরা সকল সদস্য যারা লগইন করেছেন, কিন্তু যাদের কোনো প্রাথমিক সদস্যগোষ্ঠী নির্ধারিত নেই।';
 $helptxt['membergroup_administrator'] = 'প্রশাসক, সংজ্ঞা অনুসারে, যেকোনো কিছু করতে পারেন এবং যেকোনো বোর্ড দেখতে পারেন।  প্রশাসকের জন্য কোন অনুমতি সেটিংস নেই।';
 $helptxt['membergroup_moderator'] = 'মডারেটর মেম্বারগ্রুপ একটি বিশেষ সদস্য গ্রুপ।  এই গ্রুপের জন্য নির্ধারিত অনুমতি এবং সেটিংস মডারেটরদের জন্য প্রযোজ্য কিন্তু শুধুমাত্র <em>বোর্ডে তারা মডারেট করে</em>।  এই বোর্ডের বাইরে তারা অন্য সদস্যদের মতোই।  মনে রাখবেন যে এই গ্রুপের অনুমতিগুলি একটি বোর্ডকে নিয়ন্ত্রণ করার জন্য নির্ধারিত যে কোনও গ্রুপের জন্যও প্রযোজ্য।';
 $helptxt['membergroups'] = 'SMF-এ দুই ধরনের গ্রুপ আছে যেগুলোর অংশ হতে পারে আপনার সদস্যরা।  এগুলো হলঃ
 	 <ul class="normallist">
 		 <li><strong>নিয়মিত গোষ্ঠী:</strong> একটি নিয়মিত গোষ্ঠী হল এমন একটি গোষ্ঠী যেখানে সদস্যদের স্বয়ংক্রিয়ভাবে রাখা হয় না৷  একজন সদস্যকে একটি গ্রুপে থাকার জন্য বরাদ্দ করতে কেবল তাদের প্রোফাইলে যান এবং &quot;অ্যাকাউন্ট সেটিংস&quot; ক্লিক করুন।  এখান থেকে আপনি তাদের যেকোন সংখ্যক নিয়মিত গ্রুপ বরাদ্দ করতে পারেন যেখানে তারা অংশ হবে।</li>
 		 <li><strong>পোস্ট গ্রুপ:</strong> নিয়মিত গ্রুপের বিপরীতে পোস্ট ভিত্তিক গ্রুপ নিয়োগ করা যাবে না।  পরিবর্তে, সদস্যদের স্বয়ংক্রিয়ভাবে একটি পোস্ট ভিত্তিক গ্রুপে বরাদ্দ করা হয় যখন তারা সেই গ্রুপে থাকা প্রয়োজনীয় পোস্টের ন্যূনতম সংখ্যায় পৌঁছায়।</li>
 	 </ul>';

 $helptxt['calendar_how_edit'] = 'আপনি তাদের নামের পাশে লাল তারকাচিহ্ন (*) এ ক্লিক করে এই ইভেন্টগুলি সম্পাদনা করতে পারেন।';
 
 $helptxt['maintenance_backup'] = 'এই এলাকাটি আপনাকে আপনার ফোরামের সমস্ত পোস্ট, সেটিংস, সদস্য এবং অন্যান্য তথ্যের একটি অনুলিপি একটি খুব বড় ফাইলে সংরক্ষণ করতে দেয়৷<br><br>আপনি এটি করার পরামর্শ দেওয়া হচ্ছে  এটি প্রায়ই, সম্ভবত সাপ্তাহিক, নিরাপত্তা এবং নিরাপত্তার জন্য।';
 $helptxt['maintenance_rot'] = 'এটি আপনাকে <strong>সম্পূর্ণভাবে</strong> এবং <strong>অপরিবর্তনীয়ভাবে</strong> পুরানো বিষয়গুলিকে অপসারণ করতে দেয়৷  এটি সুপারিশ করা হয় যে আপনি প্রথমে একটি ব্যাকআপ নেওয়ার চেষ্টা করুন, যদি আপনি এমন কিছু মুছে ফেলতে চান যা আপনি চান না৷<br><br><strong>এই সেটিংটি যত্ন সহকারে ব্যবহার করুন৷</strong>';
 $helptxt['maintenance_members'] = 'এটি আপনাকে <strong>সম্পূর্ণরূপে</strong> এবং <strong>অপরিহার্যভাবে</strong> আপনার ফোরাম থেকে সদস্য অ্যাকাউন্টগুলি সরাতে দেয়৷  এটি <strong>অত্যন্ত</strong> বাঞ্ছনীয় যে আপনি প্রথমে একটি ব্যাকআপ নেওয়ার চেষ্টা করুন, যদি আপনি এমন কিছু মুছে ফেলতে চান যা আপনি চান না৷<br><br><strong>এই সেটিংটি যত্ন সহকারে ব্যবহার করুন৷<  </strong>';

 $helptxt['avatar_server_stored'] = 'এটি আপনার সদস্যদের আপনার সার্ভারে সঞ্চিত অবতার থেকে বেছে নিতে দেয়।  ডিফল্টরূপে এগুলি "অবতার" ডিরেক্টরিতে সংরক্ষিত থাকে৷<br>একটি পরামর্শ হিসাবে, আপনি যদি সেই ফোল্ডারে ডিরেক্টরি তৈরি করেন, আপনি অবতারগুলির "বিভাগ" করতে পারেন৷';
 $helptxt['avatar_external'] = 'এটি সক্ষম করে, আপনার সদস্যরা তাদের নিজস্ব অবতারে একটি URL টাইপ করতে পারে।  এর নেতিবাচক দিক হল, কিছু কিছু ক্ষেত্রে, তারা এমন অবতার ব্যবহার করতে পারে যা অত্যধিক বড় বা এমন ছবি তুলে ধরতে পারে যা আপনি আপনার ফোরামে চান না।';
 $helptxt['avatar_download_external'] = 'এই সেটিংটি সক্ষম করে, ব্যবহারকারীদের দেওয়া URL থেকে বাহ্যিক অবতারগুলি ডাউনলোড করা হবে৷  সফল হলে, অবতারদের আপলোড করা অবতারের মতোই গণ্য করা হবে।';
 $helptxt['avatar_action_too_large'] = 'এই সেটিং আপনাকে (অন্যান্য সাইট থেকে) ছবিগুলিকে প্রত্যাখ্যান করতে দেয় যেগুলি খুব বড়, অথবা ব্যবহারকারীর ব্রাউজারকে সেগুলির আকার পরিবর্তন করতে বা আপনার সার্ভারে ডাউনলোড করতে বলে৷<br><br  >যদি ব্যবহারকারীরা তাদের অবতার হিসাবে খুব বড় ইমেজ রাখে এবং ব্রাউজারে আকার পরিবর্তন করে, তবে এটি আপনার ব্যবহারকারীদের জন্য খুব ধীর গতিতে লোড হতে পারে - এটি আসলে ফাইলটির আকার পরিবর্তন করে না,  এটা শুধু এটা ছোট প্রদর্শন.  সুতরাং, উদাহরণস্বরূপ, একটি ডিজিটাল ফটো এখনও সম্পূর্ণভাবে লোড হবে এবং তারপরে শুধুমাত্র প্রদর্শিত হলেই আকার পরিবর্তন করা হবে - তাই ব্যবহারকারীদের জন্য এটি বেশ ধীর হতে পারে এবং প্রচুর ব্যান্ডউইথ ব্যবহার করতে পারে৷<br><br>অন্যদিকে, সেগুলি ডাউনলোড করার অর্থ হল  আপনার ব্যান্ডউইথ এবং সার্ভার স্পেস ব্যবহার করে, কিন্তু আপনি এটিও নিশ্চিত করেন যে ছবিগুলি ছোট, তাই এটি ব্যবহারকারীদের জন্য দ্রুত হওয়া উচিত।  (দ্রষ্টব্য: ডাউনলোড এবং আকার পরিবর্তনের জন্য হয় জিডি লাইব্রেরি বা ইমেজ ম্যাজিকের প্রয়োজন হয় ইমেজিক বা ম্যাজিকওয়ান্ড এক্সটেনশন ব্যবহার করে)';
 $helptxt['avatar_upload'] = 'এই সেটিংটি অনেকটা &quot;বহিরাগত অবতারের&quot; এর মত, আপনার অবতারগুলির উপর ভাল নিয়ন্ত্রণ, তাদের আকার পরিবর্তন করার একটি ভাল সময়, এবং আপনার সদস্যদের অবতার রাখার জন্য কোথাও থাকতে হবে না।<  br><br>তবে, খারাপ দিক হল এটি আপনার সার্ভারে অনেক জায়গা নিতে পারে।';
 $helptxt['avatar_download_png'] = 'PNG গুলি বড়, কিন্তু ভালো মানের কম্প্রেশন অফার করে।  যদি এটি আনচেক করা হয়, তবে এর পরিবর্তে JPEG ব্যবহার করা হবে - যা প্রায়শই ছোট, তবে কম বা ঝাপসা মানেরও হয়।';

 $helptxt['disableHostnameLookup'] = 'এটি হোস্ট নেম লুকআপগুলিকে নিষ্ক্রিয় করে, যা কিছু সার্ভারে খুব ধীর।  মনে রাখবেন যে এটি নিষেধাজ্ঞাকে কম কার্যকর করবে।';

 $helptxt['smiley_sameall'] = 'যদি "সমস্ত সেটের জন্য একই ছবি" চেক করা হয়, তাহলে আপনার সমস্ত স্মাইলি সেটে একই ছবি যোগ করা হবে।  আপনি বাক্সটি আনচেক করলে, প্রতিটি ইনস্টল করা স্মাইলি সেটের জন্য একটি ভিন্ন চিত্র আপলোড করা যেতে পারে।  মনে রাখবেন যে প্রতিটি স্মাইলি সেটের জন্য একটি ছবি প্রদান করা প্রয়োজন।';
 
 $helptxt['search_weight_frequency'] = 'অনুসন্ধান ফলাফলের প্রাসঙ্গিকতা নির্ধারণ করতে ওজনের উপাদান ব্যবহার করা হয়।  আপনার ফোরামের জন্য বিশেষভাবে গুরুত্বপূর্ণ জিনিসগুলির সাথে মেলে এই ওজনের কারণগুলি পরিবর্তন করুন।  উদাহরণস্বরূপ, একটি নিউজ সাইটের একটি ফোরাম, \'শেষ ম্যাচিং বার্তার বয়স\' এর জন্য তুলনামূলকভাবে উচ্চ মান চায়।  সমস্ত মান একে অপরের সাথে আপেক্ষিক এবং ধনাত্মক পূর্ণসংখ্যা হওয়া উচিত।<br><br>এই ফ্যাক্টরটি মিলে যাওয়া বার্তাগুলির পরিমাণ গণনা করে এবং একটি বিষয়ের মধ্যে বার্তাগুলির মোট সংখ্যা দ্বারা ভাগ করে।';
 $helptxt['search_weight_age'] = 'অনুসন্ধান ফলাফলের প্রাসঙ্গিকতা নির্ধারণ করতে ওজনের উপাদান ব্যবহার করা হয়।  আপনার ফোরামের জন্য বিশেষভাবে গুরুত্বপূর্ণ জিনিসগুলির সাথে মেলে এই ওজনের কারণগুলি পরিবর্তন করুন।  উদাহরণস্বরূপ, একটি নিউজ সাইটের একটি ফোরাম, \'শেষ ম্যাচিং বার্তার বয়স\' এর জন্য তুলনামূলকভাবে উচ্চ মান চায়।  সমস্ত মান একে অপরের সাথে সম্পর্কযুক্ত এবং ধনাত্মক পূর্ণসংখ্যা হওয়া উচিত।<br><br>এই ফ্যাক্টরটি একটি বিষয়ের মধ্যে শেষ মিলিত বার্তার বয়সকে রেট করে।  এই বার্তাটি যত সাম্প্রতিক, স্কোর তত বেশি।';
 $helptxt['search_weight_length'] = 'অনুসন্ধান ফলাফলের প্রাসঙ্গিকতা নির্ধারণ করতে ওজনের উপাদান ব্যবহার করা হয়।  আপনার ফোরামের জন্য বিশেষভাবে গুরুত্বপূর্ণ জিনিসগুলির সাথে মেলে এই ওজনের কারণগুলি পরিবর্তন করুন।  উদাহরণস্বরূপ, একটি নিউজ সাইটের একটি ফোরাম, \'শেষ ম্যাচিং বার্তার বয়স\' এর জন্য তুলনামূলকভাবে উচ্চ মান চায়।  সমস্ত মান একে অপরের সাথে সম্পর্কিত এবং ধনাত্মক পূর্ণসংখ্যা হওয়া উচিত।<br><br>এই ফ্যাক্টরটি বিষয়ের আকারের উপর ভিত্তি করে।  বিষয়ের মধ্যে যত বেশি বার্তা থাকবে, স্কোর তত বেশি হবে।';
 $helptxt['search_weight_subject'] = 'অনুসন্ধান ফলাফলের প্রাসঙ্গিকতা নির্ধারণ করতে ওজনের উপাদান ব্যবহার করা হয়।  আপনার ফোরামের জন্য বিশেষভাবে গুরুত্বপূর্ণ জিনিসগুলির সাথে মেলে এই ওজনের কারণগুলি পরিবর্তন করুন।  উদাহরণস্বরূপ, একটি নিউজ সাইটের একটি ফোরাম, \'শেষ ম্যাচিং বার্তার বয়স\' এর জন্য তুলনামূলকভাবে উচ্চ মান চায়।  সমস্ত মান একে অপরের সাথে সম্পর্কিত এবং ধনাত্মক পূর্ণসংখ্যা হওয়া উচিত।<br><br>এই ফ্যাক্টরটি একটি বিষয়ের বিষয়ের মধ্যে একটি অনুসন্ধান শব্দ পাওয়া যাবে কিনা তা দেখায়।';
 $helptxt['search_weight_first_message'] = 'অনুসন্ধান ফলাফলের প্রাসঙ্গিকতা নির্ধারণ করতে ওজনের উপাদান ব্যবহার করা হয়।  আপনার ফোরামের জন্য বিশেষভাবে গুরুত্বপূর্ণ জিনিসগুলির সাথে মেলে এই ওজনের কারণগুলি পরিবর্তন করুন।  উদাহরণস্বরূপ, একটি নিউজ সাইটের একটি ফোরাম, \'শেষ ম্যাচিং বার্তার বয়স\' এর জন্য তুলনামূলকভাবে উচ্চ মান চায়।  সমস্ত মান একে অপরের সাথে সম্পর্কিত এবং ধনাত্মক পূর্ণসংখ্যা হওয়া উচিত।<br><br>এই ফ্যাক্টরটি একটি বিষয়ের প্রথম বার্তায় একটি মিল খুঁজে পাওয়া যায় কিনা তা দেখায়।';
 $helptxt['search_weight_sticky'] = 'অনুসন্ধান ফলাফলের প্রাসঙ্গিকতা নির্ধারণ করতে ওজনের উপাদান ব্যবহার করা হয়।  আপনার ফোরামের জন্য বিশেষভাবে গুরুত্বপূর্ণ জিনিসগুলির সাথে মেলে এই ওজনের কারণগুলি পরিবর্তন করুন।  উদাহরণস্বরূপ, একটি নিউজ সাইটের একটি ফোরাম, \'শেষ ম্যাচিং বার্তার বয়স\' এর জন্য তুলনামূলকভাবে উচ্চ মান চায়।  সমস্ত মান একে অপরের সাথে আপেক্ষিক এবং ধনাত্মক পূর্ণসংখ্যা হওয়া উচিত।<br><br>এই ফ্যাক্টরটি একটি বিষয় স্টিকি কিনা তা দেখায় এবং যদি এটি প্রাসঙ্গিকতা স্কোর বৃদ্ধি করে।';
 $helptxt['search'] = 'এখানে অনুসন্ধান ফাংশনের জন্য সমস্ত সেটিংস সামঞ্জস্য করুন।';
 $helptxt['search_why_use_index'] = 'একটি সার্চ ইনডেক্স আপনার ফোরামে সার্চের পারফরম্যান্সকে ব্যাপকভাবে উন্নত করতে পারে।  বিশেষ করে যখন একটি ফোরামে বার্তার সংখ্যা বেড়ে যায়, একটি সূচী ছাড়াই অনুসন্ধান করা দীর্ঘ সময় নিতে পারে এবং আপনার ডাটাবেসের উপর চাপ বাড়াতে পারে৷  যদি আপনার ফোরামটি 50.000 বার্তার চেয়ে বড় হয়, তাহলে আপনি আপনার ফোরামের সর্বোচ্চ কার্যক্ষমতা নিশ্চিত করতে একটি অনুসন্ধান সূচক তৈরি করার কথা বিবেচনা করতে পারেন৷<br><br>মনে রাখবেন যে একটি অনুসন্ধান সূচক বেশ কিছু জায়গা নিতে পারে৷  একটি ফুলটেক্সট সূচক হল MySQL এবং PostgreSQL-এর অন্তর্নির্মিত সূচক।  এটি তুলনামূলকভাবে কমপ্যাক্ট (প্রায় বার্তা টেবিলের সমান), কিন্তু অনেক শব্দ ইন্ডেক্স করা হয় না এবং কিছু সার্চ কোয়েরিতে এটি খুব ধীর হতে পারে।  কাস্টম সূচকটি প্রায়শই বড় হয় (আপনার কনফিগারেশনের উপর নির্ভর করে এটি বার্তা টেবিলের আকারের 3 গুণ পর্যন্ত হতে পারে) তবে এটির কার্যকারিতা ফুলটেক্সট থেকে ভাল এবং তুলনামূলকভাবে স্থিতিশীল।';

 $helptxt['see_admin_ip'] = 'আইপি ঠিকানাগুলি অ্যাডমিনিস্ট্রেটর এবং মডারেটরদের দেখানো হয় যাতে মডারেশন সহজতর হয় এবং লোকেদের ট্র্যাক করা সহজ হয়।  মনে রাখবেন যে আইপি ঠিকানাগুলি সর্বদা সনাক্ত নাও হতে পারে, এবং বেশিরভাগ লোকের আইপি ঠিকানাগুলি পর্যায়ক্রমে পরিবর্তিত হয়৷<br><br>সদস্যদেরও তাদের নিজস্ব আইপি দেখার অনুমতি দেওয়া হয়৷';
 $helptxt['see_member_ip'] = 'আপনার IP ঠিকানা শুধুমাত্র আপনাকে এবং মডারেটরদের দেখানো হয়।  মনে রাখবেন যে এই তথ্যটি সনাক্ত করা যাচ্ছে না, এবং বেশিরভাগ আইপি পর্যায়ক্রমে পরিবর্তিত হয়।<br><br>আপনি অন্য সদস্যদের আইপি ঠিকানা দেখতে পারবেন না এবং তারা আপনার ঠিকানা দেখতে পারবেন না।';
 $helptxt['whytwoip'] = 'এসএমএফ ব্যবহারকারীর আইপি ঠিকানা সনাক্ত করতে বিভিন্ন পদ্ধতি ব্যবহার করে।  সাধারণত এই দুটি পদ্ধতির ফলে একই ঠিকানা হয় তবে কিছু ক্ষেত্রে একাধিক ঠিকানা সনাক্ত করা যেতে পারে।  এই ক্ষেত্রে SMF দুটি অতি সাম্প্রতিক ঠিকানা লগ করে, এবং উভয়ই ব্যান চেকের (ইত্যাদি) জন্য ব্যবহার করে।  আপনি যে আইপি ট্র্যাক করতে এবং প্রয়োজনে নিষিদ্ধ করতে যেকোন ঠিকানায় ক্লিক করতে পারেন।';
 
 $helptxt['ban_cannot_post'] = '\'পোস্ট করা যাবে না\' বিধিনিষেধটি নিষিদ্ধ ব্যবহারকারীর জন্য ফোরামটিকে শুধুমাত্র-পঠন মোডে পরিণত করে।  ব্যবহারকারী নতুন বিষয় তৈরি করতে পারবেন না, বা বিদ্যমান বিষয়গুলির উত্তর দিতে পারবেন না, ব্যক্তিগত বার্তা পাঠাতে পারবেন না বা ভোটে ভোট দিতে পারবেন না।  নিষিদ্ধ ব্যবহারকারী যদিও এখনও ব্যক্তিগত বার্তা এবং বিষয়গুলি পড়তে পারেন৷<br><br>এইভাবে নিষিদ্ধ ব্যবহারকারীদের একটি সতর্ক বার্তা দেখানো হয়৷';

 $helptxt['posts_and_topics'] = '
 	 <ul class="normallist">
 		 <li>
 			 <strong>পোস্ট সেটিংস</strong><br>৷
 			 বার্তা পোস্ট করার সাথে সম্পর্কিত সেটিংস এবং বার্তাগুলি দেখানোর উপায় পরিবর্তন করুন৷  আপনি এখানে বানান পরীক্ষাও সক্ষম করতে পারেন।
 		 </li><li>
 			 <strong>বুলেটিন বোর্ড কোড</strong><br>
 			 সঠিক লেআউটে ফোরাম বার্তাগুলি দেখায় এমন কোডটি সক্ষম করুন৷  কোন কোডগুলি অনুমোদিত এবং কোনটি নয় তাও সামঞ্জস্য করুন৷
 		 </li><li>
 			 <strong>সেন্সর করা শব্দ</strong>
 			 আপনার ফোরামে ভাষা নিয়ন্ত্রণে রাখার জন্য, আপনি কিছু শব্দ সেন্সর করতে পারেন।  এই ফাংশনটি আপনাকে নিষিদ্ধ শব্দগুলিকে নির্দোষ সংস্করণে রূপান্তর করতে দেয়।
 		 </li><li>
 			 <strong>বিষয় সেটিংস</strong>
 			 বিষয় সম্পর্কিত সেটিংস পরিবর্তন করুন।  প্রতি পৃষ্ঠায় বিষয়ের সংখ্যা, প্রিন্ট-পৃষ্ঠা দৃশ্য সক্ষম করা আছে কিনা ইত্যাদি।
 		 </li>
 	 </ul>';

 $helptxt['spider_mode'] = 'লগিং লেভেল সেট করে।<br>
 স্ট্যান্ডার্ড - ন্যূনতম মাকড়সার কার্যকলাপ লগ করে৷<br>৷
 মধ্যপন্থী - আরো সঠিক পরিসংখ্যান প্রদান করে৷<br>৷
 আক্রমনাত্মক - &quot;মডারেট&quot; এর মতোই, কিন্তু পরিদর্শন করা প্রতিটি পৃষ্ঠার ডেটা লগ করে।';

 $helptxt['spider_group'] = 'একটি সীমাবদ্ধ গোষ্ঠী নির্বাচন করার মাধ্যমে, যখন একজন অতিথিকে অনুসন্ধান ক্রলার হিসাবে সনাক্ত করা হয় তখন এটি স্বয়ংক্রিয়ভাবে যে কোনও &quot;অস্বীকার করুন&quot;  অতিথির স্বাভাবিক অনুমতির পাশাপাশি এই গ্রুপের অনুমতি।  আপনি একজন সাধারণ অতিথির চেয়ে সার্চ ইঞ্জিনে কম অ্যাক্সেস প্রদান করতে এটি ব্যবহার করতে পারেন।  আপনি উদাহরণস্বরূপ "স্পাইডার্স" নামে একটি নতুন গ্রুপ তৈরি করতে চাইতে পারেন;  এবং এটি এখানে নির্বাচন করুন।  তারপরে আপনি আপনার সদস্যদের প্রোফাইলগুলিকে মাকড়সা সূচীকরণ বন্ধ করার জন্য প্রোফাইলগুলি দেখার জন্য সেই গোষ্ঠীর অনুমতি অস্বীকার করতে পারেন৷<br>দ্রষ্টব্য: মাকড়সা সনাক্তকরণ নিখুঁত নয় এবং ব্যবহারকারীদের দ্বারা অনুকরণ করা যেতে পারে তাই এই বৈশিষ্ট্যটি কেবলমাত্র সেই সার্চ ইঞ্জিনগুলিতে আপনার বিষয়বস্তু সীমাবদ্ধ করার গ্যারান্টি দেওয়া হয় না  যোগ করেছি।';
 $helptxt['show_spider_online'] = 'এই সেটিং আপনাকে মাকড়সাকে ​​&quot;কার অনলাইন&quot; তালিকায় তালিকাভুক্ত করা উচিত কিনা তা নির্বাচন করতে দেয়।  বোর্ড সূচকে তালিকা এবং &quot;কে অনলাইন&quot;  পৃষ্ঠা  বিকল্পগুলি হল:
 	 <ul class="normallist">
 		 <li>
 			 <strong>মোটেই না</strong><br>
 			 মাকড়সা কেবলমাত্র সমস্ত ব্যবহারকারীর কাছে অতিথি হিসাবে উপস্থিত হবে।
 		 </li><li>
 			 <strong>মাকড়সার পরিমাণ দেখান</strong><br>
 			 বোর্ড সূচক বর্তমানে ফোরামে আসা মাকড়সার সংখ্যা প্রদর্শন করবে।
 		 </li><li>
 			 <strong>মাকড়সার নাম দেখান</strong><br>
 			 প্রতিটি মাকড়সার নাম প্রকাশ করা হবে, যাতে ব্যবহারকারীরা দেখতে পারেন যে প্রতিটি মাকড়সার কতজন বর্তমানে ফোরামে আসছেন - এটি বোর্ড সূচক এবং কার অনলাইন পৃষ্ঠা উভয় ক্ষেত্রেই কার্যকর হবে৷
 		 </li><li>
 			 <strong>মাকড়সার নাম দেখান - শুধুমাত্র অ্যাডমিন</strong><br>
 			 উপরের হিসাবে শুধুমাত্র অ্যাডমিনিস্ট্রেটররা স্পাইডার স্ট্যাটাস দেখতে পারেন - অন্য সমস্ত ব্যবহারকারীদের কাছে মাকড়সা অতিথি হিসাবে উপস্থিত হয়।
 		 </li>
 	 </ul>';

 $helptxt['birthday_email'] = 'ব্যবহার করার জন্য জন্মদিনের ইমেল বার্তাটির সূচী বেছে নিন।  ইমেল বিষয় এবং ইমেল বডি ক্ষেত্রগুলিতে একটি পূর্বরূপ দেখানো হবে৷<br><strong>দ্রষ্টব্য:</strong> এই সেটিংটি নির্বাচন করা জন্মদিনের ইমেলগুলি স্বয়ংক্রিয়ভাবে সক্ষম করে না৷  জন্মদিনের ইমেলগুলি সক্ষম করতে <a href="%1$s?action=admin;area=scheduledtasks;%3$s=%2$s" target="_blank" rel="noopener">নির্ধারিত কার্যগুলি</a ব্যবহার করুন  > পৃষ্ঠা এবং জন্মদিনের ইমেল টাস্ক সক্ষম করুন।';
 $helptxt['pm_bcc'] = 'একটি ব্যক্তিগত বার্তা পাঠানোর সময় আপনি BCC (ব্লাইন্ড কার্বন কপি) হিসাবে একজন প্রাপককে যুক্ত করতে বেছে নিতে পারেন।  BCC প্রাপকদের বার্তার অন্যান্য প্রাপকদের কাছে তাদের পরিচয় প্রকাশ করা হয় না।';
 
 $helptxt['move_topics_maintenance'] = 'এটি আপনাকে একটি বোর্ড থেকে অন্য বোর্ডে সমস্ত পোস্ট সরানোর অনুমতি দেবে।';
 $helptxt['maintain_reattribute_posts'] = 'আপনি এই ফাংশনটি ব্যবহার করে আপনার বোর্ডের গেস্ট পোস্টগুলিকে নিবন্ধিত সদস্যের কাছে অ্যাট্রিবিউট করতে পারেন৷  এটি কার্যকর যদি, উদাহরণস্বরূপ, একজন ব্যবহারকারী তাদের অ্যাকাউন্ট মুছে ফেলেন এবং তাদের মন পরিবর্তন করেন এবং তাদের অ্যাকাউন্টের সাথে তাদের পুরানো পোস্টগুলি যুক্ত করতে চান৷';
 $helptxt['chmod_flags'] = 'আপনি নির্বাচিত ফাইল সেট করতে চান এমন অনুমতি ম্যানুয়ালি সেট করতে পারেন।  এটি করার জন্য একটি সংখ্যাসূচক (অক্টেট) মান হিসাবে chmod মান লিখুন।  দ্রষ্টব্য - মাইক্রোসফ্ট উইন্ডোজ অপারেটিং সিস্টেমে এই পতাকাগুলির কোন প্রভাব থাকবে না৷';

 $helptxt['postmod'] = 'এই পৃষ্ঠাটি মডারেশন টিমের সদস্যদের (পর্যাপ্ত অনুমতি সহ) যেকোনো পোস্ট এবং বিষয় দেখানোর আগে অনুমোদন করতে দেয়।';

 $helptxt['field_show_enclosed'] = 'কিছু পাঠ্য বা এইচটিএমএল এর মধ্যে ব্যবহারকারীর ইনপুট আবদ্ধ করে।  এটি আপনাকে আরও তাত্ক্ষণিক বার্তা প্রদানকারী, ছবি বা একটি এম্বেড ইত্যাদি যোগ করার অনুমতি দেবে। উদাহরণস্বরূপ:<br><br>
 		 &lt;a href="https://example.com/{INPUT}"&gt;&lt;img src="{DEFAULT_IMAGES_URL}/icon.png" alt="{INPUT}" /&gt;&lt;/a&gt;<  br><br>
 		 মনে রাখবেন যে আপনি নিম্নলিখিত ভেরিয়েবলগুলি ব্যবহার করতে পারেন:<br>
 		 <ul class="normallist">
 			 <li>{INPUT} - ব্যবহারকারীর দ্বারা নির্দিষ্ট করা ইনপুট৷</li>৷
 			 <li>{SCRIPTURL} - ফোরামের ওয়েব ঠিকানা।</li>
 			 <li>{IMAGES_URL} - ব্যবহারকারীদের বর্তমান থিমে চিত্র ডিরেক্টরির URL৷</li>৷
 			 <li>{DEFAULT_IMAGES_URL} - ডিফল্ট থিমে ইমেজ ডিরেক্টরির URL।</li>
 			 <li>{KEY} - যখন একটি ক্ষেত্রে একাধিক বিকল্প থাকে তখন ব্যবহৃত হয়, এটি সনাক্ত করতে ব্যবহৃত অনন্য সংখ্যাসূচক ID।</li>
 		 </ul>';

 $helptxt['custom_mask'] = 'ইনপুট মাস্ক আপনার ফোরামের নিরাপত্তার জন্য গুরুত্বপূর্ণ।  ব্যবহারকারীর কাছ থেকে ইনপুট যাচাই করা নিশ্চিত করতে সাহায্য করতে পারে যে ডেটা এমনভাবে ব্যবহার করা হয় না যা আপনি আশা করেন না।  আমরা ইঙ্গিত হিসাবে কিছু সহজ রেগুলার এক্সপ্রেশন প্রদান করেছি।<br><br>
     প্যাটার্নের শুরু এবং শেষ চিহ্নিত করা ডিলিমিটার প্রয়োজন!  নিচের উদাহরণে এগুলি হল টিল্ডস (~)৷<br><br>৷
 	 <div class="smalltext" style="margin: 0 2em">
 		 &quot;~[A-Za-z]+~&quot;  - সমস্ত বড় এবং ছোট হাতের বর্ণমালার অক্ষর মেলে৷<br>৷
 		 &quot;~[0-9]+~&quot;  - সমস্ত সাংখ্যিক অক্ষর মিলান৷<br>৷
 		 &quot;~[A-Za-z0-9]{7}~&quot;  - সমস্ত বড় এবং ছোট হাতের বর্ণমালা এবং সাংখ্যিক অক্ষর সাতবার মিলিয়ে নিন।<br>
 		 &quot;~[^0-9]?~&quot;  - যেকোন সংখ্যার মিল হওয়া থেকে নিষেধ করুন৷<br>৷
 		 &quot;~^([A-Fa-f0-9]{3}|[A-Fa-f0-9]{6})$~&quot;  - শুধুমাত্র 3 বা 6 অক্ষরের হেক্সকোডের অনুমতি দিন৷<br>৷
 	 </div><br><br>
 	 উপরন্তু, বিশেষ মেটা অক্ষর?+*^$ এবং {xx} সংজ্ঞায়িত করা যেতে পারে।
 	 <div class="smalltext" style="margin: 0 2em">
 		 ?  - পূর্ববর্তী অভিব্যক্তির কোনটি বা একটি মিল৷<br>৷
 		 + - এক বা একাধিক পূর্ববর্তী অভিব্যক্তি।<br>
 		 * - পূর্ববর্তী অভিব্যক্তির কোনটি বা তার বেশি৷<br>৷
 		 {xx} - আগের রাশি থেকে একটি সঠিক সংখ্যা৷<br>৷
 		 {xx,} - আগের রাশি থেকে একটি সঠিক সংখ্যা বা তার বেশি।<br>
 		 {,xx} - আগের রাশি থেকে একটি সঠিক সংখ্যা বা কম৷<br>৷
 		 {xx,yy} - আগের রাশি থেকে দুটি সংখ্যার মধ্যে একটি সঠিক মিল৷<br>৷
 		 ^ - স্ট্রিং এর শুরু।<br>
 		 $ - স্ট্রিং এর শেষ।<br>
 		 \ - পরবর্তী অক্ষর থেকে পালিয়ে যায়৷<br>৷
 	 </div><br><br>
 	 ইন্টারনেটে আরও তথ্য এবং উন্নত কৌশল পাওয়া যেতে পারে।';

 $helptxt['topic_move_any'] = 'যদি চেক করা থাকে, ব্যবহারকারীরা দেখতে পাবে এমন যেকোনো বোর্ডে বিষয়গুলি সরানোর অনুমতি দেওয়া হবে৷  অন্যথায়, তারা শুধুমাত্র তাদের বোর্ডে স্থানান্তর করতে সক্ষম হবে যেখানে তারা নতুন বিষয় পোস্ট করতে পারবে।';

 $helptxt['alert_pm_new'] = 'নতুন ব্যক্তিগত বার্তাগুলির বিজ্ঞপ্তিগুলি সতর্কতা ফলকে প্রদর্শিত হয় না, তবে পরিবর্তে "আমার বার্তা" তালিকায় উপস্থিত হয়৷';
 $helptxt['alert_event_new'] = 'একটি নতুন ক্যালেন্ডার ইভেন্ট যোগ করা হলে এটি অনুরোধ অনুযায়ী একটি সতর্কতা বা ইমেল পাঠাবে।  যাইহোক, যদি সেই ইভেন্টটি পোস্ট করা হয় এবং একটি বিষয় যুক্ত করা হয়, আপনি যদি ইতিমধ্যেই সেই বোর্ডটিকে অনুসরণ করেন তবে আপনি ইভেন্টের জন্য একটি সতর্কতা পাবেন না - বোর্ড অনুসরণ করার সতর্কতা এটিকে কভার করবে৷';
 
 $helptxt['force_ssl'] = '<strong>এটি সক্ষম করার আগে আপনার সার্ভারে সঠিকভাবে SSL এবং HTTPS পরীক্ষা করুন, এটি আপনার ফোরামকে অ্যাক্সেসযোগ্য করে তুলতে পারে।</strong> আপনি যদি সক্ষম করার পরে ফোরাম অ্যাক্সেস করতে না পারেন তবে রক্ষণাবেক্ষণ মোড সক্ষম করুন  এটি৷<br><br><strong>এই সেটিংটি পরিবর্তন করা হলে তা আপনার ফোরামের প্রাথমিক URL আপডেট করবে, সেইসাথে আপনার থিম ফাইল এবং ছবি, স্মাইলি এবং অবতারগুলির URLগুলিকে http: বা https:-তে সেট করবে৷  আপনার নির্বাচনের উপর ভিত্তি করে।  কাস্টমাইজড ইউআরএল প্রভাবিত হবে না৷</strong>';
 $helptxt['image_proxy_enabled'] = 'সম্পূর্ণ SSL এ থাকা অবস্থায় বহিরাগত ছবি এম্বেড করার জন্য প্রয়োজনীয়';
 $helptxt['image_proxy_secret'] = 'এটি গোপন রাখুন, হটলিংক করা ছবি থেকে আপনার ফোরামকে রক্ষা করে।  বর্তমান হটলিংক করা ছবিগুলিকে অকেজো করার জন্য এটি পরিবর্তন করুন';
 $helptxt['image_proxy_maxsize'] = 'সর্বোচ্চ ইমেজ সাইজ যা SSL ইমেজ প্রক্সি ক্যাশে করবে: বড় ছবি ক্যাশে করা হবে না।  ক্যাশে করা ছবিগুলি আপনার SMF ক্যাশে ফোল্ডারে সংরক্ষণ করা হয়, তাই নিশ্চিত করুন যে আপনার পর্যাপ্ত ফাঁকা জায়গা আছে।';

 $helptxt['enable_sm_stats'] = 'সক্রিয় থাকলে, এটি সাধারণ মেশিনগুলিকে মৌলিক পরিসংখ্যান সংগ্রহ করতে মাসে একবার আপনার সাইট দেখার অনুমতি দেবে৷  এটি কোন কনফিগারেশনের জন্য সফ্টওয়্যারটিকে অপ্টিমাইজ করতে হবে সে বিষয়ে সিদ্ধান্ত নিতে আমাদের সাহায্য করবে৷  আরও তথ্যের জন্য অনুগ্রহ করে আমাদের <a href="https://www.simplemachines.org/about/stats.php" target="_blank" rel="noopener">তথ্য পৃষ্ঠা</a> দেখুন।';

 $helptxt['field_reg_require'] = 'রেজিস্ট্রেশনের সময় যদি এই ক্ষেত্রটির প্রয়োজন হয়, তবে প্রোফাইল পরিবর্তনের ক্ষেত্রেও এটির প্রয়োজন হবে।';

 $helptxt['translatable_fields'] = 'আপনি যদি আপনার কাস্টম প্রোফাইল ফিল্ডের জন্য বহু-ভাষা সমর্থন দিতে চান তবে নাম এবং বিবরণ উভয় ক্ষেত্রেই অনুবাদযোগ্য টোকেন ব্যবহার করতে পারেন।<br><br>
 ধনুর্বন্ধনী <span class="monospace">{}</span> দিয়ে আবদ্ধ যেকোন কিছুকে একটি টোকেন হিসাবে বিবেচনা করা হবে এবং একটি $txt স্ট্রিং এর সাথে মিলিত হবে৷  উদাহরণস্বরূপ, টোকেন <span class="monospace">{gender}</span> $txt[\'gender\']<br><br> এর মান দ্বারা প্রতিস্থাপিত হবে
 বর্তমানে ইনস্টল করা <strong>সমস্ত</strong> ভাষায় মিলিত $txt স্ট্রিং যোগ করা <strong>খুব গুরুত্বপূর্ণ</strong>।  এটি করতে, <a href="%1$s?action=admin;area=languages;sa=edit;%3$s=%2$s" class="bbc_link" target="_blank" rel-এ যান  ="noopener">ভাষা সম্পাদনা করুন</a> পৃষ্ঠা এবং প্রতিটি ইনস্টল করা ভাষার জন্য নিম্নলিখিত পদক্ষেপগুলি সম্পূর্ণ করুন:
 <ol class="bbc_list" style="list-style-type: decimal">
 	 <li>ভাষার নামের পাশে "সম্পাদনা" বোতামে ক্লিক করুন।</li>
 	 <li>"সম্পাদনা করার জন্য এন্ট্রি নির্বাচন করুন" মেনুতে, "পরিবর্তন" নির্বাচন করুন।</li>
 	 <li>নীচে স্ক্রোল করুন এবং "অন্য আইটেম যোগ করুন" বোতামে ক্লিক করুন।</li>
 	 <li>আপনার নতুন স্ট্রিং যোগ করার জন্য প্রম্পটগুলি অনুসরণ করুন৷</li>৷
 </ol>';
 
 // যুক্তি(গুলি): $boarddir, $boardurl
 $helptxt['cron_is_real_cron'] = 'ডিফল্টরূপে, SMF প্রতিটি পৃষ্ঠায় জাভাস্ক্রিপ্টের একটি ছোট অংশ যোগ করে যা ব্যবহারকারীর ব্রাউজারকে SMF এর cron.php পটভূমিতে ট্রিগার করতে অনুরোধ করে।  এই পদ্ধতিটি SMF কে প্রশাসককে কোন অতিরিক্ত সার্ভার কনফিগারেশন করার প্রয়োজন ছাড়াই নিয়মিতভাবে তার নির্ধারিত কাজগুলি সম্পাদন করতে দেয়।  যাইহোক, কিছু অ্যাডমিন তাদের সার্ভারগুলিকে নিয়মিতভাবে সরাসরি cron.php চালানোর জন্য কনফিগার করতে পছন্দ করতে পারে।  আপনি যদি এটি করে থাকেন তবে আপনি জাভাস্ক্রিপ্ট পদ্ধতিটি নিষ্ক্রিয় করতে পারেন৷<br><br><strong>দ্রষ্টব্য:</strong> আপনার সার্ভারকে এইভাবে নির্ধারিত কাজগুলি চালানোর জন্য কনফিগার করা SMF এর মধ্যে থেকে করা যাবে না৷  এটি করার জন্য আপনাকে আপনার সার্ভার কনফিগারেশন সফ্টওয়্যার ব্যবহার করতে হবে।  এই উদ্দেশ্যে সাধারণ সরঞ্জামগুলির মধ্যে রয়েছে <code>cron</code> (লিনাক্স সার্ভারের জন্য), <code>schtasks.exe</code> (উইন্ডোজ সার্ভারের জন্য), এবং <code>লঞ্চড</code> (macOS সার্ভারের জন্য)  .  বেশিরভাগ ওয়েব হোস্টিং কোম্পানিগুলি তাদের গ্রাহকদের এই সরঞ্জামগুলি অ্যাক্সেস করার অনুমতি দেওয়ার জন্য কিছু ধরণের নিয়ন্ত্রণ প্যানেল ইন্টারফেস প্রদান করে৷<br><br>আপনার ফোরামের cron.php এর পাথ এবং URL হল:<br>পথ: %1$s  /cron.php<br>URL: %2$s/cron.php';

 $helptxt['languages_txt'] = 'এসএমএফ জুড়ে এই ভাষা এন্ট্রিগুলি ব্যবহার করা হয় বিভিন্ন ভাষার জন্য পাঠ্যের স্থানীয় সংস্করণ সংজ্ঞায়িত করার জন্য।<br><br>যদি আপনি <code>&#37;1$s</ এর মত একটি মান দেখতে পান  কোড> একটি এন্ট্রিতে, এটি একটি স্থানধারক যা SMF রানটাইমে একটি বাস্তব মান দিয়ে পূরণ করে।  আপনার কাস্টমাইজড টেক্সটে এই ধরনের স্থানধারক রাখা নিশ্চিত করুন।';
 $helptxt['languages_helptxt'] = 'এই ভাষা এন্ট্রিগুলি ফ্লোটিং হেল্প টেক্সট পপআপ দেখানোর জন্য ব্যবহার করা হয় (এটির মতো)';
 $helptxt['languages_editortxt'] = 'এই ভাষা এন্ট্রিগুলি পোস্ট এডিটরে ইউজার ইন্টারফেস উপাদানের জন্য ব্যবহার করা হয়।';
 $helptxt['languages_tztxt'] = 'এই ভাষা এন্ট্রিগুলি টাইম জোনের জন্য বর্ণনা তৈরি করতে ব্যবহার করা হয়৷<br><br>উদাহরণস্বরূপ, <code>Europe_Western</code> স্ট্রিংটি <code>daylight_saving_time_false< এর সাথে মিলিত হতে পারে  "ওয়েস্টার্ন ইউরোপিয়ান স্ট্যান্ডার্ড টাইম" তৈরি করতে স্ট্রিং  সময় অঞ্চল, SMF সেই সময় অঞ্চলের মধ্যে অবস্থানগুলির একটি তালিকা ব্যবহার করে একটি বিবরণ তৈরি করবে৷';
 $helptxt['languages_txt_for_timezones'] = 'এই ভাষার এন্ট্রিগুলি আপনাকে নিম্নলিখিতগুলি করতে দেয়:<br><ol class="bbc_list" style="list-style-type: decimal;"><li>এর জন্য দেখানো নামগুলি সম্পাদনা করুন  সময় অঞ্চলের সাথে সম্পর্কিত একটি প্রেক্ষাপটে ব্যবহার করা যেতে পারে এমন যেকোনো স্থানে পৃথক অবস্থান।  উদাহরণস্বরূপ, আপনি SMF কে "Thule" এর পরিবর্তে "America/Thule" অবস্থানের জন্য "Qaanaaq" দেখাতে বলতে পারেন।</li><li>বিভিন্ন দেশের জন্য দেখানো নাম সম্পাদনা করুন।  এটি প্রাসঙ্গিক <code>iso3166[></code> স্ট্রিং সম্পাদনা করে করা যেতে পারে।</li></ol>';
 $helptxt['languages_txt_for_email_templates'] = 'এসএমএফ আপনার সদস্যদের পাঠায় এমন ইমেল বার্তা তৈরি করতে এই ভাষা এন্ট্রি ব্যবহার করা হয়।';
 $helptxt['languages_native_name'] = 'ভাষার নিজের জন্য নাম, নিজস্ব স্ক্রিপ্টে উপস্থাপিত।';
 $helptxt['languages_character_set'] = 'এই ভাষার জন্য ব্যবহৃত অক্ষর এনকোডিং।  SMF 2.1 অনুসারে, এটি সর্বদা "UTF-8" হওয়া উচিত।';
 $helptxt['languages_locale'] = 'লোকেল কোডটি বিভিন্ন ফরম্যাটিং কনভেনশন ইত্যাদি নির্ধারণ করতে ব্যবহৃত হয়।<br><br>লোকেল কোডটি সাধারণত দুটি অক্ষরের ভাষা কোডের রূপ নেয়, ঐচ্ছিকভাবে একটি আন্ডারস্কোর এবং একটি দুটি অনুসরণ করে  অক্ষর দেশের কোড।  উদাহরণস্বরূপ, <code>en</code> জেনেরিক ইংরেজি সনাক্ত করবে, যখন <code>en_AU</code> বিশেষ করে অস্ট্রেলিয়ান ইংরেজিকে চিহ্নিত করবে।';
 $helptxt['languages_rtl'] = 'এখানে একটি "1" লিখুন যদি এই ভাষাটি ডান থেকে বামে পড়ে (যেমন হিব্রু, আরবি)।   বাম থেকে ডান ভাষার জন্য এটি "0" ছেড়ে দিন।';
 $helptxt['languages_dictionary'] = 'এটি মূল ভাষার অভিধানকে সংজ্ঞায়িত করে যা <a href="https://php.net/function.pspell-new" target="_blank" rel="noopener" দ্বারা ব্যবহার করা হবে  >pSpell</a> বানান পরীক্ষক (যদি ইনস্টল করা হয়)।';
 $helptxt['languages_recaptcha'] = 'reCAPTCHA যাচাইকরণ উইজেটের জন্য যে ভাষা কোড ব্যবহার করতে হবে।<br><br>এর জন্য Google এর reCAPTCHA ডকুমেন্টেশন দেখুন <a href="https://developers.google.com/  recaptcha/docs/language" target="_blank" rel="noopener" class="bbc_link">সমর্থিত ভাষার তালিকা</a>।';
 // ইইউ এর জিডিপিআর পৃষ্ঠাটি বিভিন্ন ভাষায় বিদ্যমান;  ইউআরএলের শেষে ভাষা কোড পরিবর্তন করুন
 $helptxt['requireAgreement'] = 'এই সেটিংটি <a href="https://ec.europa.eu/info/law/law-topic/data--এর নিয়ম মেনে চলার জন্য সক্রিয় করার পরামর্শ দেওয়া হচ্ছে  protect/eu-data-protection-rules_en" target="_blank" rel="noopener" class="bbc_link">GDPR</a>.';
 // ইইউ এর জিডিপিআর পৃষ্ঠাটি বিভিন্ন ভাষায় বিদ্যমান;  ইউআরএলের শেষে ভাষা কোড পরিবর্তন করুন
 $helptxt['requirePolicyAgreement'] = 'এই সেটিংটি <a href="https://ec.europa.eu/info/law/law-topic/data--এর নিয়ম মেনে চলার জন্য সক্রিয় করার পরামর্শ দেওয়া হচ্ছে  protect/eu-data-protection-rules_en" target="_blank" rel="noopener" class="bbc_link">GDPR</a>.';
 $helptxt['gravatar'] = 'গ্রাভাটার বিশ্বব্যাপী স্বীকৃত অবতার।  একটি অবতার ছবি নির্বাচন করতে <a href="https://www.gravatar.com" target="_blank" rel="noopener">https://www.gravatar.com</a> এ একটি অ্যাকাউন্ট নিবন্ধন করুন৷  এই অবতারটি গ্রাভাটার সমর্থন করে এমন প্রতিটি সাইটে উপলব্ধ।  আপনার যদি গ্রাভাটার অ্যাকাউন্ট না থাকে তবে একটি ডিফল্ট ছবি ব্যবহার করা হবে৷';

 ?>