<?php
// Version: 2.1.3; Help

global $helptxt, $scripturl;

$txt['close_window'] = 'জানালা বন্ধ করুন';

$helptxt['manage_boards'] = '
	<strong>বোর্ড সম্পাদনা করুন</strong><br>
	এই পৃষ্ঠায় আপনি বোর্ড তৈরি/পুনর্বিন্যাস/অপসারণ করতে পারেন এবং তাদের উপরে ক্যাটেগরিগুলি। উদাহরণস্বরূপ, যদি আপনার একটি বিস্তৃত
	সাইট থাকে যা &quot;ক্রীড়া&quot;, &quot;গাড়ি&quot; এবং &quot;সংগীত&quot; এর তথ্য অফার করে, তবে এগুলি হবে
	আপনার তৈরি করা শীর্ষ স্তরের ক্যাটেগরি। প্রতিটি ক্যাটেগরির অধীনে আপনি সম্ভবত &quot;বোর্ড&quot; তৈরি করতে চাইবেন
	প্রতিটি বিষয়ের জন্য। এটি একটি সহজ শ্রেণীবিন্যাস, এই কাঠামোতে: <br>
	<ul class="normallist">
		<li>
			<strong>ক্রীড়া</strong>
			&nbsp;- একটি &quot;ক্যাটেগরি&quot;
			<ul class="normallist">
				<li>
					<strong>বেসবল</strong>
					&nbsp;- &quot;ক্রীড়া&quot; ক্যাটেগরির অধীনে একটি বোর্ড
					<ul class="normallist">
						<li>
							<strong>স্ট্যাটস</strong>
							&nbsp;- &quot;বেসবল&quot; বোর্ডের অধীনে একটি সাব-বোর্ড
						</li>
					</ul>
				</li>
				<li><strong>ফুটবল</strong>
				&nbsp;- &quot;ক্রীড়া&quot; ক্যাটেগরির অধীনে একটি বোর্ড</li>
			</ul>
		</li>
	</ul>
	ক্যাটেগরি আপনাকে বোর্ডগুলোকে বিস্তৃত বিষয়গুলিতে বিভক্ত করতে দেয় (যেমন &quot;গাড়ি, ক্রীড়া&quot;), এবং এর অধীনে থাকা &quot;বোর্ড&quot; ব্যবহারকারীদের প্রকৃত বিষয় পোস্ট করার অনুমতি দেয়। একটি ব্যবহারকারী যিনি পিন্টোতে আগ্রহী, তিনি &quot;গাড়ি->পিন্টো&quot; এর অধীনে একটি বার্তা পোস্ট করবেন।

এই পৃষ্ঠার প্রশাসনিক কার্যাবলী হলো প্রতিটি ক্যাটেগরির অধীনে নতুন বোর্ড তৈরি করা, তাদের পুনর্বিন্যাস করা (যেমন &quot;পিন্টো&quot; কে &quot;চেভি&quot; এর নিচে রাখা), অথবা বোর্ডটি সম্পূর্ণরূপে মুছে ফেলা।';

$helptxt['edit_news'] = '
	<ul class="normallist">
		<li>
			<strong>সংবাদ</strong><br>
			এই পৃষ্ঠা আপনাকে বোর্ড সূচী পৃষ্ঠায় প্রদর্শিত সংবাদ আইটেমগুলির জন্য টেক্সট সেট করতে দেয়। 
			আপনি যে কোনও আইটেম যোগ করতে পারেন (যেমন, &quot;এই মঙ্গলবার সম্মেলন মিস করবেন না&quot;)। 
			প্রতিটি সংবাদ আইটেম এলোমেলোভাবে প্রদর্শিত হয় এবং একটি পৃথক বাক্সে রাখা উচিত।
		</li>
		<li>
		<strong>নিউজলেটার</strong><br>
এই পৃষ্ঠা আপনাকে ফোরামের সদস্যদের কাছে ব্যক্তিগত বার্তা বা ইমেইলের মাধ্যমে নিউজলেটার পাঠানোর অনুমতি দেয়। প্রথমে সেই গ্রুপগুলো নির্বাচন করুন যারা নিউজলেটার পেতে চান এবং যারা নিউজলেটার পেতে চান না। আপনি চাইলে অতিরিক্ত সদস্য এবং ইমেইল ঠিকানা যোগ করতে পারেন যারা নিউজলেটার পাবেন। অবশেষে, আপনি যে বার্তাটি পাঠাতে চান তা ইনপুট করুন এবং নির্বাচন করুন আপনি এটি সদস্যদের কাছে ব্যক্তিগত বার্তা হিসেবে পাঠাতে চান নাকি ইমেইল হিসেবে। 
</li>
<li>
<strong>সেটিংস</strong><br>
এই পৃষ্ঠায় কিছু সেটিংস রয়েছে যা সংবাদ এবং নিউজলেটারের সাথে সম্পর্কিত, যার মধ্যে রয়েছে কোন গ্রুপগুলো ফোরামের সংবাদ সম্পাদনা করতে পারে বা নিউজলেটার পাঠাতে পারে তা নির্বাচন করা। ফোরামে নিউজ ফিড সক্রিয় রাখতে চান কিনা তা কনফিগার করার জন্য একটি সেটিংও রয়েছে, পাশাপাশি ফিডে প্রদর্শিত প্রতিটি নতুন পোস্টের জন্য দৈর্ঘ্য (কতটি অক্ষর প্রদর্শিত হয়) কনফিগার করার জন্য একটি সেটিংও রয়েছে। 
</li>
</ul>';

$helptxt['view_members'] = '
	<ul class="normallist">
		<li>
			<strong>সমস্ত সদস্য দেখুন</strong><br>
			ফোরামের সমস্ত সদস্য দেখুন। আপনাকে সদস্যদের নামের একটি হাইপারলিঙ্কযুক্ত তালিকা প্রদর্শিত হবে। আপনি সদস্যদের বিস্তারিত তথ্য (হোমপেজ, বয়স, ইত্যাদি) জানার জন্য যেকোনো নামের উপর ক্লিক করতে পারেন, এবং প্রশাসক হিসেবে আপনি এই প্যারামিটারগুলো পরিবর্তন করতে পারবেন। সদস্যদের উপর আপনার সম্পূর্ণ নিয়ন্ত্রণ রয়েছে, যার মধ্যে রয়েছে তাদের ফোরাম থেকে মুছে ফেলার ক্ষমতা।<br><br>
		</li>
		<li>
			<strong>অনুমোদনের অপেক্ষায়</strong><br>
			এই পৃষ্ঠা শুধুমাত্র তখনই দেখানো হয় যদি আপনি সমস্ত নতুন নিবন্ধনের জন্য প্রশাসক অনুমোদন সক্ষম করে থাকেন। যারা আপনার ফোরামে যোগ দিতে নিবন্ধন করে তারা শুধুমাত্র তখনই সম্পূর্ণ সদস্য হয়ে উঠবে যখন তাদের একটি প্রশাসকের দ্বারা অনুমোদন করা হবে। এই পৃষ্ঠায় সেই সমস্ত সদস্যের তালিকা রয়েছে যারা এখনও অনুমোদনের জন্য অপেক্ষা করছে, তাদের ইমেইল এবং আইপি ঠিকানা সহ। আপনি তালিকার যেকোনো সদস্যকে গ্রহণ বা প্রত্যাখ্যান (মুছে ফেলুন) করতে পারেন সদস্যের পাশে থাকা বক্সটি চেক করে এবং পৃষ্ঠার নিচের ড্রপ-ডাউন বক্স থেকে ক্রিয়া নির্বাচন করে। একটি সদস্যকে প্রত্যাখ্যান করার সময় আপনি সদস্যকে আপনার সিদ্ধান্তের বিষয়ে জানিয়ে মুছে ফেলতে পারেন বা না-ও করতে পারেন।<br><br>
		</li>
		<li>
			<strong>সক্রিয়করণের অপেক্ষায়</strong><br>
			এই পৃষ্ঠা শুধুমাত্র তখনই দৃশ্যমান হবে যদি আপনি ফোরামে নতুন সদস্য অ্যাকাউন্টগুলির জন্য ইমেইল সক্রিয়করণ সক্ষম করে থাকেন। এই পৃষ্ঠায় সেই সমস্ত সদস্যের তালিকা থাকবে যারা এখনও তাদের নতুন অ্যাকাউন্ট সক্রিয় করেনি। এই পৃষ্ঠায় আপনি সদস্যদের গ্রহণ, প্রত্যাখ্যান বা অবশিষ্ট নিবন্ধনের জন্য স্মরণ করিয়ে দেওয়ার জন্য নির্বাচন করতে পারেন। উপরের মতো, আপনি সদস্যকে জানাতে ইমেইলও করতে পারেন যে আপনি কী পদক্ষেপ নিয়েছেন।<br><br>
		</li>
	</ul>';
	
	$helptxt['ban_members'] = '<strong>সদস্য নিষিদ্ধ করুন</strong><br>
	SMF ব্যবহারকারীদের &quot;নিষিদ্ধ&quot; করার ক্ষমতা প্রদান করে, যা স্প্যামিং বা ট্রলিং ইত্যাদির মাধ্যমে ফোরামের বিশ্বাস ভঙ্গকারী ব্যবহারকারীদের বিরুদ্ধে একটি কার্যকরী পদক্ষেপ হতে পারে। এটি আপনাকে আপনার ফোরামের জন্য ক্ষতিকর ব্যবহারকারীদের বাদ দিতে সহায়তা করে। একজন প্রশাসক হিসেবে, যখন আপনি আপনার ফোরামে করা পোস্টগুলি দেখেন, আপনি দেখতে পাবেন যে ব্যবহারকারীর পোস্ট করার সময় কোন আইপি ঠিকানা ছিল। নিষিদ্ধ তালিকায়, আপনি সহজেই সেই আইপি ঠিকানাটি লিখে সংরক্ষণ করতে পারেন, এবং তারা আর সেই স্থান থেকে পোস্ট করতে পারবে না।<br>আপনি তাদের ইমেইল ঠিকানা দিয়েও মানুষকে নিষিদ্ধ করতে পারেন।';

$helptxt['featuresettings'] = '<strong>ফিচার এবং অপশন</strong><br>
	এই পৃষ্ঠায় কয়েকটি ফিচার রয়েছে যা আপনার পছন্দ অনুযায়ী পরিবর্তন করা যেতে পারে।';

$helptxt['modsettings'] = '<strong>মডিফিকেশন সেটিংস</strong><br>
	এই পৃষ্ঠায় আপনার ফোরামে ইনস্টল করা মডিফিকেশন দ্বারা যোগ করা যেকোনো সেটিংস রয়েছে।';
	
$helptxt['time_format'] = '<strong>সময় ফরম্যাট</strong><br>
	আপনার জন্য সময় এবং তারিখ কিভাবে দেখাবে তা সমন্বয় করার ক্ষমতা রয়েছে। এখানে অনেক ছোট অক্ষর রয়েছে, তবে এটি বেশ সহজ। 
	এই কনভেনশনগুলি PHP\'র strftime ফাংশন অনুসরণ করে এবং নিচে বর্ণিত হয়েছে (আরো বিস্তারিত <a href="https://php.net/manual/function.strftime.php" target="_blank" rel="noopener">php.net</a> এ পাওয়া যাবে)।<br>
	<br>
	ফরম্যাট স্ট্রিংয়ে নিম্নলিখিত অক্ষরগুলি স্বীকৃত: <br>
	<span class="smalltext">
	&nbsp;&nbsp;%a - সংক্ষিপ্ত সপ্তাহের নাম<br>
	&nbsp;&nbsp;%A - পূর্ণ সপ্তাহের নাম<br>
	&nbsp;&nbsp;%b - সংক্ষিপ্ত মাসের নাম<br>
	&nbsp;&nbsp;%B - পূর্ণ মাসের নাম<br>
	&nbsp;&nbsp;%d - মাসের দিন (01 থেকে 31)<br>
	&nbsp;&nbsp;%D<strong>*</strong> - %m/%d/%y এর সমান<br>
	&nbsp;&nbsp;%e<strong>*</strong> - মাসের দিন (1 থেকে 31)<br>
	&nbsp;&nbsp;%H - 24 ঘণ্টার ঘড়ি ব্যবহার করে ঘণ্টা (পরিসীমা 00 থেকে 23)<br>
	&nbsp;&nbsp;%I - 12 ঘণ্টার ঘড়ি ব্যবহার করে ঘণ্টা (পরিসীমা 01 থেকে 12)<br>
	&nbsp;&nbsp;%m - সংখ্যায় মাস (01 থেকে 12)<br>
	&nbsp;&nbsp;%M - সংখ্যায় মিনিট<br>
	&nbsp;&nbsp;%p - প্রদত্ত সময় অনুযায়ী &quot;am&quot; বা &quot;pm&quot;<br>
	&nbsp;&nbsp;%R<strong>*</strong> - 24 ঘণ্টার নোটেশনে সময়<br>
	&nbsp;&nbsp;%S - দশমিক সংখ্যায় সেকেন্ড<br>
	&nbsp;&nbsp;%T<strong>*</strong> - বর্তমান সময়, %H:%M:%S এর সমান<br>
	&nbsp;&nbsp;%y - 2 ডিজিটের বছর (00 থেকে 99)<br>
	&nbsp;&nbsp;%Y - 4 ডিজিটের বছর<br>
	&nbsp;&nbsp;%% - একটি অক্ষর \'%\' <br>
	<br>
	<em>* উইন্ডোজ ভিত্তিক সার্ভারে কাজ করে না।</em></span>';
	
$helptxt['live_news'] = '<strong>লাইভ ঘোষণা</strong><br>
	এই বক্সে <a href="https://www.simplemachines.org/" target="_blank" rel="noopener">www.simplemachines.org</a> থেকে সম্প্রতি আপডেট হওয়া ঘোষণাগুলি দেখানো হয়। 
	আপনাকে এখানে মাঝে মাঝে আপডেট, নতুন রিলিজ এবং Simple Machines থেকে গুরুত্বপূর্ণ তথ্যের জন্য চেক করতে হবে।';

$helptxt['registrations'] = '<strong>নিবন্ধন ব্যবস্থাপনা</strong><br>
	এই পৃষ্ঠায় ফোরামে নতুন নিবন্ধনগুলি পরিচালনা করার জন্য প্রয়োজনীয় সমস্ত কার্যক্রম অন্তর্ভুক্ত রয়েছে। এটি আপনার ফোরামের সেটিংসের উপর নির্ভর করে সর্বাধিক চারটি পৃষ্ঠা দেখায়। এগুলি হল:<br><br>
	<ul class="normallist">
		<li>
			<strong>নতুন সদস্য নিবন্ধন করুন</strong><br>
			এই পৃষ্ঠায় আপনি নতুন সদস্যদের পক্ষে অ্যাকাউন্ট নিবন্ধন করার জন্য নির্বাচন করতে পারেন। এটি সেই ফোরামগুলির জন্য উপকারী হতে পারে যেখানে নতুন সদস্যদের জন্য নিবন্ধন বন্ধ রয়েছে, অথবা যেখানে প্রশাসক একটি পরীক্ষামূলক অ্যাকাউন্ট তৈরি করতে চান। যদি অ্যাকাউন্টের সক্রিয়করণের জন্য সেটিংটি নির্বাচিত হয়, তবে সদস্যকে একটি সক্রিয়করণ লিঙ্ক সহ ইমেইল করা হবে যা ক্লিক করতে হবে তার আগে তারা অ্যাকাউন্ট ব্যবহার করতে পারে। একইভাবে, আপনি ব্যবহারকারীর নতুন পাসওয়ার্ডটি নির্ধারিত ইমেইল ঠিকানায় পাঠানোর জন্য নির্বাচন করতে পারেন।<br><br>
		</li>
		<li>
			<strong>নিবন্ধন চুক্তি সম্পাদনা করুন</strong><br>
			এই পৃষ্ঠা আপনাকে আপনার ফোরামের জন্য সদস্যরা যখন নিবন্ধন করে তখন প্রদর্শিত নিবন্ধন চুক্তির জন্য পাঠ্য সেট করতে দেয়। 
			আপনি SMF-তে অন্তর্ভুক্ত ডিফল্ট নিবন্ধন চুক্তি থেকে কিছু যোগ বা মুছে ফেলতে পারেন।<br><br>
		</li>
		<li>
			<strong>সংরক্ষিত নাম সেট করুন</strong><br>
			এই পৃষ্ঠাটি ব্যবহার করে আপনি শব্দ বা নাম নির্দিষ্ট করতে পারেন যা আপনার ব্যবহারকারীদের দ্বারা ব্যবহার করা যাবে না।<br><br>
		</li>
		<li>
			<strong>সেটিংস</strong><br>
			এই পৃষ্ঠা শুধুমাত্র তখনই দৃশ্যমান হবে যদি আপনার ফোরাম পরিচালনার অনুমতি থাকে। এই পৃষ্ঠায় আপনি আপনার ফোরামে ব্যবহার করার জন্য নিবন্ধন পদ্ধতি এবং অন্যান্য নিবন্ধন সম্পর্কিত সেটিংস নির্ধারণ করতে পারেন।
		</li>
	</ul>';
	
$helptxt['modlog'] = '<strong>মডারেশন লগ</strong><br>
	এই পৃষ্ঠা মডারেশন দলের সদস্যদের জন্য ফোরামের মডারেটরদের দ্বারা সম্পন্ন সমস্ত মডারেশন কার্যক্রম ট্র্যাক করার সুযোগ দেয়। লক্ষ্য করুন যে লগ পরিষ্কার করা হলে এটি লগ করা হবে যাতে অপব্যবহার প্রতিরোধ করা যায়।';

$helptxt['adminlog'] = '<strong>প্রশাসনিক লগ</strong><br>
	এই পৃষ্ঠা প্রশাসনিক দলের সদস্যদের জন্য ফোরামে ঘটে যাওয়া কিছু প্রশাসনিক কার্যক্রম ট্র্যাক করার সুযোগ দেয়। লক্ষ্য করুন যে লগ পরিষ্কার করা হলে এটি লগ করা হবে যাতে অপব্যবহার প্রতিরোধ করা যায়।';

$helptxt['userlog'] = '<strong>প্রোফাইল সম্পাদনা লগ</strong><br>
	এই পৃষ্ঠা প্রশাসনিক দলের সদস্যদের জন্য ব্যবহারকারীরা তাদের প্রোফাইলে যে পরিবর্তনগুলি করে তা দেখার সুযোগ দেয়, এবং এটি একটি ব্যবহারকারীর প্রোফাইল এলাকার ভিতর থেকে উপলব্ধ।';

$helptxt['warning_enable'] = '<strong>ব্যবহারকারী সতর্কতা সিস্টেম</strong><br>
	এই বৈশিষ্ট্যটি প্রশাসন এবং মডারেশন দলের সদস্যদের সদস্যদের প্রতি সতর্কতা জারি করার অনুমতি দেয় - এবং একটি সদস্যের সতর্কতা স্তর ব্যবহার করে তাদের জন্য ফোরামে উপলব্ধ কার্যক্রম নির্ধারণ করতে সহায়তা করে। এই বৈশিষ্ট্যটি সক্রিয় করার সাথে সাথে একটি অনুমতি পাওয়া যাবে অনুমতি পৃষ্ঠায়, যা নির্ধারণ করবে কোন গ্রুপগুলি সদস্যদের প্রতি সতর্কতা নির্ধারণ করতে পারে। সদস্যের প্রোফাইল থেকে সতর্কতা স্তরগুলি সমন্বয় করা যেতে পারে।';

$helptxt['warning_watch'] = 'এই সেটিংটি সেই শতাংশ সতর্কতা স্তর নির্ধারণ করে যা একটি সদস্যকে স্বয়ংক্রিয়ভাবে সদস্যকে &quot;নজরদারি&quot; দেওয়ার জন্য পৌঁছাতে হবে। যে কোনও সদস্য যিনি &quot;নজরদারি&quot; হচ্ছেন তারা মডারেশন কেন্দ্রে নজরদারিতে থাকা সদস্যদের তালিকায় উপস্থিত হবে।';

$helptxt['warning_moderate'] = 'এই সেটিংয়ের মান অতিক্রম করা যে কোনও সদস্যের সমস্ত পোস্টকে ফোরাম সম্প্রদায়ের কাছে প্রদর্শিত হওয়ার আগে মডারেটরের অনুমোদন প্রয়োজন হবে। এটি পোস্ট মডারেশন সম্পর্কিত যে কোনও স্থানীয় বোর্ড অনুমতিকে অতিক্রম করবে।';

$helptxt['warning_mute'] = 'যদি একটি সদস্য এই সতর্কতা স্তর অতিক্রম করে, তবে তারা পোস্ট নিষেধাজ্ঞার অধীনে থাকবে। সদস্যটি সমস্ত পোস্টিং অধিকার হারিয়ে ফেলবে।';

$helptxt['user_limit'] = 'এই সেটিংটি একটি মডারেটরকে ২৪ ঘণ্টার মধ্যে কোনও নির্দিষ্ট সদস্যের জন্য যে পরিমাণ পয়েন্ট যোগ/হটাতে পারে তা সীমাবদ্ধ করে। এটি একটি মডারেটরের জন্য ছোট সময়ের মধ্যে কি করতে পারে তা সীমাবদ্ধ করতে ব্যবহৃত হতে পারে। এটি শূন্য মানে সেট করে অক্ষম করা যেতে পারে। লক্ষ্য করুন যে প্রশাসক অনুমতি সহ যে কোনও সদস্য এই মান দ্বারা প্রভাবিত হয় না।';

$helptxt['error_log'] = '<strong>ত্রুটি লগ</strong><br>
	ত্রুটি লগ আপনার ফোরামের ব্যবহারকারীদের দ্বারা সম্মুখীন হওয়া প্রতিটি গুরুতর ত্রুটি ট্র্যাক করে। এটি তারিখ অনুসারে সমস্ত ত্রুটির একটি তালিকা প্রদান করে, যা প্রতিটি তারিখের পাশে কালো তীর চেপে সাজানো যেতে পারে। এছাড়াও, আপনি প্রতিটি ত্রুটি পরিসংখ্যানের পাশে ছবিতে ক্লিক করে ত্রুটিগুলি ফিল্টার করতে পারেন। এটি আপনাকে, উদাহরণস্বরূপ, সদস্য দ্বারা ফিল্টার করতে দেয়। যখন একটি ফিল্টার সক্রিয় থাকে, তখন প্রদর্শিত হবে শুধুমাত্র সেই ফলাফলগুলি যা সেই ফিল্টারের সাথে মেলে।';

$helptxt['theme_settings'] = '<strong>থিম সেটিংস</strong><br>
	সেটিংস পৃষ্ঠা আপনাকে একটি থিমের জন্য নির্দিষ্ট সেটিংস পরিবর্তন করার সুযোগ দেয়। এই সেটিংসগুলির মধ্যে থিমের ডিরেক্টরি এবং URL তথ্যের মতো বিকল্পগুলি অন্তর্ভুক্ত রয়েছে কিন্তু এছাড়াও আপনার ফোরামে একটি থিমের লেআউটকে প্রভাবিত করে এমন বিকল্পগুলি অন্তর্ভুক্ত রয়েছে। বেশিরভাগ থিমের বিভিন্ন ব্যবহারকারী কনফিগারযোগ্য সেটিংস থাকবে, যা আপনাকে একটি থিমকে আপনার ব্যক্তিগত ফোরামের প্রয়োজনীয়তার সাথে মানিয়ে নিতে সক্ষম করবে।';

$helptxt['smileys'] = '<strong>স্মাইলি কেন্দ্র</strong><br>
	এখানে আপনি স্মাইলি এবং স্মাইলি সেট যোগ এবং মুছে ফেলতে পারেন। যদি একটি স্মাইলি একটি সেটে থাকে, তবে এটি সমস্ত সেটে উপস্থিত থাকতে হবে - অন্যথায়, এটি আপনার ব্যবহারকারীদের জন্য বিভ্রান্তিকর হতে পারে যারা বিভিন্ন সেট ব্যবহার করছেন।<br><br>
	
	আপনি যদি সেটিংস পৃষ্ঠায় সক্ষম করে থাকেন তবে আপনি এখানে বার্তা আইকনও সম্পাদনা করতে পারবেন।';

$helptxt['calendar'] = '<strong>ক্যালেন্ডার পরিচালনা করুন</strong><br>
	এখানে আপনি বর্তমান ক্যালেন্ডার সেটিংস পরিবর্তন করতে পারেন এবং ক্যালেন্ডারে প্রদর্শিত ছুটির দিনগুলি যোগ এবং মুছে ফেলতে পারেন।';

$helptxt['cal_export'] = 'অন্যান্য ক্যালেন্ডার অ্যাপ্লিকেশনগুলিতে আমদানি করার জন্য iCal ফরম্যাটে একটি টেক্সট ফাইল রপ্তানি করে।';

$helptxt['cal_highlight_events'] = 'এই সেটিংটি আপনাকে মিনি ক্যালেন্ডার, প্রধান ক্যালেন্ডার, উভয় স্থানে, বা ইভেন্ট হাইলাইটিং অক্ষম করার জন্য ইভেন্টগুলি হাইলাইট করার অনুমতি দেয়।';

$helptxt['cal_highlight_holidays'] = 'এই সেটিংটি আপনাকে মিনি ক্যালেন্ডার, প্রধান ক্যালেন্ডার, উভয় স্থানে, বা ছুটির দিনগুলিকে হাইলাইট করার জন্য হাইলাইট করতে দেয়।';

$helptxt['cal_highlight_birthdays'] = 'এই সেটিংটি আপনাকে মিনি ক্যালেন্ডার, প্রধান ক্যালেন্ডার, উভয় স্থানে, বা জন্মদিনগুলিকে হাইলাইট করার জন্য হাইলাইট করতে দেয়।';

$helptxt['cal_disable_prev_next'] = 'যদি এই সেটিংটি চেক করা হয়, তবে পৃষ্ঠার বাম পাশে তিন মাসের ব্লকগুলি অক্ষম করা হবে।';

$helptxt['cal_display_type'] = 'এই সেটিংটি আপনাকে ক্যালেন্ডারের প্রদর্শন প্রকার পরিবর্তন করার অনুমতি দেয়।<br><br><strong>আরামদায়ক:</strong> ক্যালেন্ডারের সারিগুলিকে বড় করে।<br><strong>সংকুচিত:</strong> ক্যালেন্ডারের সারিগুলিকে ছোট করে।';

$helptxt['cal_week_links'] = 'যদি এই সেটিংটি চেক করা হয়, তবে ক্যালেন্ডারের প্রতিটি সপ্তাহের পাশে লিঙ্ক যোগ করা হবে।';

$helptxt['cal_prev_next_links'] = 'যদি এই সেটিংটি চেক করা হয়, তবে প্রতিটি মাসের উপরে পূর্ববর্তী মাস এবং পরবর্তী মাসের লিঙ্কগুলি সহজ নেভিগেশনের জন্য যোগ করা হবে।';
// argument(s): $txt['months_short'][1], $txt['months_titles'][1]
$helptxt['cal_short_months'] = 'যদি এই সেটিংটি চেক করা হয়, তবে ক্যালেন্ডারের মধ্যে মাসের নাম সংক্ষিপ্ত করা হবে।<br><br><strong>সক্রিয়:</strong> %1$s 1<br><strong>নিষ্ক্রিয়:</strong> %2$s 1';
// argument(s): $txt['days_short'][1], $txt['days'][1]
$helptxt['cal_short_days'] = 'যদি এই সেটিংটি চেক করা হয়, তবে ক্যালেন্ডারের মধ্যে দিনের নাম সংক্ষিপ্ত করা হবে।<br><br><strong>সক্রিয়:</strong> %1$s<br><strong>নিষ্ক্রিয়:</strong> %2$s';

$helptxt['serversettings'] = '<strong>সার্ভার সেটিংস</strong><br>
	এখানে আপনি আপনার ফোরামের জন্য কিছু মূল কনফিগারেশন সম্পাদন করতে পারেন। এই পৃষ্ঠায় ডেটাবেস এবং URL সেটিংস, পাশাপাশি অন্যান্য গুরুত্বপূর্ণ কনফিগারেশন আইটেম যেমন মেইল সেটিংস এবং ক্যাশিং অন্তর্ভুক্ত রয়েছে। এই সেটিংসগুলি সম্পাদনা করার সময় সাবধানতা অবলম্বন করুন কারণ একটি ত্রুটি ফোরামটিকে অপ্রবেশ্য করে তুলতে পারে।';

$helptxt['manage_files'] = '
	<ul class="normallist">
		<li>
			<strong>ফাইল ব্রাউজ করুন</strong><br>
			SMF দ্বারা সংরক্ষিত সমস্ত সংযুক্তি, অ্যাভাটার এবং থাম্বনেইলগুলির মধ্যে ব্রাউজ করুন।<br><br>
		</li><li>
			<strong>সংযুক্তি সেটিংস</strong><br>
			সংযুক্তিগুলি কোথায় সংরক্ষিত হয় তা কনফিগার করুন এবং সংযুক্তির প্রকারের উপর নিষেধাজ্ঞা সেট করুন।<br><br>
		</li><li>
			<strong>অ্যাভাটার সেটিংস</strong><br>
			অ্যাভাটারগুলি কোথায় সংরক্ষিত হয় তা কনফিগার করুন এবং অ্যাভাটারের আকার পরিবর্তন পরিচালনা করুন।<br><br>
		</li><li>
			<strong>ফাইল রক্ষণাবেক্ষণ</strong><br>
			সংযুক্তি ডিরেক্টরিতে কোনো ত্রুটি পরীক্ষা করুন এবং মেরামত করুন এবং নির্বাচিত সংযুক্তিগুলি মুছে ফেলুন।<br><br>
		</li>
	</ul>';
	
$helptxt['topicSummaryPosts'] = 'এটি আপনাকে উত্তর পৃষ্ঠায় বিষয় সারাংশে প্রদর্শিত পূর্ববর্তী পোস্টের সংখ্যা সেট করতে দেয়।';

$helptxt['enableAllMessages'] = 'এটি সেট করুন <em>সর্বাধিক</em> পোস্টের সংখ্যা যা একটি বিষয়ের জন্য <em>সব</em> লিঙ্ক প্রদর্শন করতে পারে। "একটি বিষয় পৃষ্ঠায় প্রদর্শনের জন্য সর্বাধিক বার্তা" এর চেয়ে কম সেট করা মানে এটি কখনও প্রদর্শিত হবে না, এবং খুব বেশি সেট করা আপনার ফোরামকে ধীর করে দিতে পারে।';

$helptxt['allow_guestAccess'] = 'এই বক্সটি আনচেক করা হলে অতিথিদের আপনার ফোরামে খুব সাধারণ কিছু কাজ করতে দেওয়া হবে - লগইন, নিবন্ধন, পাসওয়ার্ড মনে করানো ইত্যাদি। এটি বোর্ডে অতিথি প্রবেশ নিষিদ্ধ করার সমান নয়।';

$helptxt['userLanguage'] = 'এই সেটিংটি চালু করলে ব্যবহারকারীদের তাদের ব্যবহৃত ভাষা ফাইল নির্বাচন করার অনুমতি দেওয়া হবে। এটি ডিফল্ট নির্বাচনে প্রভাব ফেলবে না।';

$helptxt['trackStats'] = 'পরিসংখ্যান:<br>এটি ব্যবহারকারীদের আপনার ফোরামে সর্বশেষ পোস্ট এবং সবচেয়ে জনপ্রিয় বিষয়গুলি দেখতে সক্ষম করবে। এটি সবচেয়ে বেশি অনলাইন সদস্য, নতুন সদস্য এবং নতুন বিষয়ের মতো কয়েকটি পরিসংখ্যানও দেখাবে।<hr>পৃষ্ঠার দর্শন:<br>এটি আপনার ফোরামের পৃষ্ঠার দর্শনের সংখ্যা সহ পরিসংখ্যান পৃষ্ঠায় একটি নতুন কলাম যুক্ত করে।';

$helptxt['titlesEnable'] = 'কাস্টম শিরোনাম চালু করা হলে, প্রাসঙ্গিক অনুমতি সহ সদস্যরা নিজেদের জন্য একটি বিশেষ শিরোনাম তৈরি করতে পারবেন। এটি নামের নিচে প্রদর্শিত হবে।<br><em>যেমন:</em><br>জেফ<br>কুল গাই';
$helptxt['onlineEnable'] = 'এটি একটি ছবি দেখাবে যা নির্দেশ করবে সদস্যটি অনলাইন নাকি অফলাইন।';

$helptxt['todayMod'] = 'এটি তারিখের পরিবর্তে &quot;আজ&quot; বা &quot;গতকাল&quot; দেখাবে।<br><br>
		<strong>উদাহরণ:</strong><br><br>
		<ul class="normallist">
			<li>
			<strong>নিষ্ক্রিয়</strong><br>
			অক্টোবর ৩, ২০০৯ সকাল ১২:৫৯:১৮</li>
			<li><strong>শুধুমাত্র আজ</strong><br>
			আজ সকাল ১২:৫৯:১৮</li>
			<li><strong>আজ ও গতকাল</strong><br>
			গতকাল রাত ০৯:৩৬:৫৫</li>
		</ul>';

$helptxt['disableCustomPerPage'] = 'এই সেটিংটি চেক করুন যাতে ব্যবহারকারীরা বার্তা এবং বিষয়ের সংখ্যা কাস্টমাইজ করতে না পারেন যা যথাক্রমে বার্তা সূচী এবং বিষয় প্রদর্শন পৃষ্ঠায় প্রদর্শিত হবে।';

$helptxt['enablePreviousNext'] = 'এটি পরবর্তী এবং পূর্ববর্তী বিষয়ের জন্য একটি লিঙ্ক দেখাবে।';

$helptxt['pollMode'] = 'এটি নির্বাচন করে যে ভোটগুলি সক্রিয় করা হয়েছে কিনা। যদি ভোটগুলি নিষ্ক্রিয় থাকে, তবে যে কোনও বিদ্যমান ভোট বিষয়ের তালিকা থেকে লুকিয়ে থাকবে। আপনি &quot;বিদ্যমান ভোটগুলি বিষয় হিসাবে দেখান&quot; নির্বাচন করে তাদের ভোট ছাড়া নিয়মিত বিষয়গুলি দেখাতে বেছে নিতে পারেন।<br><br>কোনো একজনকে ভোট পোস্ট করার, ভোট দেখার এবং অনুরূপ অনুমতি দেওয়ার জন্য, আপনি সেই অনুমতিগুলি অনুমোদন এবং অস্বীকার করতে পারেন। মনে রাখবেন, যদি ভোটগুলি কাজ না করে।';

$helptxt['enableCompressedOutput'] = 'এই সেটিংটি আউটপুট কম্প্রেস করবে যাতে ব্যান্ডউইথ খরচ কমে, কিন্তু এটি zlib ইনস্টল করা প্রয়োজন।';

$helptxt['httponlyCookies'] = 'কুকিগুলি স্ক্রিপ্টিং ভাষার দ্বারা প্রবেশযোগ্য হবে না, যেমন JavaScript। এই সেটিংটি XSS আক্রমণের মাধ্যমে পরিচয় চুরির ঝুঁকি কমাতে সাহায্য করতে পারে। এটি তৃতীয় পক্ষের স্ক্রিপ্টের সাথে সমস্যা সৃষ্টি করতে পারে কিন্তু যেখানে সম্ভব সেখানে এটি চালু রাখা উচিত।';
$helptxt['samesiteCookies'] = 'Set-Cookie HTTP প্রতিক্রিয়া হেডারের SameSite অ্যাট্রিবিউট আপনাকে ঘোষণা করতে দেয় যে আপনার কুকি একটি প্রথম-পক্ষ বা একই-সাইট প্রসঙ্গে সীমাবদ্ধ হওয়া উচিত কিনা। আরও তথ্যের জন্য, অনুগ্রহ করে <a href="https://developer.mozilla.org/docs/Web/HTTP/Headers/Set-Cookie/SameSite">MDN</a> দেখুন।';

$helptxt['databaseSession_enable'] = 'এই সেটিংটি সেশন স্টোরেজের জন্য ডেটাবেস ব্যবহার করে - এটি লোড ব্যালেন্সড সার্ভারের জন্য সেরা, কিন্তু সমস্ত টাইমআউট সমস্যার সমাধান করতে সহায়তা করে এবং ফোরামটিকে দ্রুততর করতে পারে।';

$helptxt['databaseSession_loose'] = 'এটি চালু করলে আপনার ফোরামের ব্যান্ডউইথ কমবে, এবং ফিরে ক্লিক করলে পৃষ্ঠা পুনরায় লোড হবে না - downside হল নতুন আইকনগুলি আপডেট হবে না, অন্যান্য বিষয়ের মধ্যে। (আপনি যদি ফিরে যাওয়ার পরিবর্তে সেই পৃষ্ঠায় ক্লিক না করেন)।';

$helptxt['databaseSession_lifetime'] = 'এটি হল সেকেন্ডের সংখ্যা যা সেশনগুলি শেষ হয় যখন সেগুলি অ্যাক্সেস করা হয়নি। যদি একটি সেশন খুব দীর্ঘ সময় ধরে অ্যাক্সেস না করা হয়, তবে এটি বলা হয় যে এটি &quot;টাইমআউট&quot; হয়েছে। 2400-এর বেশি কিছু সুপারিশ করা হয়।';

$helptxt['tfa_mode'] = 'আপনার ফোরামে একটি দ্বিতীয় স্তরের নিরাপত্তা যোগ করতে <a href="https://en.wikipedia.org/wiki/Two_factor_authentication">দুই-ফ্যাক্টর প্রমাণীকরণ</a> সক্ষম করুন। 2FA আপনার ব্যবহারকারীদের নিয়মিত লগইনের পরে একটি মেশিন-জেনারেটেড কোড প্রবেশ করতে বাধ্য করে। আপনাকে অন্য ব্যবহারকারীদের উপর এটি চাপানোর আগে 2FA কনফিগার করতে হবে!';

$helptxt['cache_enable'] = 'SMF বিভিন্ন স্তরে ক্যাশিং সম্পাদন করে। ক্যাশিংয়ের স্তর যত বেশি সক্ষম হবে, ক্যাশ করা তথ্য পুনরুদ্ধার করতে তত বেশি CPU সময় ব্যয় হবে। যদি আপনার মেশিনে ক্যাশিং উপলব্ধ থাকে তবে প্রথমে স্তর 1-এ ক্যাশিং চেষ্টা করার সুপারিশ করা হয়।';

$helptxt['cache_memcached'] = 'যদি আপনি memcached ব্যবহার করেন তবে আপনাকে সার্ভারের বিবরণ প্রদান করতে হবে। এটি নীচের উদাহরণের মতো একটি কমা দ্বারা পৃথক তালিকা হিসাবে প্রবেশ করতে হবে:<br><br>	&quot;server1,server2,server3:port,server4&quot;<br><br>দ্রষ্টব্য যে যদি কোন পোর্ট উল্লেখ করা না হয় তবে SMF পোর্ট 11211 ব্যবহার করবে, যদ্দ্বারা হোস্টে একটি স্ল্যাশ থাকে, তখন এটি একটি বিকল্প পরিবহন হিসাবে ধরে নেওয়া হয় এবং পোর্ট 0 সেট করা হবে। SMF নির্দিষ্ট সার্ভারগুলির মধ্যে রাফ/র্যান্ডম লোড ব্যালেন্সিং করার চেষ্টা করবে।';
$helptxt['cache_cachedir'] = 'এই সেটিংটি শুধুমাত্র SMF ফাইল-ভিত্তিক ক্যাশ সিস্টেমের জন্য। এটি ক্যাশ ডিরেক্টরির পথ নির্ধারণ করে। এটি ব্যবহার করার জন্য আপনি যদি এটি ব্যবহার করতে চান তবে এটি /tmp/ এ রাখার সুপারিশ করা হয়, যদিও এটি যেকোনো ডিরেক্টরিতে কাজ করবে।';

$helptxt['cache_sqlite_cachedir'] = 'এই সেটিংটি শুধুমাত্র SQLite ডেটাবেস ক্যাশ সিস্টেমের জন্য। এটি ক্যাশ ডিরেক্টরির পথ নির্ধারণ করে। এটি ব্যবহার করার জন্য আপনি যদি এটি ব্যবহার করতে চান তবে এটি /tmp/ এ রাখার সুপারিশ করা হয়, যদিও এটি যেকোনো ডিরেক্টরিতে কাজ করবে।';

$helptxt['enableErrorLogging'] = 'এটি যে কোনও ত্রুটি লগ করবে, যেমন একটি ব্যর্থ লগইন, যাতে আপনি দেখতে পারেন কি ভুল হয়েছে।';

$helptxt['enableErrorQueryLogging'] = 'এটি ত্রুটি লগে ডেটাবেসে প্রেরিত পূর্ণ প্রশ্ন অন্তর্ভুক্ত করবে। এটি ত্রুটি লগিং চালু করা প্রয়োজন।<br><br><strong>দ্রষ্টব্য: এটি ত্রুটি বার্তা দ্বারা ত্রুটি লগ ফিল্টার করার ক্ষমতাকে প্রভাবিত করবে।</strong>';

$helptxt['disallow_sendBody'] = 'এই সেটিংটি নোটিফিকেশন ইমেইলে উত্তর, পোস্ট এবং ব্যক্তিগত বার্তার টেক্সট পাওয়ার বিকল্পটি সরিয়ে দেয়।<br><br>প্রায়শই, সদস্যরা নোটিফিকেশন ইমেইলে উত্তর দেয়, যা বেশিরভাগ ক্ষেত্রে মানে হল যে ওয়েবমাস্টার উত্তরটি পায়।';

$helptxt['enable_ajax_alerts'] = 'এই বিকল্পটি আপনার সদস্যদের AJAX নোটিফিকেশন পাওয়ার অনুমতি দেয়। এর মানে হল যে সদস্যদের নতুন নোটিফিকেশন পেতে পৃষ্ঠা রিফ্রেশ করতে হবে না।<br><strong>দ্রষ্টব্য:</strong> এই বিকল্পটি আপনার সার্ভারে অনেক ব্যবহারকারী অনলাইনে থাকলে গুরুতর লোড সৃষ্টি করতে পারে।';

$helptxt['alerts_auto_purge'] = 'একবার একটি অ্যালার্ট পড়া হলে, এটি খুব কমই আবার প্রয়োজন হয়। কর্মক্ষমতার কারণে, কিছু সময় পরে স্বয়ংক্রিয়ভাবে সেগুলি মুছে ফেলা একটি ভাল ধারণা।';

$helptxt['jquery_source'] = 'এটি jQuery লাইব্রেরি লোড করতে ব্যবহৃত উৎস নির্ধারণ করবে। <em>গুগল CDN, jQuery CDN</em> এবং <em>মাইক্রোসফট CDN</em> সেই অনুযায়ী CDN নেটওয়ার্ক থেকে jQuery লাইব্রেরি লোড করবে। <em>স্থানীয়</em> কেবলমাত্র স্থানীয় উৎস ব্যবহার করবে। <em>কাস্টম</em> আপনাকে লাইব্রেরির জন্য একটি কাস্টম URL নির্দিষ্ট করতে দেয়।';

$helptxt['compactTopicPagesEnable'] = 'এটি কেবল পৃষ্ঠার সংখ্যার একটি নির্বাচনী প্রদর্শন করবে।<br><em>উদাহরণ:</em>
		&quot;3&quot; প্রদর্শনের জন্য: 1 ... 4 [5] 6 ... 9 <br>
		&quot;5&quot; প্রদর্শনের জন্য: 1 ... 3 4 [5] 6 7 ... 9';
$helptxt['timeLoadPageEnable'] = 'এটি বোর্ডের নিচে পৃষ্ঠা তৈরি করতে SMF কত সেকেন্ড সময় নিয়েছে তা দেখাবে।';

$helptxt['removeNestedQuotes'] = 'এটি প্রশ্নের পোস্টটি উদ্ধৃতির লিঙ্কের মাধ্যমে উদ্ধৃত করার সময় নেস্টেড উদ্ধৃতিগুলি সরিয়ে দেবে।';

$helptxt['max_image_width'] = 'এটি পোস্ট করা ছবির জন্য একটি সর্বাধিক আকার সেট করতে আপনাকে অনুমতি দেয়। সর্বাধিকের চেয়ে ছোট ছবিগুলি প্রভাবিত হবে না। এটি একটি থাম্বনেইল ক্লিক করার সময় সংযুক্ত ছবিগুলি কিভাবে প্রদর্শিত হবে তাও নির্ধারণ করে।';

$helptxt['mail_type'] = 'এই সেটিংটি আপনাকে PHP এর ডিফল্ট সেটিংস বেছে নিতে অথবা সেই সেটিংসকে SMTP দিয়ে ওভাররাইড করতে দেয়। PHP SMTP এর সাথে প্রমাণীকরণ ব্যবহার সমর্থন করে না (যা অনেক হোস্ট এখন প্রয়োজন), তাই আপনি যদি এটি চান তবে আপনাকে SMTP নির্বাচন করতে হবে। দয়া করে লক্ষ্য করুন যে SMTP ধীর হতে পারে, এবং কিছু সার্ভার ব্যবহারকারীর নাম এবং পাসওয়ার্ড গ্রহণ করবে না।<br><br>যদি এটি PHP এর ডিফল্টে সেট করা থাকে তবে আপনাকে SMTP সেটিংস পূরণ করতে হবে না।';

$helptxt['attachment_manager_settings'] = 'সংযুক্তি হল ফাইল যা সদস্যরা আপলোড করতে এবং একটি পোস্টে সংযুক্ত করতে পারে। বিভিন্ন সাইটগুলি এগুলি বিভিন্নভাবে ব্যবহার করতে পারে, যা আপনি এখানে কনফিগার করতে পারেন।';

$helptxt['attachmentCheckExtensions'] = 'কিছু সম্প্রদায়ের জন্য, আপনি ব্যবহারকারীরা যে ফাইলের ধরনগুলি আপলোড করতে পারে তা সীমাবদ্ধ করতে এক্সটেনশন পরীক্ষা করতে পারেন: উদাহরণস্বরূপ, myphoto.jpg একটি jpg এক্সটেনশন রয়েছে।';
// References setting attachmentCheckExtensions
$helptxt['attachmentExtensions'] = 'যদি উপরে "সংযুক্তির এক্সটেনশন পরীক্ষা করুন" সক্রিয় থাকে, তবে এইগুলি নতুন সংযুক্তির জন্য অনুমোদিত এক্সটেনশন হবে।';

$helptxt['attachmentUploadDir'] = 'সার্ভারে আপনার সংযুক্তি ফোল্ডারের পথ<br>(উদাহরণ: /home/sites/yoursite/www/forum/attachments)';

$helptxt['attachmentDirSizeLimit'] = 'এটি নির্বাচন করুন যে সংযুক্তি ফোল্ডারটি কত বড় হতে পারে, এর মধ্যে সমস্ত ফাইল অন্তর্ভুক্ত থাকবে।';

$helptxt['attachmentPostLimit'] = 'প্রতি পোস্টে তৈরি সমস্ত সংযুক্তির সর্বাধিক ফাইলের আকার (কেবি-তে) নির্বাচন করুন। যদি এটি প্রতি সংযুক্তির সীমার চেয়ে কম হয়, তবে এটি সীমা হবে।';

$helptxt['attachmentSizeLimit'] = 'প্রতিটি পৃথক সংযুক্তির সর্বাধিক ফাইলের আকার নির্বাচন করুন।';

$helptxt['attachmentNumPerPostLimit'] = 'প্রতি পোস্টে একজন ব্যক্তি কতগুলি সংযুক্তি করতে পারেন তা নির্বাচন করুন।';

$helptxt['attachmentShowImages'] = 'যদি আপলোড করা ফাইলটি একটি ছবি হয়, তবে এটি পোস্টের নিচে প্রদর্শিত হবে।';

$helptxt['attachmentThumbnails'] = 'যদি উপরের সেটিংটি নির্বাচিত হয়, তবে এটি ব্যান্ডউইথ কমাতে থাম্বনেইলের জন্য একটি পৃথক (ছোট) সংযুক্তি সংরক্ষণ করবে।';

$helptxt['attachmentThumbWidth'] = 'এটি কেবল &quot;পোস্টের নিচে প্রদর্শনের সময় ছবিগুলি রিসাইজ করুন&quot; সেটিংয়ের সাথে ব্যবহৃত হয়। এটি সংযুক্তিগুলি রিসাইজ করার জন্য সর্বাধিক প্রস্থ। এগুলি অনুপাতিকভাবে রিসাইজ করা হবে।';

$helptxt['attachmentThumbHeight'] = 'এটি কেবল &quot;পোস্টের নিচে প্রদর্শনের সময় ছবিগুলি রিসাইজ করুন&quot; সেটিংয়ের সাথে ব্যবহৃত হয়। এটি সংযুক্তিগুলি রিসাইজ করার জন্য সর্বাধিক উচ্চতা। এগুলি অনুপাতিকভাবে রিসাইজ করা হবে।';

$helptxt['attachmentDirFileLimit'] = 'প্রতি ডিরেক্টরির সর্বাধিক ফাইলের সংখ্যা।';
$helptxt['attachmentEnable'] = 'এই সেটিংটি আপনাকে কিভাবে সংযুক্তি তৈরি করা যায় তা কনফিগার করতে সক্ষম করে।<br><br>
	<ul class="normallist">
		<li>
			<strong>সমস্ত সংযুক্তি নিষ্ক্রিয় করুন</strong><br>
			সমস্ত সংযুক্তি নিষ্ক্রিয় করা হয়েছে। বিদ্যমান সংযুক্তিগুলি মুছে ফেলা হয় না, তবে সেগুলি দৃশ্য থেকে লুকানো থাকে (এমনকি প্রশাসকরাও সেগুলি দেখতে পারেন না)। নতুন সংযুক্তি তৈরি করা যাবে না, অনুমতি যাই হোক না কেন।<br><br>
		</li>
		<li>
			<strong>সমস্ত সংযুক্তি সক্রিয় করুন</strong><br>
			সবকিছু স্বাভাবিকভাবে কাজ করে, যারা সংযুক্তি দেখতে অনুমোদিত তাদের জন্য তা সম্ভব, এবং যারা আপলোড করতে অনুমোদিত তাদের জন্যও তা সম্ভব।<br><br>
		</li>
		<li>
			<strong>নতুন সংযুক্তি নিষ্ক্রিয় করুন</strong><br>
			বিদ্যমান সংযুক্তিগুলি এখনও অ্যাক্সেসযোগ্য, তবে নতুন সংযুক্তি যোগ করা যাবে না, অনুমতি যাই হোক না কেন।
		</li>
	</ul>';
$helptxt['attachment_image_paranoid'] = 'এই সেটিংটি নির্বাচন করলে চিত্র সংযুক্তির উপর খুব কঠোর নিরাপত্তা পরীক্ষা সক্ষম হবে। <strong>সতর্কতা!</strong> এই বিস্তৃত পরীক্ষাগুলি বৈধ ছবির ক্ষেত্রেও ব্যর্থ হতে পারে। নিরাপত্তা পরীক্ষাগুলি ব্যর্থ হলে SMF দ্বারা ছবিগুলি পুনঃনমুনা করার চেষ্টা করতে এই সেটিংটি শুধুমাত্র ছবি পুনঃএনকোডিংয়ের সাথে ব্যবহার করার জন্য দৃঢ়ভাবে সুপারিশ করা হয়: যদি সফল হয়, তবে সেগুলি পরিষ্কার এবং আপলোড করা হবে। অন্যথায়, যদি ছবি পুনঃএনকোডিং সক্ষম না হয়, তবে পরীক্ষায় ব্যর্থ সমস্ত সংযুক্তি প্রত্যাখ্যাত হবে।';

$helptxt['attachment_image_reencode'] = 'এই সেটিংটি নির্বাচন করলে আপলোড করা চিত্র সংযুক্তিগুলি পুনঃএনকোড করার চেষ্টা সক্ষম হবে। ছবি পুনঃএনকোডিং নিরাপত্তা উন্নত করে। তবে লক্ষ্য করুন যে ছবি পুনঃএনকোডিং সমস্ত অ্যানিমেটেড ছবিকে স্থির করে তোলে। <br> এই বৈশিষ্ট্যটি শুধুমাত্র তখনই সম্ভব যখন আপনার সার্ভারে GD মডিউল ইনস্টল করা থাকে।';

$helptxt['attachment_thumb_memory'] = 'যত বড় হবে উৎস ছবি (আকার এবং প্রস্থ x উচ্চতা), সিস্টেমের জন্য থাম্বনেইল ছবি সফলভাবে তৈরি করতে তত বেশি মেমরি প্রয়োজন।<br>এই সেটিংটি পরীক্ষা করে, সিস্টেম প্রয়োজনীয় মেমরির অনুমান করবে এবং তারপর সেই পরিমাণ অনুরোধ করবে। যদি সফল হয়, তবে তখনই এটি থাম্বনেইল তৈরি করার চেষ্টা করবে।<br>এটি কম সাদা পৃষ্ঠা ত্রুটির ফলস্বরূপ হতে পারে তবে এটি কম থাম্বনেইল তৈরি হতে পারে। এটি অচেক রাখলে সিস্টেমটি সর্বদা থাম্বনেইল তৈরি করার চেষ্টা করবে (একটি নির্দিষ্ট পরিমাণ মেমরির সাথে)। এটি আরও সাদা পৃষ্ঠা ত্রুটি সৃষ্টি করতে পারে।';

$helptxt['attachmentRecodeLineEndings'] = 'স্ক্রিপ্টটি আপনার সার্ভারের অনুযায়ী লাইন শেষগুলি পুনঃকোড করবে।';

$helptxt['automanage_attachments'] = 'ডিফল্টভাবে, SMF নতুন সংযুক্তিগুলি একটি একক ফোল্ডারে রাখে। বেশিরভাগ সাইটের জন্য এটি একটি সমস্যা নয়, তবে একটি সাইট বাড়ার সাথে সাথে সংযুক্তি সংরক্ষণের জন্য একাধিক ফোল্ডার থাকা উপকারী হতে পারে।<br><br>এই সেটিংটি আপনাকে নির্ধারণ করতে দেয় যে আপনি কি এই ফোল্ডারগুলি নিজে পরিচালনা করবেন (যেমন দ্বিতীয় ফোল্ডার তৈরি করা এবং প্রস্তুত হলে সেখানে স্থানান্তর করা) অথবা আপনি SMF-কে এটি করতে দেবেন, যেমন যখন বর্তমান ডিরেক্টরি একটি নির্দিষ্ট আকারে পৌঁছায়, বা খুব ব্যস্ত সাইটগুলিতে বছরের ভিত্তিতে বা এমনকি মাসের ভিত্তিতে ফোল্ডারগুলি ভেঙে দেওয়া।';
$helptxt['dont_show_attach_under_post'] = 'যদি সক্রিয় করা হয়, তবে পোস্টে এমবেড করা সংযুক্তিগুলি পোস্টের নিচে প্রদর্শিত হবে না, তবে এগুলি মুছে ফেলার জন্য এখনও বিষয়বস্তু থাকবে।';

$helptxt['use_subdirectories_for_attachments'] = 'নতুন ডিরেক্টরি তৈরি করুন।';

$helptxt['max_image_height'] = 'সর্বাধিক প্রস্থের মতো, এই সেটিংটি নির্দেশ করে যে একটি পোস্ট করা ছবির সর্বাধিক উচ্চতা কত হতে পারে।';

$helptxt['avatar_paranoid'] = 'এই সেটিংটি নির্বাচন করলে অ্যাভাটারের উপর খুব কঠোর নিরাপত্তা পরীক্ষা সক্ষম হবে। <strong>সতর্কতা!</strong> এই বিস্তৃত পরীক্ষাগুলি বৈধ ছবির ক্ষেত্রেও ব্যর্থ হতে পারে। নিরাপত্তা পরীক্ষাগুলি ব্যর্থ হলে SMF দ্বারা ছবিগুলি পুনঃনমুনা করার চেষ্টা করতে এই সেটিংটি শুধুমাত্র অ্যাভাটার পুনঃএনকোডিংয়ের সাথে ব্যবহার করার জন্য দৃঢ়ভাবে সুপারিশ করা হয়: যদি সফল হয়, তবে সেগুলি পরিষ্কার এবং আপলোড করা হবে। অন্যথায়, যদি অ্যাভাটার পুনঃএনকোডিং সক্ষম না হয়, তবে পরীক্ষায় ব্যর্থ সমস্ত অ্যাভাটার প্রত্যাখ্যাত হবে।';

$helptxt['avatar_reencode'] = 'এই সেটিংটি নির্বাচন করলে আপলোড করা অ্যাভাটারগুলি পুনঃএনকোড করার চেষ্টা সক্ষম হবে। ছবি পুনঃএনকোডিং নিরাপত্তা উন্নত করে। তবে লক্ষ্য করুন যে ছবি পুনঃএনকোডিং সমস্ত অ্যানিমেটেড ছবিকে স্থির করে তোলে। <br> এই বৈশিষ্ট্যটি শুধুমাত্র তখনই সম্ভব যখন আপনার সার্ভারে GD মডিউল ইনস্টল করা থাকে।';

$helptxt['cal_enabled'] = 'ক্যালেন্ডারটি জন্মদিন দেখানোর জন্য বা আপনার সম্প্রদায়ে গুরুত্বপূর্ণ ঘটনাগুলি প্রদর্শনের জন্য ব্যবহার করা যেতে পারে। এই সেটিংটি ক্যালেন্ডার এবং এর সমস্ত বৈশিষ্ট্য সক্ষম করে।';

$helptxt['cal_link_postevent'] = 'এটি সদস্যদেরকে সেই দিনে ঘটনাগুলি পোস্ট করার অনুমতি দেবে, যখন তারা সেই তারিখে ক্লিক করবে।';

$helptxt['cal_maxdays_advance'] = 'যদি এটি ৭ এ সেট করা হয়, তবে পরবর্তী সপ্তাহের ঘটনাগুলি প্রদর্শিত হবে।';

$helptxt['cal_allow_unlinkedevents'] = 'সদস্যদেরকে একটি পোস্টের সাথে সংযুক্ত না করে ঘটনাগুলি পোস্ট করার অনুমতি দিন।';

$helptxt['cal_min_year'] = 'ক্যালেন্ডার তালিকায় &quot;প্রথম&quot; বছর নির্বাচন করুন।';

$helptxt['cal_max_year'] = 'ক্যালেন্ডার তালিকায় &quot;শেষ&quot; বছর নির্বাচন করুন।';

$helptxt['cal_maxevent_span'] = 'একটি ঘটনা কত দিন ধরে চলতে পারে তার সর্বাধিক সংখ্যা নির্বাচন করুন।';

$helptxt['localCookies'] = 'SMF ক্লায়েন্ট কম্পিউটারে লগইন তথ্য সংরক্ষণ করতে কুকিজ ব্যবহার করে।
	কুকিজ গ্লোবাল (myserver.com) বা লোকাল (myserver.com/path/to/forum) হিসাবে সংরক্ষণ করা যেতে পারে।<br><br>
	যদি আপনি স্বয়ংক্রিয়ভাবে লগআউট হওয়ার সমস্যার সম্মুখীন হন তবে এই সেটিংটি চেষ্টা করুন।<hr>
	গ্লোবালি সংরক্ষিত কুকিজ একটি শেয়ার করা ওয়েবসার্ভারে (যেমন Tripod) ব্যবহৃত হলে কম নিরাপদ।<hr>
	লোকাল কুকিজ ফোরাম ডিরেক্টরির বাইরের কাজ করে না, তাই, যদি আপনার ফোরাম www.myserver.com/forum এ সংরক্ষিত হয়, তবে www.myserver.com/index.php এর মতো পৃষ্ঠাগুলি অ্যাকাউন্ট তথ্য অ্যাক্সেস করতে পারে না।<br><br>
	গ্লোবাল কুকিজ বিশেষভাবে SSI.php ব্যবহার করার সময় সুপারিশ করা হয় তবে তাদের নিজস্ব ডোমেনে বেশিরভাগ সাইটের জন্য ভাল কাজ করে।';
$helptxt['enableBBC'] = 'এই সেটিংটি নির্বাচন করলে আপনার সদস্যদের ফোরামের বিভিন্ন স্থানে বুলেটিন বোর্ড কোড (BBC) ব্যবহার করার অনুমতি দেওয়া হবে, যা ব্যবহারকারীদের তাদের পোস্টগুলি ছবির, টাইপ ফরম্যাটিং এবং আরও অনেক কিছু দিয়ে ফরম্যাট করতে সক্ষম করে।';

$helptxt['legacy_bbc'] = 'লিগ্যাসি BBCodes অপ্রচলিত এবং নতুন পোস্টে ব্যবহার করা যাবে না। তবে, যদি এখানে সক্ষম করা হয় তবে বিদ্যমান পোস্টগুলিতে এগুলি পার্স করা হবে।<br><br>লিগ্যাসি BBCodes সক্ষম করা শুধুমাত্র তখনই উপকারী যদি আপনার ফোরাম পূর্ববর্তী SMF সংস্করণ থেকে আপগ্রেড করা হয়ে থাকে।<br><br>এছাড়াও, যদিও এগুলি সক্ষম করা হয়, কিছু লিগ্যাসি BBCodes একইভাবে রেন্ডার হবে না যেমন একসময় ছিল। উদাহরণস্বরূপ, [flash] BBCode কেবল ফ্ল্যাশ কনটেন্টের একটি লিঙ্ক দেখাবে, এটিকে এম্বেড করার পরিবর্তে।';

$helptxt['default_timezone'] = 'এটি ফোরামের সময় প্রদর্শনের জন্য ব্যবহৃত ডিফল্ট সময় অঞ্চল।';

$helptxt['timezone_priority_countries'] = 'এই সেটিংটি আপনাকে একটি নির্দিষ্ট দেশ বা দেশের জন্য সময় অঞ্চলগুলি তালিকার শীর্ষে ঠেলে দিতে দেয় যা ব্যবহারকারীরা তাদের প্রোফাইল কনফিগার করার সময়, ক্যালেন্ডার ইভেন্ট তৈরি করার সময় ইত্যাদি দেখতে পাবেন।<br><br>যেমন, যদি আপনার ফোরামের অনেক সদস্য নিউজিল্যান্ড বা ফিজিতে বসবাস করে, তবে আপনি "NZ,FJ" লিখতে পারেন যাতে তারা সবচেয়ে প্রাসঙ্গিক সময় অঞ্চলগুলি দ্রুত খুঁজে পেতে পারে।<br><br>আপনি "<a href="https://www.google.com/search?q=iso+3166-1+alpha-2" target="_blank" rel="noopener">ISO 3166-1 alpha-2</a>" অনুসন্ধান করে ISO দেশ কোডের সম্পূর্ণ তালিকা খুঁজে পেতে পারেন।';

$helptxt['spamWaitTime'] = 'এখানে আপনি পোস্টিংয়ের মধ্যে যে পরিমাণ সময় পাস করতে হবে তা নির্বাচন করতে পারেন। এটি লোকেদের আপনার ফোরামে "স্প্যামিং" করা থেকে আটকাতে ব্যবহার করা যেতে পারে, তাদের পোস্ট করার ফ্রিকোয়েন্সি সীমাবদ্ধ করে।';

$helptxt['enablePostHTML'] = 'এটি কিছু মৌলিক HTML ট্যাগ পোস্ট করার অনুমতি দেবে:
	<ul class="normallist">
		<li>&lt;b&gt;, &lt;u&gt;, &lt;i&gt;, &lt;s&gt;, &lt;em&gt;, &lt;strong&gt;, &lt;ins&gt;, &lt;del&gt;</li>
		<li>&lt;a href=&quot;&quot;&gt;</li>
		<li>&lt;img src=&quot;&quot; alt=&quot;&quot; /&gt;</li>
		<li>&lt;br&gt;, &lt;hr&gt;</li>
		<li>&lt;pre&gt;, &lt;blockquote&gt;</li>
	</ul>';
	
$helptxt['themes_manage'] = 'এখানে আপনি নতুন থিম ইনস্টল করতে পারেন এবং কোন থিমগুলি আপনার ব্যবহারকারীরা নির্বাচন করতে পারে, নতুন ব্যবহারকারী এবং অতিথিরা কোন ডিফল্ট থিম ব্যবহার করবে, সেইসাথে অন্যান্য থিম নির্বাচন সেটিংস নির্বাচন করতে পারেন।';

$helptxt['theme_install'] = 'এটি আপনাকে নতুন থিম ইনস্টল করার অনুমতি দেয়। আপনি এটি একটি বিদ্যমান ডিরেক্টরি থেকে, থিমের জন্য একটি আর্কাইভ আপলোড করে, অথবা ডিফল্ট থিম কপি করে করতে পারেন।<br><br>নোট করুন যে আর্কাইভ বা ডিরেক্টরির মধ্যে একটি <pre>theme_info.xml</pre> সংজ্ঞা ফাইল থাকতে হবে।';

$helptxt['xmlnews_enable'] = 'মানুষকে <a href="%1$s?action=.xml;sa=news" target="_blank" rel="noopener">সাম্প্রতিক খবর</a> এবং অনুরূপ তথ্যের সাথে সংযুক্ত করতে দেয়। এটি সুপারিশ করা হয় যে আপনি সাম্প্রতিক পোস্ট/খবরের আকার সীমাবদ্ধ করুন কারণ কিছু ক্লায়েন্ট RSS ডেটা প্রদর্শনের জন্য কেটে যাওয়ার আশা করে।';

$helptxt['xmlnews_attachments'] = 'আপনার XML/RSS ফিডগুলির মধ্যে সংযুক্তির লিঙ্ক অন্তর্ভুক্ত করতে দেয়। যদি আপনি আপনার ফোরামকে একটি পডকাস্টিং, ব্রডকাচিং, বা অনুরূপ কনটেন্ট বিতরণ প্ল্যাটফর্ম হিসাবে ব্যবহার করতে চান তবে এটি চালু করুন।<br><br>“সংযুক্তি দেখার” অনুমতি এই সেটিংকে প্রভাবিত করে। সদস্য এবং অতিথিরা কেবল তখনই একটি পোস্টের সংযুক্তি ফিডে দেখতে পাবে যদি তারা পোস্টের ওয়েব পৃষ্ঠায় সংযুক্তিগুলি দেখতে পারে। মনে রাখবেন যে বেশিরভাগ ফিড রিডার আপনার ফিডগুলি অতিথি হিসেবে অ্যাক্সেস করবে।<br><br>কিছু ফিড ফরম্যাটে প্রতি পোস্টে একটি সংযুক্তি অন্তর্ভুক্ত করার অনুমতি দেওয়া হয়। যদি একটি পোস্টে একাধিক সংযুক্তি থাকে, তবে SMF এই ফিডগুলিতে সবচেয়ে বড়টি অন্তর্ভুক্ত করবে।';

$helptxt['globalCookies'] = 'সাবডোমেন জুড়ে লগ ইন কুকিজ উপলব্ধ করে। উদাহরণস্বরূপ, যদি...<br>
	আপনার সাইট হয় https://www.example.com/,<br>
	এবং আপনার ফোরাম হয় https://forum.example.com/,<br>
	এই সেটিংটি ব্যবহার করা হলে এটি আপনার সাইটে ফোরামের কুকি অ্যাক্সেস করতে দেয়। যদি আপনার নিয়ন্ত্রণে না থাকা অন্য সাবডোমেন (যেমন hacker.example.com) থাকে তবে এটি সক্ষম করবেন না।<br><br>
	এই সেটিংটি স্থানীয় কুকি সক্ষম থাকলে কাজ করে না।';

$helptxt['globalCookiesDomain'] = 'সাবডোমেন স্বাধীন কুকি (গ্লোবাল কুকি) ব্যবহার করার সময়, আপনি কোন ডোমেইনটি তাদের জন্য ব্যবহার করা উচিত তা নির্দিষ্ট করতে পারেন। এটি অবশ্যই আপনার মূল ডোমেইনে সেট করা উচিত - উদাহরণস্বরূপ, যদি আপনি <em>forum.example.com</em> এবং <em>www.example.com</em> ব্যবহার করেন, তবে এই ক্ষেত্রে ডোমেইন <em>example.com</em>। এর সামনে <em>http://</em> বা <em>https://</em> অংশটি রাখবেন না।';

$helptxt['secureCookies'] = 'এই সেটিংটি সক্ষম করলে আপনার ফোরামে ব্যবহারকারীদের জন্য তৈরি কুকিগুলিকে নিরাপদ হিসেবে চিহ্নিত করা হবে। এই সেটিংটি শুধুমাত্র তখনই সক্ষম করুন যখন আপনি আপনার সাইট জুড়ে HTTPS ব্যবহার করছেন, অন্যথায় এটি মানে হবে যে কেউ সঠিকভাবে লগ ইন করতে পারবে না!';
$helptxt['securityDisable'] = 'যখন সক্ষম করা হয়, এটি প্রশাসনিক পৃষ্ঠার জন্য অতিরিক্ত পাসওয়ার্ড চেক <em>অক্ষম</em> করে। এটি সুপারিশ করা হয় না!';

$helptxt['securityDisable_why'] = 'আপনার বর্তমান পাসওয়ার্ড প্রবেশ করুন। (যেটি আপনি লগইন করতে ব্যবহার করেন।)<br><br>এটি প্রবেশ করার প্রয়োজনীয়তা নিশ্চিত করে যে আপনি যেকোন প্রশাসনিক কার্যকলাপ করতে চান এবং এটি <strong>আপনি</strong> করছেন।';

$helptxt['securityDisable_moderate'] = 'যখন সক্ষম করা হয়, এটি মডারেশন পৃষ্ঠার জন্য অতিরিক্ত পাসওয়ার্ড চেক <em>অক্ষম</em> করে। এই সেটিংটি ডিফল্টভাবে সক্ষম থাকে।';

$helptxt['securityDisable_moderate_why'] = 'আপনার বর্তমান পাসওয়ার্ড প্রবেশ করুন। (যেটি আপনি লগইন করতে ব্যবহার করেন।)<br><br>এটি প্রবেশ করার প্রয়োজনীয়তা নিশ্চিত করে যে আপনি যেকোন মডারেশন কার্যকলাপ করতে চান এবং এটি <strong>আপনি</strong> করছেন।';

$helptxt['allow_cors'] = 'ক্রস অরিজিন রিসোর্স শেয়ারিং বা CORS হল আধুনিক ব্রাউজারের জন্য একটি নীতি যা বিভিন্ন ডোমেইনের মধ্যে অনুরোধ করা রিসোর্সগুলিকে বিশ্বাস করে। যদি সক্ষম করা হয়, তবে এটি বিভিন্ন ডোমেইন থেকে ফোরামের রিসোর্সে অ্যাক্সেস করা স্ক্রিপ্টগুলির জন্য CORS নীতি সমাধানের চেষ্টা করবে। যদি সাবডোমেন স্বাধীন কুকি (গ্লোবাল কুকি) সক্ষম করা হয়, তবে সঠিক ডোমেইন নির্ধারণের চেষ্টা করা হয়। অতিরিক্ত CORS ডোমেইনগুলি একটি কমা দ্বারা পৃথক তালিকা দিয়ে সরবরাহ করা যায়। ফরম্যাট হওয়া উচিত {SCHEMA}://{DOMAIN}। যদি ডোমেইনে একটি ওয়াইল্ডকার্ড (*) সরবরাহ করা হয়, তবে ওয়াইল্ডকার্ড সমাধানের চেষ্টা করা হয়। যদি একটি ওয়াইল্ডকার্ড (*) একমাত্র অতিরিক্ত ডোমেইন হিসাবে সরবরাহ করা হয়, তবে সমস্ত ডোমেইন অনুমোদিত এবং এটি আপনার ফোরামের জন্য একটি নিরাপত্তা ঝুঁকি উপস্থাপন করতে পারে এবং এটি অত্যন্ত বিশেষ ক্ষেত্রে ব্যতীত ব্যবহার করা উচিত নয়। অতিরিক্ত হেডারগুলি একটি কমা দ্বারা পৃথক তালিকায় সরবরাহ করা যেতে পারে এবং এই হেডারগুলি ধারণকারী অনুরোধগুলির সময় অনুমোদিত হবে এবং ওয়াইল্ডকার্ড (*) অনুমোদিত।';

$helptxt['frame_security'] = 'আধুনিক ব্রাউজারগুলি এখন X-Frame-Options নামে পরিচিত একটি নিরাপত্তা হেডার বুঝতে পারে যা সার্ভার দ্বারা উপস্থাপিত হয়। এই অপশনটি সেট করে আপনি কীভাবে আপনার সাইটকে ফ্রেমসেট বা iframe এর মধ্যে ফ্রেম করতে দিতে চান তা নির্ধারণ করেন। অক্ষম করলে কোন হেডার পাঠানো হবে না এবং এটি সবচেয়ে নিরাপত্তাহীন, তবে সবচেয়ে বেশি স্বাধীনতা দেয়। অস্বীকার করলে সমস্ত ফ্রেম সম্পূর্ণরূপে প্রতিরোধ করবে এবং এটি সবচেয়ে কঠোর এবং নিরাপদ। একই উৎস অনুমোদন করলে শুধুমাত্র আপনার ডোমেইনকে যেকোন ফ্রেম ইস্যু করার অনুমতি দেয় এবং পূর্ববর্তী দুটি অপশনের জন্য একটি মধ্যম পথ প্রদান করে।';

$helptxt['proxy_ip_header'] = 'এটি সেই সার্ভার হেডার যা SMF ব্যবহারকারীদের আসল IP ঠিকানা ধারণ করার জন্য বিশ্বাস করবে। এই সেটিংটি পরিবর্তন করলে সদস্যদের উপর অপ্রত্যাশিত IP ফলাফল হতে পারে। দয়া করে এই সেটিংগুলি পরিবর্তন করার আগে আপনার সার্ভার প্রশাসক, CDN প্রদানকারী বা প্রোক্সি প্রশাসকের সাথে চেক করুন। বেশিরভাগ প্রদানকারী HTTP_X_FORWARDED_FOR ব্যবহার করবে। নিরাপত্তার জন্য নিশ্চিত করতে আপনাকে উল্টো প্রোক্সি হেডার পাঠানো সার্ভারগুলির তালিকা পূরণ করতে হবে যাতে এই হেডারগুলি কেবল বৈধ উত্স থেকে আসে।';

$helptxt['email_members'] = 'এই বার্তায় আপনি কিছু &quot;ভেরিয়েবল&quot; ব্যবহার করতে পারেন। এগুলি হল:<br>
	{$board_url} - আপনার ফোরামের URL।<br>
	{$current_time} - বর্তমান সময়।<br {$member.email} - বর্তমান সদস্যের ইমেইল।<br>
	{$member.link} - বর্তমান সদস্যের লিঙ্ক।<br>
	{$member.id} - বর্তমান সদস্যের আইডি।<br>
	{$member.name} - বর্তমান সদস্যের নাম। (ব্যক্তিগতকরণের জন্য)।<br>
	{$latest_member.link} - সর্বশেষ নিবন্ধিত সদস্যের লিঙ্ক।<br>
	{$latest_member.id} - সর্বশেষ নিবন্ধিত সদস্যের আইডি।<br>
	{$latest_member.name} - সর্বশেষ নিবন্ধিত সদস্যের নাম।';
	
$helptxt['failed_login_threshold'] = 'ব্যবহারকারীকে পাসওয়ার্ড রিমাইন্ডার পৃষ্ঠায় নির্দেশ দেওয়ার আগে ব্যর্থ লগইন প্রচেষ্টার সংখ্যা নির্ধারণ করুন।';

$helptxt['loginHistoryDays'] = 'ব্যবহারকারী প্রোফাইল ট্র্যাকিংয়ের অধীনে লগইন ইতিহাস রাখার জন্য দিনগুলির সংখ্যা। ডিফল্ট হল 30 দিন।';

$helptxt['oldTopicDays'] = 'যদি এই সেটিংটি সক্ষম করা হয়, তবে ব্যবহারকারী যখন একটি টপিকে উত্তর দেওয়ার চেষ্টা করবেন যা নির্দিষ্ট সময়, দিনে, নতুন উত্তর পায়নি, তখন একটি সতর্কতা প্রদর্শিত হবে। এই বৈশিষ্ট্য অক্ষম করতে এই সেটিংটি 0 এ সেট করুন।';

$helptxt['edit_wait_time'] = 'শেষ সম্পাদনার তারিখ লগ করার আগে একটি পোস্ট সম্পাদনা করার জন্য অনুমোদিত সেকেন্ডের সংখ্যা।';

$helptxt['edit_disable_time'] = 'একটি ব্যবহারকারী যে পোস্টটি করেছে সেটি সম্পাদনা করতে না পারার আগে যে মিনিটগুলি পার হওয়া উচিত তার সংখ্যা। 0 এ সেট করুন অক্ষম করতে। <br><br><em>নোট: এটি অন্যের পোস্ট সম্পাদনা করার অনুমতি পাওয়া ব্যবহারকারীদের উপর প্রভাব ফেলবে না।</em>';

$helptxt['preview_characters'] = 'এই সেটিংটি প্রথম এবং শেষ বার্তার টপিক প্রিভিউয়ের জন্য উপলব্ধ অক্ষরের সংখ্যা নির্ধারণ করে।';

$helptxt['quote_expand'] = 'এই সেটিংটি বড় উদ্ধৃতিগুলিকে সংকুচিত করার অনুমতি দেয়, ব্যবহারকারীকে তাদের সম্পূর্ণ দৈর্ঘ্যে সম্প্রসারণ করার বিকল্প দেয়। এই সেটিংয়ের চেয়ে ছোট উদ্ধৃতিগুলি প্রভাবিত হবে না।';

$helptxt['posts_require_captcha'] = 'এই সেটিংটি ব্যবহারকারীদের প্রতি বার পোস্ট করার সময় অ্যান্টি-স্প্যাম বট যাচাইকরণ পাস করতে বাধ্য করবে। কেবলমাত্র সেই ব্যবহারকারীরা যাদের পোস্টের সংখ্যা নির্ধারিত সংখ্যার নিচে থাকবে তাদের কোড প্রবেশ করতে হবে - এটি স্বয়ংক্রিয় স্প্যামিং স্ক্রিপ্টের বিরুদ্ধে লড়াই করতে সহায়তা করবে।';

$helptxt['disable_wysiwyg'] = 'এই সেটিংটি সমস্ত ব্যবহারকারীকে পোস্ট পৃষ্ঠায় WYSIWYG (&quot;আপনি যা দেখছেন তা যা পাবেন&quot;) সম্পাদক ব্যবহার করতে নিষিদ্ধ করে।';

$helptxt['lastActive'] = 'বোর্ড ইনডেক্সে X সংখ্যক মিনিটে সক্রিয় লোকেদের দেখানোর জন্য মিনিটের সংখ্যা সেট করুন। ডিফল্ট হল 15 মিনিট।';

$helptxt['customoptions'] = 'এটি একটি ড্রপ ডাউন তালিকা থেকে একজন ব্যবহারকারী যে বিকল্পগুলি নির্বাচন করতে পারে তা সংজ্ঞায়িত করে। এই পৃষ্ঠায় কয়েকটি মূল পয়েন্ট লক্ষ্য করা উচিত:
	<ul class="normallist">
		<li><strong>ডিফল্ট সেটিং:</strong> যে চেক বক্সটির পাশে &quot;রেডিও বোতাম&quot; নির্বাচন করা হয়েছে সেটি ব্যবহারকারীর প্রোফাইলে প্রবেশ করার সময় ডিফল্ট নির্বাচন হবে।</li>
		<li><strong>বিকল্পগুলি মুছে ফেলা:</strong> একটি বিকল্প মুছে ফেলতে শুধু সেই বিকল্পের জন্য টেক্সট বক্সটি খালি করুন - নির্বাচিত সকল ব্যবহারকারীর বিকল্প মুছে যাবে।</li>
		<li><strong>বিকল্পগুলি পুনর্বিন্যাস করা:</strong> আপনি বাক্সগুলির মধ্যে টেক্সট সরিয়ে বিকল্পগুলি পুনর্বিন্যাস করতে পারেন। তবে - একটি গুরুত্বপূর্ণ নোট - আপনি বিকল্পগুলি পুনর্বিন্যাস করার সময় টেক্সট পরিবর্তন করবেন না, অন্যথায় ব্যবহারকারীর তথ্য হারিয়ে যাবে।</li>
	</ul>';
	
$helptxt['autoFixDatabase'] = 'এটি স্বয়ংক্রিয়ভাবে ভাঙা টেবিলগুলি মেরামত করবে এবং কিছুই ঘটেনি এমনভাবে পুনরায় শুরু করবে। যখন এটি ঘটে তখন এটি আপনাকে ইমেইল করবে।<br>যদি আপনি এই বিকল্পটি অক্ষম করতে বেছে নেন, তবে আপনার ফোরাম বন্ধ থাকবে যতক্ষণ না আপনি সমস্যা লক্ষ্য করেন এবং ম্যানুয়ালি এটি মেরামত করেন।';
// argument(s): scripturl
$helptxt['pgFulltextSearch'] = 'এই সেটিংটি PostgreSQL এর পূর্ণ পাঠ অনুসন্ধানের জন্য ব্যবহৃত ভাষা সংজ্ঞায়িত করে। সেই ভাষাটি নির্বাচন করুন যা আপনার ফোরামের ব্যবহৃত ভাষার সাথে সবচেয়ে কাছাকাছি। যদি আপনার ফোরামের ভাষা তালিকাভুক্ত না হয়, অথবা যদি আপনার ফোরাম বহু-ভাষিক হয়, তবে "সাধারণ" বিকল্পটি নির্বাচন করুন। <br>
এই সেটিংটি আপনার প্রধান SMF ভাষা সেটিংসের উপর নির্ভরশীল নয় এবং SMF এর জন্য ইনস্টল করা ভাষার সাথে সম্পর্কিত নয়। <br>
যখন আপনি এই সেটিংটি পরিবর্তন করেন, তখন আপনাকে <a href="%1$s?action=admin;area=managesearch;sa=method" target="_blank" rel="noopener">পূর্ণ পাঠ অনুসন্ধান সূচক পুনর্গঠন করতে হবে</a>।<br>
যদি আপনার প্রয়োজনীয় ভাষা তালিকাভুক্ত না হয়, তবে আপনার ডাটাবেস প্রশাসকের কাছে সেই ভাষার জন্য PostgreSQL ভাষা সমর্থন ইনস্টল করার জন্য জিজ্ঞাসা করুন।';

$helptxt['enableParticipation'] = 'এটি ব্যবহারকারীর পোস্ট করা টপিকগুলিতে একটি ছোট আইকন দেখায়।';

$helptxt['db_persist'] = 'এটি পারফরম্যান্স বাড়ানোর জন্য সংযোগ সক্রিয় রাখে। যদি আপনি একটি ডেডিকেটেড সার্ভারে না থাকেন, তবে এটি আপনার হোস্টের সাথে সমস্যার সৃষ্টি করতে পারে।<br>
যদি এই বিকল্পটি অক্ষম করা হয়, তবে আপনাকে আপনার php.ini ফাইলে mysqli.allow_persistent বা pgsql.allow_persistent সেটিংটি সক্ষম করতে হতে পারে।';

$helptxt['ssi_db_user'] = 'যখন আপনি SSI.php ব্যবহার করছেন, তখন একটি ভিন্ন ডেটাবেস ব্যবহারকারী এবং পাসওয়ার্ড ব্যবহার করার জন্য ঐচ্ছিক সেটিং।';

// argument(s): either $helptxt['queryless_urls_supported'] or $helptxt['queryless_urls_unsupported'], depending on whether the server uses a supported webserver
$helptxt['queryless_urls'] = 'এটি URL-এর ফরম্যাট কিছুটা পরিবর্তন করে যাতে সার্চ ইঞ্জিনগুলিকে এগুলি আরও পছন্দ করে। এগুলি index.php/topic,1.0.html এর মতো দেখাবে।<br><br>%1$s';
// is conditionally used as part of $helptxt['queryless_urls']
$helptxt['queryless_urls_supported'] = 'এই বৈশিষ্ট্যটি আপনার সার্ভারে কাজ করবে।';
// is conditionally used as part of $helptxt['queryless_urls']
$helptxt['queryless_urls_unsupported'] = 'এই বৈশিষ্ট্যটি আপনার সার্ভারে কাজ করবে না।';
$helptxt['minimize_files'] = 'এই বিকল্পটি আপনার ফোরামের ব্যবহৃত CSS এবং JavaScript ফাইলগুলি সংকুচিত করবে, যা আপনার সার্ভারে অনুরোধের কল কমিয়ে দেবে এবং আপনার ব্যবহারকারীদের জন্য লোডের সময় দ্রুততর করবে।<br><br>সাধারণত, আপনাকে এই বিকল্পটি সক্ষম রাখা উচিত। একমাত্র সময় এটি অস্থায়ীভাবে অক্ষম করতে চাইতে পারেন তা হল যখন আপনি আপনার সাইটে ব্যবহৃত CSS বা JavaScript ফাইলগুলি পরিবর্তন করছেন (যেমন, যখন আপনার থিম ফাইলগুলি সম্পাদনা করছেন বা একটি সংশোধন তৈরি করছেন)।';

$helptxt['boardindex_max_depth'] = 'এই সেটিংটি নিয়ন্ত্রণ করে SMF কতগুলি সাব-বোর্ড স্তর পরীক্ষা করবে নতুন পোস্ট খোঁজার সময়। এটি "মা-বোর্ডের মোটের মধ্যে সাব-বোর্ডের পোস্ট গোনার" বিকল্পটি সক্ষম হলে কোন বোর্ডগুলি অন্তর্ভুক্ত হবে তাও প্রভাবিত করে।<br><br>যেমন, যদি এটি 1 এ সেট করা হয়, তবে একটি সাব-বোর্ড কেবল তখনই "নতুন" হিসাবে চিহ্নিত হবে যখন সাব-বোর্ডে একটি নতুন পোস্ট থাকবে। যদি এটি 2 এ সেট করা হয়, তবে সাব-বোর্ড "নতুন" হিসাবে চিহ্নিত হবে যদি সাব-বোর্ডে বা একটি সাব-সাব-বোর্ডে একটি নতুন পোস্ট থাকে। যদি এটি 10 এ সেট করা হয়, তবে সাব-বোর্ড "নতুন" হিসাবে চিহ্নিত হবে যদি সাব-বোর্ডে, একটি সাব-সাব-বোর্ডে, একটি সাব-সাব-সাব-বোর্ডে, ইত্যাদি, 10 স্তর গভীর পর্যন্ত একটি নতুন পোস্ট থাকে।<br><br>বড়, সক্রিয় ফোরামগুলি এই মানটি কম সংখ্যায় সেট করতে চাইতে পারে সার্ভারের সম্পদ সংরক্ষণ করার জন্য।';

$helptxt['countChildPosts'] = 'এই সেটিংটি পরীক্ষা করা মানে হল যে একটি বোর্ডের সাব-বোর্ডগুলির পোস্ট এবং টপিকগুলি ইনডেক্স পৃষ্ঠায় এর মোটের দিকে গণনা করা হবে।<br><br>এর মানে হল যে একটি মা-বোর্ডে যদি কোন পোস্ট না থাকে তবে এটি \'0\' দেখাবে না যদি এর সাব-বোর্ডগুলিতে কোন পোস্ট থাকে।';

$helptxt['allow_ignore_boards'] = 'এই সেটিংটি পরীক্ষা করা হলে ব্যবহারকারীদের তাদের অগ্রাহ্য করতে চাওয়া বোর্ডগুলি নির্বাচন করার অনুমতি দেবে।';

$helptxt['deny_boards_access'] = 'এই সেটিংটি পরীক্ষা করা হলে আপনাকে সদস্যদলের অ্যাক্সেসের ভিত্তিতে নির্দিষ্ট বোর্ডগুলিতে প্রবেশাধিকার অস্বীকার করার অনুমতি দেবে।';

// argument(s): scripturl
$helptxt['who_enabled'] = 'এই সেটিংটি আপনাকে <a href="%1$s?action=who" target="_blank" rel="noopener">কিন্তু অনলাইনে কে</a> পৃষ্ঠা চালু বা বন্ধ করতে দেয়, যা দেখায় কে ফোরাম ব্রাউজ করছে এবং তারা কী করছে।';

$helptxt['recycle_enable'] = '&quot;পুনর্ব্যবহার করে&quot; মুছে ফেলা টপিক এবং পোস্টগুলি নির্দিষ্ট বোর্ডে।';

$helptxt['enableReportPM'] = 'এই সেটিংটি আপনার ব্যবহারকারীদের তাদের প্রাপ্ত ব্যক্তিগত বার্তা প্রশাসনিক দলের কাছে রিপোর্ট করার অনুমতি দেয়। এটি ব্যক্তিগত মেসেজিং সিস্টেমের কোনও অপব্যবহার ট্র্যাক করতে সহায়ক হতে পারে।';

$helptxt['max_pm_recipients'] = 'এই সেটিংটি আপনাকে একটি ফোরাম সদস্য দ্বারা পাঠানো একটি ব্যক্তিগত বার্তায় সর্বাধিক প্রাপকের সংখ্যা সেট করতে দেয়। এটি PM সিস্টেমের স্প্যাম অপব্যবহার বন্ধ করতে সহায়তা করতে ব্যবহৃত হতে পারে। মনে রাখবেন যে নিউজলেটার পাঠানোর অনুমতি থাকা ব্যবহারকারীরা এই সীমাবদ্ধতা থেকে অব্যাহতি পাবেন। সীমা ছাড়াই সেট করতে শূন্যে সেট করুন।';

$helptxt['pm_posts_verification'] = 'এই সেটিংটি ব্যবহারকারীদেরকে একটি যাচাইকরণ চিত্রে প্রদর্শিত কোড প্রবেশ করতে বাধ্য করবে প্রতি বার যখন তারা একটি ব্যক্তিগত বার্তা পাঠাচ্ছে। শুধুমাত্র সেই ব্যবহারকারীরা যাদের পোস্টের সংখ্যা নির্ধারিত সংখ্যার নিচে, তাদের কোড প্রবেশ করতে হবে - এটি স্বয়ংক্রিয় স্প্যামিং স্ক্রিপ্টের বিরুদ্ধে লড়াই করতে সহায়তা করবে।';

$helptxt['pm_posts_per_hour'] = 'এটি একটি ঘণ্টার সময়সীমায় একটি ব্যবহারকারীর দ্বারা পাঠানো ব্যক্তিগত বার্তার সংখ্যা সীমাবদ্ধ করবে। এটি প্রশাসক বা মডারেটরদের উপর প্রভাব ফেলে না।';

$helptxt['default_personal_text'] = 'নতুন ব্যবহারকারীর জন্য ডিফল্ট টেক্সট সেট করে যা তাদের &quot;ব্যক্তিগত টেক্সট&quot; হবে। এই সেটিংটি তখন উপলব্ধ নয় যখন ব্যক্তিগত টেক্সট অক্ষম থাকে, বা যখন ব্যবহারকারীরা নিবন্ধনের সময় নিজেদের জন্য ব্যক্তিগত টেক্সট সেট করতে পারে।';

$helptxt['registration_method'] = 'এই সেটিংটি নির্ধারণ করে যে আপনার ফোরামে যোগ দিতে ইচ্ছুক ব্যক্তিদের জন্য কী নিবন্ধনের পদ্ধতি ব্যবহার করা হবে। আপনি নিম্নলিখিত থেকে নির্বাচন করতে পারেন:<br><br>
	<ul class="normallist">
		<li>
			<strong>নিবন্ধন অক্ষম</strong><br>
				নিবন্ধন প্রক্রিয়া অক্ষম করে, যার মানে হল যে নতুন সদস্যরা আপনার ফোরামে যোগ দিতে নিবন্ধন করতে পারবে না।<br>
		</li><li>
			<strong>তাত্ক্ষণিক নিবন্ধন</strong><br>
				নতুন সদস্যরা আপনার ফোরামে নিবন্ধন করার পরপরই লগইন এবং পোস্ট করতে পারবে।<br>
		</li><li>
			<strong>ইমেইল সক্রিয়করণ</strong><br>
				যখন এই সেটিংটি সক্ষম হয়, তখন ফোরামে নিবন্ধন করা যে কোনও সদস্যের জন্য একটি সক্রিয়করণ লিঙ্ক তাদের ইমেইলে পাঠানো হবে, যা তাদের ক্লিক করতে হবে পূর্ণ সদস্য হতে।<br>
		</li><li>
			<strong>অ্যাডমিন অনুমোদন</strong><br>
				এই সেটিংটি নিশ্চিত করবে যে আপনার ফোরামে নিবন্ধন করা সমস্ত নতুন সদস্যদের অ্যাডমিন দ্বারা অনুমোদিত হতে হবে তাদের সদস্য হওয়ার আগে।
		</li>
	</ul>';

$helptxt['send_validation_onChange'] = 'যখন এই সেটিংটি চেক করা হয়, সমস্ত সদস্য যারা তাদের প্রোফাইলে ইমেইল ঠিকানা পরিবর্তন করবে তাদের অ্যাকাউন্ট পুনরায় সক্রিয় করতে হবে সেই ঠিকানায় পাঠানো একটি ইমেইল থেকে।';

$helptxt['approveAccountDeletion'] = 'যখন এই সেটিংটি চেক করা হয়, তখন যে কোনও ব্যবহারকারীর নিজের অ্যাকাউন্ট মুছে ফেলার অনুরোধ একটি প্রশাসকের দ্বারা অনুমোদিত হতে হবে।';

$helptxt['send_welcomeEmail'] = 'যখন এই সেটিংটি সক্ষম হয়, সমস্ত নতুন সদস্যদের একটি ইমেইল পাঠানো হবে যা তাদের আপনার সম্প্রদায়ে স্বাগতম জানায়।';

$helptxt['password_strength'] = 'এই সেটিংটি আপনার ফোরাম ব্যবহারকারীদের দ্বারা নির্বাচিত পাসওয়ার্ডের জন্য প্রয়োজনীয় শক্তি নির্ধারণ করে। পাসওয়ার্ড যত শক্তিশালী হবে, সদস্যদের অ্যাকাউন্টগুলি ক্ষতিগ্রস্ত করা তত কঠিন হবে।
	এর সম্ভাব্য সেটিংগুলি হল:
	<ul class="normallist">
		<li><strong>নিম্ন:</strong> পাসওয়ার্ডটি কমপক্ষে চারটি অক্ষরের দীর্ঘ হতে হবে।</li>
		<li><strong>মাঝারি:</strong> পাসওয়ার্ডটি কমপক্ষে আটটি অক্ষরের দীর্ঘ হতে হবে, এবং এটি ব্যবহারকারীর নাম বা ইমেইল ঠিকানার অংশ হতে পারে না।</li>
		<li><strong>উচ্চ:</strong> মাঝারি অনুযায়ী, তবে পাসওয়ার্ডটিতে অবশ্যই বড় এবং ছোট হাতের অক্ষরের মিশ্রণ এবং অন্তত একটি সংখ্যা থাকতে হবে।</li>
	</ul>';

$helptxt['enable_password_conversion'] = 'এই সেটিংটি সক্ষম করে, SMF অন্যান্য ফরম্যাটে সংরক্ষিত পাসওয়ার্ডগুলি সনাক্ত করতে এবং সেগুলিকে SMF দ্বারা ব্যবহৃত ফরম্যাটে রূপান্তর করতে চেষ্টা করবে। সাধারণত এটি SMF-এ রূপান্তরিত ফোরামের জন্য ব্যবহৃত হয়, তবে এর অন্যান্য ব্যবহারও থাকতে পারে। এটি অক্ষম করার ফলে রূপান্তরের পরে একটি ব্যবহারকারী তাদের পাসওয়ার্ড ব্যবহার করে লগইন করতে পারবে না এবং তাদের পাসওয়ার্ড পুনরায় সেট করতে হবে।';

$helptxt['coppaAge'] = 'এই বাক্সে নির্দিষ্ট মানটি নতুন সদস্যদের জন্য সর্বনিম্ন বয়স নির্ধারণ করবে যাতে তারা ফোরামে তাত্ক্ষণিক প্রবেশাধিকার পেতে পারে। 
	নিবন্ধনের সময় তাদেরকে জিজ্ঞাসা করা হবে যে তারা এই বয়সের উপরে কি না, এবং যদি না হয় তবে তাদের আবেদন বাতিল করা হবে বা পিতামাতার অনুমোদনের জন্য স্থগিত রাখা হবে - নির্বাচিত সীমাবদ্ধতার ধরনের উপর নির্ভর করে। 
	যদি এই সেটিংটির জন্য 0 এর মান নির্বাচন করা হয়, তবে সমস্ত অন্যান্য বয়স সীমাবদ্ধতার সেটিংগুলি উপেক্ষা করা হবে।';
$helptxt['coppaType'] = 'যদি বয়সের সীমাবদ্ধতা সক্ষম করা হয়, তবে এই সেটিংটি নির্ধারণ করবে যে সর্বনিম্ন বয়সের নিচে থাকা একটি ব্যবহারকারী আপনার ফোরামে নিবন্ধন করার চেষ্টা করলে কী হবে। দুটি সম্ভাব্য পছন্দ রয়েছে:
	<ul class="normallist">
		<li>
			<strong>তাদের নিবন্ধন বাতিল করুন:</strong><br>
				যে কোনও নতুন সদস্য যিনি সর্বনিম্ন বয়সের নিচে থাকবেন, তাদের নিবন্ধন তাৎক্ষণিকভাবে বাতিল করা হবে।<br>
		</li><li>
			<strong>পিতা/অভিভাবকের অনুমোদন প্রয়োজন</strong><br>
				যে কোনও নতুন সদস্য যিনি নিবন্ধন করার চেষ্টা করছেন এবং সর্বনিম্ন অনুমোদিত বয়সের নিচে আছেন, তাদের অ্যাকাউন্টটি অনুমোদনের জন্য অপেক্ষমাণ হিসাবে চিহ্নিত হবে, এবং তাদের পিতামাতার সদস্য হতে অনুমতি দেওয়ার জন্য একটি ফর্ম প্রদান করা হবে।
				তাদের সেটিংস পৃষ্ঠায় প্রবেশ করা ফোরামের যোগাযোগের বিস্তারিতও প্রদান করা হবে, যাতে তারা মেইল বা ফ্যাক্সের মাধ্যমে ফর্মটি প্রশাসকের কাছে পাঠাতে পারে।
		</li>
	</ul>';

$helptxt['coppaPost'] = 'যোগাযোগের বাক্সগুলি প্রয়োজনীয় যাতে অপ্রাপ্তবয়স্ক নিবন্ধনের জন্য অনুমতি দেওয়া ফর্মগুলি ফোরাম প্রশাসকের কাছে পাঠানো যেতে পারে। এই বিস্তারিত তথ্য সমস্ত নতুন অপ্রাপ্তবয়স্কদের জন্য প্রদর্শিত হবে এবং পিতা/অভিভাবকের অনুমোদনের জন্য প্রয়োজনীয়। অন্তত একটি ডাক ঠিকানা বা ফ্যাক্স নম্বর প্রদান করা আবশ্যক।';

$helptxt['allow_hideOnline'] = 'এই সেটিংটি সক্ষম হলে সমস্ত সদস্য অন্য ব্যবহারকারীদের (প্রশাসকদের ব্যতীত) কাছে তাদের অনলাইন স্থিতি লুকিয়ে রাখতে সক্ষম হবে। এই সেটিংটি অক্ষম করা হলে বিদ্যমান সদস্যদের স্থিতি পরিবর্তন হবে না - এটি কেবল ভবিষ্যতে তাদের নিজেদের লুকিয়ে রাখতে বাধা দেয়।';

$helptxt['meta_keywords'] = 'এই কীওয়ার্ডগুলি প্রতিটি পৃষ্ঠার আউটপুটে পাঠানো হয় যাতে সার্চ ইঞ্জিন (ইত্যাদি) আপনার সাইটের মূল বিষয়বস্তু নির্দেশ করে। এগুলি একটি কমা দ্বারা পৃথক শব্দের তালিকা হওয়া উচিত, এবং HTML ব্যবহার করা উচিত নয়।';

$helptxt['latest_themes'] = 'এই এলাকায় <a href="https://www.simplemachines.org/" target="_blank" rel="noopener">www.simplemachines.org</a> থেকে কিছু সর্বশেষ এবং সবচেয়ে জনপ্রিয় থিম প্রদর্শিত হয়। তবে, যদি আপনার কম্পিউটার <a href="https://www.simplemachines.org/" target="_blank" rel="noopener">www.simplemachines.org</a> খুঁজে না পায়, তবে এটি সঠিকভাবে প্রদর্শিত নাও হতে পারে।';

$helptxt['secret_why_blank'] = 'আপনার নিরাপত্তার জন্য, আপনার পাসওয়ার্ড এবং আপনার গোপন প্রশ্নের উত্তর এনক্রিপ্ট করা হয়েছে যাতে SMF সফটওয়্যার কখনও আপনাকে বা অন্য কাউকে তাদের সম্পর্কে জানাতে না পারে।';

$helptxt['moderator_why_missing'] = 'যেহেতু মডারেশন বোর্ড-দ্বারা-বোর্ড ভিত্তিতে করা হয়, আপনাকে <a href="%1$s?action=admin;area=manageboards" target="_blank" rel="noopener">বোর্ড পরিচালনা ইন্টারফেস</a> থেকে সদস্যদের মডারেটর করতে হবে।';

$helptxt['permissions'] = 'অনুমতিগুলি হল কীভাবে আপনি গোষ্ঠীগুলিকে নির্দিষ্ট কাজগুলি করার অনুমতি দেন বা গোষ্ঠীগুলিকে তা করতে বাধা দেন।<br><br>আপনি চেকবক্সের মাধ্যমে একসাথে একাধিক বোর্ড পরিবর্তন করতে পারেন, অথবা \'সংশোধন করুন\' ক্লিক করে একটি নির্দিষ্ট গোষ্ঠীর অনুমতিগুলি দেখতে পারেন।';

$helptxt['permissions_board'] = 'যদি একটি বোর্ড \'গ্লোবাল\' হিসাবে সেট করা হয়, তবে এর মানে হল যে বোর্ডটির কোন বিশেষ অনুমতি থাকবে না। \'লোকাল\' মানে এটি এর নিজস্ব অনুমতি থাকবে - গ্লোবাল অনুমতিগুলির থেকে আলাদা। এটি আপনাকে একটি বোর্ড রাখতে দেয় যার অন্য বোর্ডের তুলনায় আরও বা কম অনুমতি রয়েছে, প্রতিটি বোর্ডের জন্য সেগুলি সেট করার প্রয়োজন ছাড়াই।';

$helptxt['permissions_quickgroups'] = 'এগুলি আপনাকে &quot;ডিফল্ট&quot; অনুমতি সেটআপগুলি ব্যবহার করতে দেয় - <em>মানক</em> মানে \'কিছু বিশেষ নয়\', <em>সীমাবদ্ধ</em> মানে \'একজন অতিথির মতো\', <em>মডারেটর</em> মানে \'একজন মডারেটরের কাছে যা আছে\', এবং শেষ পর্যন্ত <em>রক্ষণাবেক্ষণ</em> মানে \'প্রশাসকের অনুমতির খুব কাছাকাছি অনুমতি\'।';

$helptxt['permissions_deny'] = 'অনুমতি অস্বীকৃতি দেওয়া তখন উপকারী হতে পারে যখন আপনি কিছু সদস্যের থেকে অনুমতি প্রত্যাহার করতে চান। আপনি যাদের অনুমতি অস্বীকৃতি দিতে চান তাদের সদস্যদের জন্য একটি \'অস্বীকৃতি\'-অনুমতি সহ একটি সদস্যগোষ্ঠী যোগ করতে পারেন।<br><br><strong>যত্ন সহকারে ব্যবহার করুন</strong>, একটি অস্বীকৃত অনুমতি অস্বীকৃত থাকবে, সদস্য যেকোনো অন্যান্য সদস্যগোষ্ঠীতে থাকলেও।';

$helptxt['permissions_postgroups'] = 'পোস্টের সংখ্যা ভিত্তিক গোষ্ঠীর জন্য অনুমতি সক্রিয় করা আপনাকে সেই সদস্যদের জন্য অনুমতি নির্ধারণ করতে দেবে যারা একটি নির্দিষ্ট সংখ্যক বার্তা পোস্ট করেছেন। পোস্ট সংখ্যা ভিত্তিক গোষ্ঠীর অনুমতিগুলি সাধারণ সদস্যগোষ্ঠীর অনুমতিতে <em>যোগ করা হয়</em>।';
$helptxt['membergroup_guests'] = 'গেস্টস সদস্যগোষ্ঠী হল সকল ব্যবহারকারীর জন্য যারা লগ ইন করেননি।';

$helptxt['membergroup_regular_members'] = 'নিয়মিত সদস্যগোষ্ঠীতে সব সদস্য অন্তর্ভুক্ত হয় যারা লগ ইন করেছেন, কিন্তু যাদের কোন প্রাথমিক সদস্যগোষ্ঠী নির্ধারিত নেই।';

$helptxt['membergroup_administrator'] = 'প্রশাসক, সংজ্ঞা অনুযায়ী, কিছুই করতে পারে এবং যে কোনও বোর্ড দেখতে পারে। প্রশাসকের জন্য কোন অনুমতি সেটিংস নেই।';

$helptxt['membergroup_moderator'] = 'মডারেটর সদস্যগোষ্ঠী একটি বিশেষ সদস্যগোষ্ঠী। এই গোষ্ঠীর জন্য নির্ধারিত অনুমতি এবং সেটিংস মডারেটরদের উপর প্রযোজ্য তবে শুধুমাত্র <em>যে বোর্ডগুলো তারা মডারেট করে</em>। এই বোর্ডগুলির বাইরে তারা অন্য যেকোনো সদস্যের মতো। মনে রাখবেন, এই গোষ্ঠীর জন্য অনুমতিগুলি যেকোনো গোষ্ঠীর উপরও প্রযোজ্য যা একটি বোর্ড মডারেট করার জন্য নির্ধারিত।';

$helptxt['membergroups'] = 'SMF-এ আপনার সদস্যদের অন্তর্ভুক্ত হওয়ার জন্য দুটি ধরনের গোষ্ঠী রয়েছে। এগুলি হল:
	<ul class="normallist">
		<li><strong>নিয়মিত গোষ্ঠী:</strong> একটি নিয়মিত গোষ্ঠী হল একটি গোষ্ঠী যেখানে সদস্যদের স্বয়ংক্রিয়ভাবে রাখা হয় না। একটি সদস্যকে একটি গোষ্ঠীতে অন্তর্ভুক্ত করতে, তাদের প্রোফাইলে যান এবং &quot;অ্যাকাউন্ট সেটিংস&quot; ক্লিক করুন। এখান থেকে আপনি তাদের জন্য যেকোনো সংখ্যক নিয়মিত গোষ্ঠী নির্ধারণ করতে পারেন।</li>
		<li><strong>পোস্ট গোষ্ঠী:</strong> নিয়মিত গোষ্ঠীর বিপরীতে, পোস্ট ভিত্তিক গোষ্ঠীগুলি নির্ধারণ করা যায় না। এর পরিবর্তে, সদস্যরা স্বয়ংক্রিয়ভাবে একটি পোস্ট ভিত্তিক গোষ্ঠীতে অন্তর্ভুক্ত হন যখন তারা সেই গোষ্ঠীতে অন্তর্ভুক্ত হওয়ার জন্য প্রয়োজনীয় সর্বনিম্ন পোস্টের সংখ্যা পৌঁছে।</li>
	</ul>';
	
$helptxt['calendar_how_edit'] = 'আপনি তাদের নামের পাশে থাকা লাল তারকা (*) ক্লিক করে এই ইভেন্টগুলি সম্পাদনা করতে পারেন।';

$helptxt['maintenance_backup'] = 'এই এলাকা আপনাকে আপনার ফোরামের সমস্ত পোস্ট, সেটিংস, সদস্য এবং অন্যান্য তথ্যের একটি কপি একটি খুব বড় ফাইলে সংরক্ষণ করার অনুমতি দেয়।<br><br>নিরাপত্তা এবং সুরক্ষার জন্য, এটি প্রায়শই, সম্ভবত সাপ্তাহিকভাবে, করা সুপারিশ করা হয়।';

$helptxt['maintenance_rot'] = 'এটি আপনাকে <strong>সম্পূর্ণরূপে</strong> এবং <strong>অবিচলিতভাবে</strong> পুরানো বিষয়বস্তু মুছে ফেলতে দেয়। এটি সুপারিশ করা হয় যে আপনি প্রথমে একটি ব্যাকআপ তৈরি করার চেষ্টা করুন, যদি আপনি কিছু মুছে ফেলেন যা আপনি মুছতে চাননি।<br><br><strong>এই সেটিংটি যত্ন সহকারে ব্যবহার করুন।</strong>';

$helptxt['maintenance_members'] = 'এটি আপনাকে <strong>সম্পূর্ণরূপে</strong> এবং <strong>অবিচলিতভাবে</strong> সদস্য অ্যাকাউন্টগুলি আপনার ফোরাম থেকে মুছে ফেলতে দেয়। এটি <strong>অত্যন্ত</strong> সুপারিশ করা হয় যে আপনি প্রথমে একটি ব্যাকআপ তৈরি করার চেষ্টা করুন, যদি আপনি কিছু মুছে ফেলেন যা আপনি মুছতে চাননি।<br><br><strong>এই সেটিংটি যত্ন সহকারে ব্যবহার করুন।</strong>';

$helptxt['avatar_server_stored'] = 'এটি আপনার সদস্যদের আপনার সার্ভারে সংরক্ষিত অ্যাভাটারগুলি থেকে নির্বাচন করতে দেয়। ডিফল্টভাবে, এগুলি "avatars" ডিরেক্টরিতে সংরক্ষিত হয়।<br>একটি টিপ হিসাবে, যদি আপনি সেই ফোল্ডারে ডিরেক্টরি তৈরি করেন, তবে আপনি অ্যাভাটারগুলির "শ্রেণী" তৈরি করতে পারেন।';

$helptxt['avatar_external'] = 'এটি সক্ষম হলে, আপনার সদস্যরা তাদের নিজস্ব অ্যাভাটারের জন্য একটি URL টাইপ করতে পারেন। এর downside হল, কিছু ক্ষেত্রে, তারা অত্যধিক বড় অ্যাভাটার ব্যবহার করতে পারে বা এমন ছবি উপস্থাপন করতে পারে যা আপনি আপনার ফোরামে দেখতে চান না।';

$helptxt['avatar_download_external'] = 'এই সেটিংটি সক্ষম হলে, ব্যবহারকারীদের দ্বারা প্রদত্ত URL থেকে বাইরের অ্যাভাটারগুলি ডাউনলোড করা হবে। সফল হলে, অ্যাভাটারগুলি আপলোড করা অ্যাভাটারের মতো আচরণ করা হবে।';

$helptxt['avatar_action_too_large'] = 'এই সেটিংটি আপনাকে খুব বড় ছবি (অন্যান্য সাইট থেকে) অস্বীকার করতে দেয়, বা ব্যবহারকারীর ব্রাউজারকে সেগুলি পুনঃআকার দিতে বলে, বা সেগুলিকে আপনার সার্ভারে ডাউনলোড করতে বলে।<br><br>যদি ব্যবহারকারীরা তাদের অ্যাভাটার হিসাবে খুব বড় ছবি রাখে এবং ব্রাউজারে পুনঃআকার দেয়, তবে এটি আপনার ব্যবহারকারীদের জন্য খুব ধীর লোডিং করতে পারে - এটি আসলে ফাইলটি পুনঃআকার দেয় না, এটি কেবল ছোট দেখায়। তাই একটি ডিজিটাল ছবি, উদাহরণস্বরূপ, এখনও পুরোপুরি লোড হবে এবং তারপর কেবল প্রদর্শনের সময় পুনঃআকার দেওয়া হবে - তাই ব্যবহারকারীদের জন্য এটি বেশ ধীর হতে পারে এবং অনেক ব্যান্ডউইথ ব্যবহার করতে পারে।<br><br>অন্যদিকে, এগুলি ডাউনলোড করা মানে আপনার ব্যান্ডউইথ এবং সার্ভার স্পেস ব্যবহার করা, তবে আপনি নিশ্চিত করেন যে ছবিগুলি ছোট, তাই এটি ব্যবহারকারীদের জন্য দ্রুত হওয়া উচিত। (দ্রষ্টব্য: ডাউনলোড এবং পুনঃআকার দেওয়ার জন্য GD লাইব্রেরি বা ImageMagick ব্যবহার করা প্রয়োজন, Imagick বা MagickWand এক্সটেনশনের মাধ্যমে)';
$helptxt['avatar_upload'] = 'এই সেটিংটি &quot;বাহ্যিক অ্যাভাটার&quot; এর মতো, তবে আপনার কাছে অ্যাভাটারগুলির উপর আরও ভাল নিয়ন্ত্রণ রয়েছে, সেগুলিকে পুনঃআকার দেওয়ার জন্য আরও ভাল সময় রয়েছে, এবং আপনার সদস্যদের অ্যাভাটার রাখার জন্য কোথাও থাকতে হবে না।<br><br>তবে, এর downside হল যে এটি আপনার সার্ভারে অনেক স্থান নিতে পারে।';

$helptxt['avatar_download_png'] = 'PNG ফাইলগুলি বড়, কিন্তু আরও ভাল গুণমানের সংকোচন অফার করে। যদি এটি অচেক করা হয়, তবে JPEG ব্যবহার করা হবে - যা প্রায়শই ছোট হয়, তবে এর গুণমান কম বা অস্পষ্ট হতে পারে।';

$helptxt['disableHostnameLookup'] = 'এটি হোস্ট নাম লুকআপ অক্ষম করে, যা কিছু সার্ভারে খুব ধীর। মনে রাখবেন, এটি নিষিদ্ধকরণকে কম কার্যকর করে তুলবে।';

$helptxt['smiley_sameall'] = 'যদি "সমস্ত সেটের জন্য একই চিত্র" চেক করা হয়, তবে একই চিত্র আপনার সমস্ত স্মাইলি সেটে যুক্ত হবে। যদি আপনি বাক্সটি আনচেক করেন, তবে প্রতিটি ইনস্টল করা স্মাইলি সেটের জন্য একটি ভিন্ন চিত্র আপলোড করা যেতে পারে। মনে রাখবেন, প্রতিটি স্মাইলি সেটের জন্য একটি চিত্র সরবরাহ করতে হবে।';

$helptxt['search_weight_frequency'] = 'ওজনের ফ্যাক্টরগুলি একটি অনুসন্ধান ফলাফলের প্রাসঙ্গিকতা নির্ধারণ করতে ব্যবহৃত হয়। এই ওজনের ফ্যাক্টরগুলি পরিবর্তন করুন যাতে আপনার ফোরামের জন্য বিশেষভাবে গুরুত্বপূর্ণ বিষয়গুলির সাথে মেলে। উদাহরণস্বরূপ, একটি সংবাদ সাইটের ফোরাম, \'শেষ মেলানো বার্তার বয়স\' এর জন্য একটি তুলনামূলকভাবে উচ্চ মান চায়। সমস্ত মান একে অপরের সাথে আপেক্ষিক এবং ইতিবাচক পূর্ণসংখ্যা হওয়া উচিত।<br><br>এই ফ্যাক্টরটি মেলানো বার্তাগুলির সংখ্যা গণনা করে এবং সেগুলিকে একটি বিষয়ের মধ্যে মোট বার্তার সংখ্যা দ্বারা ভাগ করে।';
$helptxt['search_weight_age'] = 'ওজনের ফ্যাক্টরগুলি একটি অনুসন্ধান ফলাফলের প্রাসঙ্গিকতা নির্ধারণ করতে ব্যবহৃত হয়। এই ওজনের ফ্যাক্টরগুলি পরিবর্তন করুন যাতে আপনার ফোরামের জন্য বিশেষভাবে গুরুত্বপূর্ণ বিষয়গুলির সাথে মেলে। উদাহরণস্বরূপ, একটি সংবাদ সাইটের ফোরাম, \'শেষ মেলানো বার্তার বয়স\' এর জন্য একটি তুলনামূলকভাবে উচ্চ মান চায়। সমস্ত মান একে অপরের সাথে আপেক্ষিক এবং ইতিবাচক পূর্ণসংখ্যা হওয়া উচিত।<br><br>এই ফ্যাক্টরটি একটি বিষয়ের মধ্যে শেষ মেলানো বার্তার বয়সের মূল্যায়ন করে। যত বেশি সাম্প্রতিক এই বার্তাটি হবে, তত বেশি স্কোর হবে।';

$helptxt['search_weight_length'] = 'ওজনের ফ্যাক্টরগুলি একটি অনুসন্ধান ফলাফলের প্রাসঙ্গিকতা নির্ধারণ করতে ব্যবহৃত হয়। এই ওজনের ফ্যাক্টরগুলি পরিবর্তন করুন যাতে আপনার ফোরামের জন্য বিশেষভাবে গুরুত্বপূর্ণ বিষয়গুলির সাথে মেলে। উদাহরণস্বরূপ, একটি সংবাদ সাইটের ফোরাম, \'শেষ মেলানো বার্তার বয়স\' এর জন্য একটি তুলনামূলকভাবে উচ্চ মান চায়। সমস্ত মান একে অপরের সাথে আপেক্ষিক এবং ইতিবাচক পূর্ণসংখ্যা হওয়া উচিত।<br><br>এই ফ্যাক্টরটি বিষয়ের আকারের উপর ভিত্তি করে। বিষয়ের মধ্যে যত বেশি বার্তা থাকবে, তত বেশি স্কোর হবে।';

$helptxt['search_weight_subject'] = 'ওজনের ফ্যাক্টরগুলি একটি অনুসন্ধান ফলাফলের প্রাসঙ্গিকতা নির্ধারণ করতে ব্যবহৃত হয়। এই ওজনের ফ্যাক্টরগুলি পরিবর্তন করুন যাতে আপনার ফোরামের জন্য বিশেষভাবে গুরুত্বপূর্ণ বিষয়গুলির সাথে মেলে। উদাহরণস্বরূপ, একটি সংবাদ সাইটের ফোরাম, \'শেষ মেলানো বার্তার বয়স\' এর জন্য একটি তুলনামূলকভাবে উচ্চ মান চায়। সমস্ত মান একে অপরের সাথে আপেক্ষিক এবং ইতিবাচক পূর্ণসংখ্যা হওয়া উচিত।<br><br>এই ফ্যাক্টরটি দেখবে যে একটি অনুসন্ধান শব্দ বিষয়ের মধ্যে পাওয়া যায় কিনা।';

$helptxt['search_weight_first_message'] = 'ওজনের ফ্যাক্টরগুলি একটি অনুসন্ধান ফলাফলের প্রাসঙ্গিকতা নির্ধারণ করতে ব্যবহৃত হয়। এই ওজনের ফ্যাক্টরগুলি পরিবর্তন করুন যাতে আপনার ফোরামের জন্য বিশেষভাবে গুরুত্বপূর্ণ বিষয়গুলির সাথে মেলে। উদাহরণস্বরূপ, একটি সংবাদ সাইটের ফোরাম, \'শেষ মেলানো বার্তার বয়স\' এর জন্য একটি তুলনামূলকভাবে উচ্চ মান চায়। সমস্ত মান একে অপরের সাথে আপেক্ষিক এবং ইতিবাচক পূর্ণসংখ্যা হওয়া উচিত।<br><br>এই ফ্যাক্টরটি দেখবে যে একটি বিষয়ের প্রথম বার্তায় একটি মেল পাওয়া যায় কিনা।';

$helptxt['search_weight_sticky'] = 'ওজনের ফ্যাক্টরগুলি একটি অনুসন্ধান ফলাফলের প্রাসঙ্গিকতা নির্ধারণ করতে ব্যবহৃত হয়। এই ওজনের ফ্যাক্টরগুলি পরিবর্তন করুন যাতে আপনার ফোরামের জন্য বিশেষভাবে গুরুত্বপূর্ণ বিষয়গুলির সাথে মেলে। উদাহরণস্বরূপ, একটি সংবাদ সাইটের ফোরাম, \'শেষ মেলানো বার্তার বয়স\' এর জন্য একটি তুলনামূলকভাবে উচ্চ মান চায়। সমস্ত মান একে অপরের সাথে আপেক্ষিক এবং ইতিবাচক পূর্ণসংখ্যা হওয়া উচিত।<br><br>এই ফ্যাক্টরটি দেখবে যে একটি বিষয় স্টিকি কিনা এবং এটি হলে প্রাসঙ্গিকতা স্কোর বাড়িয়ে দেবে।';
$helptxt['search'] = 'এখানে অনুসন্ধান কার্যকারিতার জন্য সমস্ত সেটিংস সামঞ্জস্য করুন।';
$helptxt['search_why_use_index'] = 'একটি অনুসন্ধান সূচক আপনার ফোরামের অনুসন্ধানের কার্যকারিতা অনেক উন্নত করতে পারে। বিশেষ করে যখন একটি ফোরামে বার্তার সংখ্যা বাড়তে থাকে, সূচক ছাড়া অনুসন্ধান করতে অনেক সময় লাগতে পারে এবং আপনার ডাটাবেসে চাপ বাড়িয়ে দিতে পারে। যদি আপনার ফোরামে ৫০,০০০ এর বেশি বার্তা থাকে, তবে আপনার ফোরামের শীর্ষ কার্যকারিতা নিশ্চিত করার জন্য একটি অনুসন্ধান সূচক তৈরি করার কথা বিবেচনা করা উচিত।<br><br>মনে রাখবেন যে একটি অনুসন্ধান সূচক যথেষ্ট স্থান দখল করতে পারে। একটি পূর্ণাঙ্গ সূচক MySQL এবং PostgreSQL এর একটি বিল্ট-ইন সূচক। এটি তুলনামূলকভাবে সংক্ষিপ্ত (বার্তা টেবিলের প্রায় একই আকার), কিন্তু অনেক শব্দ সূচিবদ্ধ নয় এবং কিছু অনুসন্ধান অনুরোধে এটি খুব ধীর হতে পারে। কাস্টম সূচক প্রায়ই বড় (আপনার কনফিগারেশনের উপর নির্ভর করে এটি বার্তা টেবিলের আকারের ৩ গুণ পর্যন্ত হতে পারে), কিন্তু এর কার্যকারিতা পূর্ণাঙ্গ সূচকের চেয়ে ভাল এবং তুলনামূলকভাবে স্থিতিশীল।';

$helptxt['see_admin_ip'] = 'আইপি ঠিকানাগুলি প্রশাসক এবং মডারেটরদের জন্য প্রদর্শিত হয় যাতে পরিচালনা সহজ হয় এবং খারাপ উদ্দেশ্যে থাকা লোকদের ট্র্যাক করা সহজ হয়। মনে রাখবেন যে আইপি ঠিকানাগুলি সর্বদা চিহ্নিতকারী নাও হতে পারে, এবং বেশিরভাগ মানুষের আইপি ঠিকানা সময়ে সময়ে পরিবর্তিত হয়।<br><br>সদস্যদের তাদের নিজের আইপি দেখতে দেওয়া হয়।';

$helptxt['see_member_ip'] = 'আপনার আইপি ঠিকানা কেবল আপনিই এবং মডারেটরদের জন্য প্রদর্শিত হয়। মনে রাখবেন যে এই তথ্য চিহ্নিতকারী নয়, এবং বেশিরভাগ আইপি সময়ে সময়ে পরিবর্তিত হয়।<br><br>আপনি অন্য সদস্যদের আইপি ঠিকানা দেখতে পারবেন না, এবং তারা আপনার আইপি দেখতে পারবে না।';

$helptxt['whytwoip'] = 'SMF ব্যবহারকারীর আইপি ঠিকানা শনাক্ত করতে বিভিন্ন পদ্ধতি ব্যবহার করে। সাধারণত এই দুটি পদ্ধতি একই ঠিকানায় ফলিত হয় কিন্তু কিছু ক্ষেত্রে একাধিক ঠিকানা শনাক্ত হতে পারে। এই ক্ষেত্রে SMF সর্বশেষ দুটি ঠিকানা লগ করে এবং নিষেধাজ্ঞার পরীক্ষার জন্য উভয়টি ব্যবহার করে (ইত্যাদি)। আপনি যে কোন একটি ঠিকানায় ক্লিক করে সেই আইপি ট্র্যাক করতে এবং প্রয়োজনে নিষিদ্ধ করতে পারেন।';

$helptxt['ban_cannot_post'] = '\'পোস্ট করতে পারবে না\' নিষেধাজ্ঞা নিষিদ্ধ ব্যবহারকারীর জন্য ফোরামটি পড়ার জন্য শুধুমাত্র মোডে পরিণত করে। ব্যবহারকারী নতুন বিষয় তৈরি করতে, বিদ্যমান বিষয়গুলিতে উত্তর দিতে, ব্যক্তিগত বার্তা পাঠাতে বা ভোট দিতে পারে না। তবে নিষিদ্ধ ব্যবহারকারী এখনও ব্যক্তিগত বার্তা এবং বিষয়গুলি পড়তে পারে।<br><br>এইভাবে নিষিদ্ধ ব্যবহারকারীদের জন্য একটি সতর্কতা বার্তা প্রদর্শিত হয়।';

$helptxt['posts_and_topics'] = '
	<ul class="normallist">
		<li>
			<strong>পোস্ট সেটিংস</strong><br>
			বার্তা পোস্ট করার সাথে সম্পর্কিত সেটিংস এবং বার্তাগুলি কীভাবে প্রদর্শিত হয় তা পরিবর্তন করুন। এখানে বানান পরীক্ষা সক্ষম করতে পারেন।
		</li><li>
			<strong>বুলেটিন বোর্ড কোড</strong><br>
			ফোরামের বার্তাগুলিকে সঠিক বিন্যাসে দেখানোর জন্য কোড সক্ষম করুন। কোন কোডগুলি অনুমোদিত এবং কোনগুলি নয় তা সমন্বয় করুন।
		</li><li>
			<strong>সেন্সরড শব্দ</strong>
			আপনার ফোরামের ভাষা নিয়ন্ত্রণে রাখতে, আপনি নির্দিষ্ট শব্দগুলি সেন্সর করতে পারেন। এই ফাংশনটি নিষিদ্ধ শব্দগুলিকে নিরীহ সংস্করণে রূপান্তর করতে সক্ষম করে।
		</li><li>
			<strong>বিষয় সেটিংস</strong>
			বিষয়ের সাথে সম্পর্কিত সেটিংস পরিবর্তন করুন। প্রতি পৃষ্ঠায় বিষয়ের সংখ্যা, মুদ্রণ-পৃষ্ঠার দৃশ্য সক্ষম করা হয়েছে কিনা, ইত্যাদি।
		</li>
	</ul>';

$helptxt['spider_mode'] = 'লগিং স্তর সেট করে।<br>
স্ট্যান্ডার্ড - ন্যূনতম স্পাইডার কার্যকলাপ লগ করে।<br>
মডারেট - আরও সঠিক পরিসংখ্যান প্রদান করে।<br>
আগ্রাসী - &quot;মডারেট&quot; এর মতো, তবে প্রতিটি পরিদর্শিত পৃষ্ঠা সম্পর্কে তথ্য লগ করে।';

$helptxt['spider_group'] = 'একটি সীমাবদ্ধ গ্রুপ নির্বাচন করার মাধ্যমে, যখন একটি অতিথি একটি অনুসন্ধান ক্রলার হিসাবে সনাক্ত করা হয়, তখন এটি স্বাভাবিক অতিথির অনুমতিগুলির পাশাপাশি এই গ্রুপের যে কোনও &quot;নিষেধ&quot; অনুমতি স্বয়ংক্রিয়ভাবে বরাদ্দ করা হবে। আপনি এটি ব্যবহার করতে পারেন একটি অনুসন্ধান ইঞ্জিনকে স্বাভাবিক অতিথির চেয়ে কম প্রবেশাধিকার দেওয়ার জন্য। উদাহরণস্বরূপ, আপনি &quot;স্পাইডার&quot; নামক একটি নতুন গ্রুপ তৈরি করতে চাইতে পারেন এবং এখানে সেটি নির্বাচন করতে পারেন। এরপর আপনি সেই গ্রুপের জন্য প্রোফাইল দেখার অনুমতি নিষিদ্ধ করতে পারেন যাতে স্পাইডারগুলি আপনার সদস্যদের প্রোফাইল ইনডেক্স করতে না পারে।<br>মনে রাখবেন: স্পাইডার সনাক্তকরণ নিখুঁত নয় এবং ব্যবহারকারীদের দ্বারা অনুকরণ করা যেতে পারে, তাই এই বৈশিষ্ট্যটি কেবলমাত্র সেই অনুসন্ধান ইঞ্জিনগুলির জন্য সামগ্রী সীমাবদ্ধ করার গ্যারান্টি দেয়নি যা আপনি যুক্ত করেছেন।';

$helptxt['show_spider_online'] = 'এই সেটিংটি আপনাকে নির্বাচন করার অনুমতি দেয় যে স্পাইডারগুলি বোর্ড ইনডেক্স এবং &quot;কিন্তু অনলাইন&quot; পৃষ্ঠায় &quot;কিন্তু অনলাইন&quot; তালিকায় তালিকাভুক্ত করা উচিত কিনা। বিকল্পগুলি হল:
	<ul class="normallist">
		<li>
			<strong>একদমই নয়</strong><br>
			স্পাইডারগুলি সকল ব্যবহারকারীর কাছে অতিথি হিসাবে প্রদর্শিত হবে।
		</li><li>
			<strong>স্পাইডার সংখ্যা দেখান</strong><br>
			বোর্ড ইনডেক্সে বর্তমানে ফোরামে পরিদর্শনকারী স্পাইডারগুলির সংখ্যা প্রদর্শিত হবে।
		</li><li>
			<strong>স্পাইডার নাম দেখান</strong><br>
			প্রতিটি স্পাইডারের নাম প্রকাশিত হবে, যাতে ব্যবহারকারীরা দেখতে পারে বর্তমানে কতগুলি স্পাইডার ফোরামে পরিদর্শন করছে - এটি বোর্ড ইনডেক্স এবং &quot;কিন্তু অনলাইন&quot; পৃষ্ঠায় প্রযোজ্য।
		</li><li>
			<strong>স্পাইডার নাম দেখান - কেবল প্রশাসক</strong><br>
			উপরের মতো, তবে কেবল প্রশাসকরা স্পাইডার অবস্থান দেখতে পারবেন - অন্যান্য সকল ব্যবহারকারীর কাছে স্পাইডারগুলি অতিথি হিসাবে প্রদর্শিত হবে।
		</li>
	</ul>';
	
$helptxt['birthday_email'] = 'জন্মদিনের ইমেল বার্তার সূচক নির্বাচন করুন। ইমেল বিষয় এবং ইমেল শরীরের ক্ষেত্রে একটি পূর্বদর্শন প্রদর্শিত হবে।<br><strong>মনে রাখবেন:</strong> এই সেটিংটি নির্বাচন করা স্বয়ংক্রিয়ভাবে জন্মদিনের ইমেলগুলি সক্ষম করে না। জন্মদিনের ইমেলগুলি সক্ষম করতে <a href="%1$s?action=admin;area=scheduledtasks;%3$s=%2$s" target="_blank" rel="noopener">নিয়মিত কাজ</a> পৃষ্ঠাটি ব্যবহার করুন এবং জন্মদিনের ইমেল কাজটি সক্ষম করুন।';

$helptxt['pm_bcc'] = 'একটি ব্যক্তিগত বার্তা পাঠানোর সময় আপনি একটি প্রাপককে BCC (ব্লাইন্ড কার্বন কপি) হিসাবে যোগ করার সিদ্ধান্ত নিতে পারেন। BCC প্রাপকদের পরিচয় বার্তার অন্যান্য প্রাপকদের কাছে প্রকাশিত হয় না।';

$helptxt['move_topics_maintenance'] = 'এটি আপনাকে একটি বোর্ড থেকে অন্য বোর্ডে সমস্ত পোস্ট স্থানান্তর করতে দেবে।';

$helptxt['maintain_reattribute_posts'] = 'আপনি আপনার বোর্ডে অতিথি পোস্টগুলিকে একটি নিবন্ধিত সদস্যের সাথে সম্পর্কিত করতে এই ফাংশনটি ব্যবহার করতে পারেন। এটি উপকারী যদি, উদাহরণস্বরূপ, একজন ব্যবহারকারী তাদের অ্যাকাউন্ট মুছে ফেলে এবং তাদের সিদ্ধান্ত পরিবর্তন করে তাদের পুরানো পোস্টগুলি তাদের অ্যাকাউন্টের সাথে সম্পর্কিত করতে চান।';

$helptxt['chmod_flags'] = 'আপনি নির্বাচিত ফাইলগুলির জন্য যে অনুমতিগুলি সেট করতে চান তা ম্যানুয়ালি সেট করতে পারেন। এটি করতে, chmod মানটিকে একটি সংখ্যাগত (অক্টেট) মান হিসাবে প্রবেশ করুন। মনে রাখবেন - এই ফ্ল্যাগগুলি মাইক্রোসফট উইন্ডোজ অপারেটিং সিস্টেমে কোনো প্রভাব ফেলবে না।';

$helptxt['postmod'] = 'এই পৃষ্ঠাটি moderation দলের সদস্যদের (যাদের যথেষ্ট অনুমতি রয়েছে) যেকোনো পোস্ট এবং বিষয়গুলি অনুমোদন করার অনুমতি দেয়, যাতে সেগুলি প্রদর্শিত হয়।';

$helptxt['field_show_enclosed'] = 'ব্যবহারকারীর ইনপুটকে কিছু টেক্সট বা HTML এর মধ্যে আবদ্ধ করে। এটি আপনাকে আরও ইনস্ট্যান্ট মেসেজ প্রদানকারী, ছবি বা এমবেড ইত্যাদি যোগ করতে দেবে। উদাহরণস্বরূপ:<br><br>
		&lt;a href="https://example.com/{INPUT}"&gt;&lt;img src="{DEFAULT_IMAGES_URL}/icon.png" alt="{INPUT}" /&gt;&lt;/a&gt;<br><br>
		মনে রাখবেন যে আপনি নিম্নলিখিত ভেরিয়েবলগুলি ব্যবহার করতে পারেন:<br>
		<ul class="normallist">
			<li>{INPUT} - ব্যবহারকারীর দ্বারা নির্দিষ্ট ইনপুট।</li>
			<li>{SCRIPTURL} - ফোরামের ওয়েব ঠিকানা।</li>
			<li>{IMAGES_URL} - ব্যবহারকারীর বর্তমান থিমের ছবির ডিরেক্টরির URL।</li>
			<li>{DEFAULT_IMAGES_URL} - ডিফল্ট থিমের ছবির ডিরেক্টরির URL।</li>
			<li>{KEY} - যখন একটি ক্ষেত্রের একাধিক বিকল্প থাকে, এটি চিহ্নিত করতে ব্যবহৃত অনন্য সংখ্যা ID।</li>
		</ul>';

$helptxt['custom_mask'] = 'ইনপুট মাস্ক আপনার ফোরামের নিরাপত্তার জন্য গুরুত্বপূর্ণ। একজন ব্যবহারকারীর ইনপুট যাচাই করা নিশ্চিত করতে সাহায্য করতে পারে যে ডেটা এমনভাবে ব্যবহার করা হচ্ছে না যা আপনি আশা করেন না। আমরা কিছু সহজ নিয়মিত প্রকাশনা প্রদান করেছি নির্দেশিকা হিসাবে।<br><br>
    প্যাটার্নের শুরু এবং শেষ চিহ্নিত করার জন্য ডেলিমিটার প্রয়োজন! এগুলি নীচের উদাহরণগুলিতে টিল্ড (~) হয়।<br><br>
	<div class="smalltext" style="margin: 0 2em">
		&quot;~[A-Za-z]+~&quot; - সমস্ত বড় এবং ছোট হাতের অক্ষর মেলান।<br>
		&quot;~[0-9]+~&quot; - সমস্ত সংখ্যামূলক অক্ষর মেলান।<br>
		&quot;~[A-Za-z0-9]{7}~&quot; - সাতবার সমস্ত বড় এবং ছোট হাতের অক্ষর এবং সংখ্যামূলক অক্ষর মেলান।<br>
		&quot;~[^0-9]?~&quot; - কোন সংখ্যা মেলানো নিষিদ্ধ।<br>
		&quot;~^([A-Fa-f0-9]{3}|[A-Fa-f0-9]{6})$~&quot; - শুধুমাত্র ৩ বা ৬ অক্ষরের হেক্সকোড অনুমোদন করুন।<br>
	</div><br><br>
	অতিরিক্তভাবে, বিশেষ মেটাচরিত্রগুলি ?+*^$ এবং {xx} সংজ্ঞায়িত করা যেতে পারে।
	<div class="smalltext" style="margin: 0 2em">
		? - পূর্ববর্তী প্রকাশনার কোন বা এক মিল।<br>
		+ - পূর্ববর্তী প্রকাশনার এক বা একাধিক মিল।<br>
		* - পূর্ববর্তী প্রকাশনার কোন বা একাধিক মিল।<br>
		{xx} - পূর্ববর্তী প্রকাশনার একটি নির্দিষ্ট সংখ্যা।<br>
		{xx,} - পূর্ববর্তী প্রকাশনার একটি নির্দিষ্ট সংখ্যা বা তার বেশি।<br>
		{,xx} - পূর্ববর্তী প্রকাশনার একটি নির্দিষ্ট সংখ্যা বা তার কম।<br>
		{xx,yy} - পূর্ববর্তী প্রকাশনার দুটি সংখ্যার মধ্যে একটি নির্দিষ্ট মিল।<br>
		^ - স্ট্রিংয়ের শুরু।<br>
		$ - স্ট্রিংয়ের শেষ।<br>
		\ - পরবর্তী অক্ষরকে এড়িয়ে চলে।<br>
	</div><br><br>
	আরও তথ্য এবং উন্নত কৌশলগুলি ইন্টারনেটে পাওয়া যেতে পারে।';
	
$helptxt['topic_move_any'] = 'যদি চেক করা হয়, ব্যবহারকারীরা যে কোনও বোর্ডে বিষয়গুলি স্থানান্তর করতে পারবে যা তারা দেখতে পায়। অন্যথায়, তারা কেবল নতুন বিষয় পোস্ট করতে পারে এমন বোর্ডগুলিতে বিষয়গুলি স্থানান্তর করতে পারবে।';

$helptxt['alert_pm_new'] = 'নতুন ব্যক্তিগত বার্তার বিজ্ঞপ্তিগুলি এলার্টস পেনে প্রদর্শিত হয় না, তবে "আমার বার্তা" তালিকায় প্রদর্শিত হয়।';
$helptxt['alert_event_new'] = 'যদি একটি নতুন ক্যালেন্ডার ইভেন্ট যোগ করা হয় তবে এটি অনুরোধ করা হলে একটি এলার্ট বা ইমেল পাঠাবে। তবে, যদি সেই ইভেন্টটি পোস্ট করা হয় এবং একটি বিষয় যোগ করা হয়, তাহলে আপনি যদি ইতিমধ্যে সেই বোর্ডটি অনুসরণ করে থাকেন তবে ইভেন্টের জন্য এলার্ট পাবেন না - বোর্ডটি অনুসরণ করার এলার্টটি এটি কভার করবে।';

$helptxt['force_ssl'] = '<strong>এটি সক্ষম করার আগে আপনার সার্ভারে SSL এবং HTTPS সঠিকভাবে পরীক্ষা করুন, এটি আপনার ফোরামকে অপ্রবেশযোগ্য করে তুলতে পারে।</strong> এটি সক্ষম করার পর আপনি যদি ফোরামে প্রবেশ করতে না পারেন তবে রক্ষণাবেক্ষণ মোড সক্ষম করুন।<br><br><strong>এই সেটিংটি পরিবর্তন করলে আপনার ফোরামের প্রাথমিক URL আপডেট হবে, পাশাপাশি আপনার থিম ফাইল এবং ছবির URL, স্মাইলি এবং অ্যাভাটারগুলি, আপনার নির্বাচনের উপর ভিত্তি করে http: বা https: এ সেট করা হবে। কাস্টমাইজড URL প্রভাবিত হবে না।</strong>';
$helptxt['image_proxy_enabled'] = 'পূর্ণ SSL অবস্থায় বাহ্যিক ছবিগুলি এমবেড করার জন্য প্রয়োজনীয়।';
$helptxt['image_proxy_secret'] = 'এটি গোপন রাখুন, এটি আপনার ফোরামকে হটলিঙ্কিং ছবিগুলি থেকে রক্ষা করে। বর্তমান হটলিঙ্কড ছবিগুলিকে অকার্যকর করতে এটি পরিবর্তন করুন।';
$helptxt['image_proxy_maxsize'] = 'SSL ইমেজ প্রক্সি সর্বাধিক ইমেজ আকার যা ক্যাশে করবে: বড় ছবিগুলি ক্যাশে করা হবে না। ক্যাশে করা ছবিগুলি আপনার SMF ক্যাশে ফোল্ডারে সংরক্ষিত হয়, তাই নিশ্চিত করুন যে আপনার পর্যাপ্ত ফ্রি স্পেস আছে।';

$helptxt['enable_sm_stats'] = 'যদি সক্ষম হয়, এটি সিম্পল মেশিনসকে আপনার সাইটে মাসে একবার পরিদর্শন করতে দেবে মৌলিক পরিসংখ্যান সংগ্রহ করার জন্য। এটি আমাদের সফটওয়্যারটি অপ্টিমাইজ করার জন্য কোন কনফিগারেশনগুলি নির্বাচন করতে সাহায্য করবে। আরও তথ্যের জন্য আমাদের <a href="https://www.simplemachines.org/about/stats.php" target="_blank" rel="noopener">তথ্য পৃষ্ঠায়</a> যান।';

$helptxt['field_reg_require'] = 'যদি এই ক্ষেত্রটি নিবন্ধনের সময় আবশ্যক হয়, তবে এটি প্রোফাইল পরিবর্তনের সময়ও আবশ্যক হবে।';

$helptxt['translatable_fields'] = 'যদি আপনি আপনার কাস্টম প্রোফাইল ক্ষেত্রগুলির জন্য বহু-ভাষার সমর্থন প্রদান করতে চান তবে আপনি নাম এবং বর্ণনা ক্ষেত্র উভয়েই অনুবাদযোগ্য টোকেন ব্যবহার করতে পারেন।<br><br>
যা কিছু বন্ধনীর মধ্যে <span class="monospace">{}</span> আবদ্ধ থাকবে তা একটি টোকেন হিসাবে বিবেচিত হবে এবং একটি $txt স্ট্রিংয়ের বিরুদ্ধে ম্যাচ করা হবে। উদাহরণস্বরূপ, টোকেন <span class="monospace">{gender}</span> $txt[\'gender\'] এর মান দ্বারা প্রতিস্থাপিত হবে।<br><br>
এটি <strong>অত্যন্ত গুরুত্বপূর্ণ</strong> যে ম্যাচ করা $txt স্ট্রিংটি <strong>সমস্ত</strong> বর্তমানে ইনস্টল করা ভাষায় যোগ করা হয়। এটি করতে, <a href="%1$s?action=admin;area=languages;sa=edit;%3$s=%2$s" class="bbc_link" target="_blank" rel="noopener">ভাষাগুলি সম্পাদনা করুন</a> পৃষ্ঠায় যান এবং প্রতিটি ইনস্টল করা ভাষার জন্য নিম্নলিখিত পদক্ষেপগুলি সম্পন্ন করুন:
<ol class="bbc_list" style="list-style-type: decimal">
	<li>ভাষার নামের পাশে "সম্পাদনা" বোতামে ক্লিক করুন।</li>
	<li>"সম্পাদনা করার জন্য এন্ট্রি নির্বাচন করুন" মেনুতে, "পরিবর্তনগুলি" নির্বাচন করুন।</li>
	<li>নীচে স্ক্রোল করুন এবং "আরেকটি আইটেম যোগ করুন" বোতামে ক্লিক করুন।</li>
	<li>আপনার নতুন স্ট্রিং যোগ করার জন্য নির্দেশাবলী অনুসরণ করুন।</li>
</ol>';

// argument(s): $boarddir, $boardurl
$helptxt['cron_is_real_cron'] = 'ডিফল্টভাবে, SMF প্রতিটি পৃষ্ঠায় একটি ছোট জাভাস্ক্রিপ্ট যোগ করে যা ব্যবহারকারীর ব্রাউজারকে SMF এর cron.php কে পটভূমিতে চালানোর জন্য প্ররোচিত করে। এই পদ্ধতি SMF কে নিয়মিত ভিত্তিতে তার নির্ধারিত কাজগুলি সম্পাদন করতে দেয়, প্রশাসকের কাছে কোনও অতিরিক্ত সার্ভার কনফিগারেশন করার প্রয়োজন ছাড়াই। তবে, কিছু প্রশাসক তাদের সার্ভারগুলি সরাসরি cron.php চালানোর জন্য কনফিগার করতে পছন্দ করতে পারেন। আপনি যদি এটি করে থাকেন, তবে আপনি জাভাস্ক্রিপ্ট পদ্ধতিটি অক্ষম করতে পারেন।<br><br><strong>দ্রষ্টব্য:</strong> আপনার সার্ভারকে এইভাবে নির্ধারিত কাজগুলি চালানোর জন্য কনফিগার করা SMF এর মধ্যে থেকে করা যায় না। আপনাকে এটি করতে আপনার সার্ভার কনফিগারেশন সফ্টওয়্যার ব্যবহার করতে হবে। এই উদ্দেশ্যে সাধারণ সরঞ্জামগুলির মধ্যে রয়েছে <code>cron</code> (লিনাক্স সার্ভারের জন্য), <code>schtasks.exe</code> (উইন্ডোজ সার্ভারের জন্য), এবং <code>launchd</code> (ম্যাকওএস সার্ভারের জন্য)। বেশিরভাগ ওয়েব হোস্টিং কোম্পানি তাদের গ্রাহকদের এই সরঞ্জাগুলিতে অ্যাক্সেস দেওয়ার জন্য কিছু ধরনের নিয়ন্ত্রণ প্যানেল ইন্টারফেস প্রদান করে।<br><br>আপনার ফোরামের cron.php এর পথ এবং URL হল:<br>পথ: %1$s/cron.php<br>URL: %2$s/cron.php';

$helptxt['languages_txt'] = 'এই ভাষার এন্ট্রিগুলি SMF জুড়ে বিভিন্ন ভাষার জন্য স্থানীয়কৃত টেক্সট সংজ্ঞায়িত করতে ব্যবহৃত হয়।<br><br>যদি আপনি একটি এন্ট্রিতে <code>&#37;1$s</code> এর মতো একটি মান দেখতে পান, তবে এটি একটি প্লেসহোল্ডার যা SMF রানটাইমে একটি বাস্তব মান দিয়ে পূর্ণ করে। আপনার কাস্টমাইজড টেক্সটে এই ধরনের প্লেসহোল্ডারগুলি রাখতে নিশ্চিত করুন।';

$helptxt['languages_helptxt'] = 'এই ভাষার এন্ট্রিগুলি ভাসমান সাহায্য টেক্সট পপআপ (যেমন এইটি) প্রদর্শনের জন্য ব্যবহৃত হয়।';

$helptxt['languages_editortxt'] = 'এই ভাষার এন্ট্রিগুলি পোস্ট সম্পাদকীয় উপাদানের জন্য ব্যবহৃত হয়।';

$helptxt['languages_tztxt'] = 'এই ভাষার এন্ট্রিগুলি সময় অঞ্চলের জন্য বর্ণনা তৈরি করতে ব্যবহৃত হয়।<br><br>উদাহরণস্বরূপ, <code>Europe_Western</code> স্ট্রিংটি <code>daylight_saving_time_false</code> স্ট্রিংয়ের সাথে মিলিত হয়ে "Western European Standard Time" তৈরি করতে পারে।<br><br>দ্রষ্টব্য: যদি কোনও নির্দিষ্ট সময় অঞ্চলের জন্য বর্ণনা প্রদান করা না হয়, তবে SMF সেই সময় অঞ্চলের মধ্যে অবস্থানের একটি তালিকা ব্যবহার করে একটি বর্ণনা তৈরি করবে।';

$helptxt['languages_txt_for_timezones'] = 'এই ভাষার এন্ট্রিগুলি আপনাকে নিম্নলিখিতগুলি করতে দেয়:<br><ol class="bbc_list" style="list-style-type: decimal;"><li>যেখানে সময় অঞ্চলের সাথে সম্পর্কিত প্রসঙ্গে ব্যবহার করা হতে পারে সেখানে পৃথক অবস্থানের জন্য প্রদর্শিত নামগুলি সম্পাদনা করুন। উদাহরণস্বরূপ, আপনি SMF কে "Thule" এর পরিবর্তে "America/Thule" অবস্থানের জন্য "Qaanaaq" দেখাতে বলতে পারেন।</li><li>বিভিন্ন দেশের জন্য প্রদর্শিত নামগুলি সম্পাদনা করুন। এটি সংশ্লিষ্ট <code>iso3166[]</code> স্ট্রিং সম্পাদনা করে করা যেতে পারে।</li></ol>';

$helptxt['languages_txt_for_email_templates'] = 'এই ভাষার এন্ট্রিগুলি SMF দ্বারা আপনার সদস্যদের পাঠানো ইমেইল বার্তাগুলি তৈরি করতে ব্যবহৃত হয়।';

$helptxt['languages_native_name'] = 'ভাষাটির নিজস্ব স্ক্রিপ্টে নিজস্ব নাম।';

$helptxt['languages_character_set'] = 'এই ভাষার জন্য ব্যবহৃত অক্ষর এনকোডিং। SMF 2.1 থেকে, এটি সর্বদা "UTF-8" হওয়া উচিত।';
$helptxt['languages_locale'] = 'লোকেল কোডটি বিভিন্ন ফরম্যাটিং ঐতিহ্য ইত্যাদি নির্ধারণ করতে ব্যবহৃত হয়।<br><br>লোকেল কোড সাধারণত একটি দুই অক্ষরের ভাষার কোডের রূপে থাকে, যা একটি আন্ডারস্কোর এবং একটি দুই অক্ষরের দেশের কোড দ্বারা অনুসরণ করা হতে পারে। উদাহরণস্বরূপ, <code>en</code> সাধারণ ইংরেজিকে চিহ্নিত করবে, যখন <code>en_AU</code> বিশেষভাবে অস্ট্রেলিয়ান ইংরেজিকে চিহ্নিত করবে।';

$helptxt['languages_rtl'] = 'যদি এই ভাষাটি ডান থেকে বামে পড়া হয় (যেমন: হিব্রু, আরবি) তবে এখানে "1" প্রবেশ করুন। বাম থেকে ডানে পড়া ভাষাগুলির জন্য এটি "0" রেখে দিন।';

$helptxt['languages_dictionary'] = 'এটি প্রধান ভাষার অভিধান সংজ্ঞায়িত করে যা <a href="https://php.net/function.pspell-new" target="_blank" rel="noopener">pSpell</a> বানান পরীক্ষক দ্বারা ব্যবহৃত হবে (যদি ইনস্টল করা থাকে)।';

$helptxt['languages_recaptcha'] = 'reCAPTCHA যাচাইকরণ উইজেটের জন্য ব্যবহৃত ভাষার কোড।<br><br>এর <a href="https://developers.google.com/recaptcha/docs/language" target="_blank" rel="noopener" class="bbc_link">সমর্থিত ভাষার তালিকা</a> এর জন্য গুগলের reCAPTCHA ডকুমেন্টেশন দেখুন।';
// ইউরোপীয় ইউনিয়নের GDPR পৃষ্ঠা বিভিন্ন ভাষায় বিদ্যমান; URL এর শেষে ভাষার কোড পরিবর্তন করুন
$helptxt['requireAgreement'] = 'এই সেটিংটি <a href="https://ec.europa.eu/info/law/law-topic/data-protection/eu-data-protection-rules_en" target="_blank" rel="noopener" class="bbc_link">GDPR</a> এর নিয়মগুলি মেনে চলার জন্য সক্ষম করা সুপারিশ করা হয়।';

// ইউরোপীয় ইউনিয়নের GDPR পৃষ্ঠা বিভিন্ন ভাষায় বিদ্যমান; URL এর শেষে ভাষার কোড পরিবর্তন করুন
$helptxt['requirePolicyAgreement'] = 'এই সেটিংটি <a href="https://ec.europa.eu/info/law/law-topic/data-protection/eu-data-protection-rules_en" target="_blank" rel="noopener" class="bbc_link">GDPR</a> এর নিয়মগুলি মেনে চলার জন্য সক্ষম করা সুপারিশ করা হয়।';

$helptxt['gravatar'] = 'Gravatar হল গ্লোবাললি রেকগনাইজড অ্যাভাটার। একটি অ্যাকাউন্ট নিবন্ধন করুন <a href="https://www.gravatar.com" target="_blank" rel="noopener">https://www.gravatar.com</a> এ একটি অ্যাভাটার ইমেজ নির্বাচন করতে। এই অ্যাভাটারটি পরে সমস্ত সাইটে উপলব্ধ থাকবে যা গ্রাভাটার সমর্থন করে। যদি আপনার গ্রাভাটার অ্যাকাউন্ট না থাকে, তবে একটি ডিফল্ট ইমেজ ব্যবহার করা হবে।';

?>