<?php
 // সংস্করণ: 2.1.3;  ইনস্টল করুন

 // এগুলি index.language.php-এর মতোই হওয়া উচিত৷
 $txt['lang_character_set'] = 'UTF-8';
 $txt['lang_rtl'] = '0';

 $txt['install_step_welcome'] = 'স্বাগত';
 $txt['install_step_writable'] = 'লিখনযোগ্য চেক';
 $txt['install_step_forum'] = 'ফোরাম সেটিংস';
 $txt['install_step_databaseset'] = 'ডাটাবেস সেটিংস';
 $txt['install_step_databasechange'] = 'ডাটাবেস জনসংখ্যা';
 $txt['install_step_admin'] = 'অ্যাডমিন অ্যাকাউন্ট';
 $txt['install_step_delete'] = 'ইনস্টল চূড়ান্ত করুন';

 $txt['smf_installer'] = 'SMF ইনস্টলার';
 $txt['installer_language'] = 'ভাষা';
 $txt['installer_language_set'] = 'সেট';
 $txt['congratulations'] = 'অভিনন্দন, ইনস্টলেশন প্রক্রিয়া সম্পূর্ণ!';
 $txt['congratulations_help'] = 'যদি কোনো সময়ে আপনার সমর্থনের প্রয়োজন হয়, অথবা SMF সঠিকভাবে কাজ করতে ব্যর্থ হয়, অনুগ্রহ করে মনে রাখবেন যে <a href="https://www.simplemachines.org/community/index.php" target=  আপনার প্রয়োজন হলে "_blank" rel="noopener">সহায়তা উপলব্ধ</a>।';
 $txt['still_writable'] = 'আপনার ইনস্টলেশন ডিরেক্টরি এখনও লেখার যোগ্য।  এটি chmod করা একটি ভাল ধারণা, যাতে এটি নিরাপত্তার কারণে লেখার যোগ্য না হয়।';
 $txt['delete_installer'] = 'এখন এই install.php ফাইলটি মুছে ফেলতে এখানে ক্লিক করুন।';
 $txt['delete_installer_maybe'] = '<em>(সব সার্ভারে কাজ করে না।)</em>';
 $txt['go_to_your_forum'] = 'এখন আপনি <a href="%1$s">আপনার নতুন ইনস্টল করা ফোরাম</a> দেখতে পারেন এবং এটি ব্যবহার করা শুরু করতে পারেন৷  আপনার প্রথমে নিশ্চিত হওয়া উচিত যে আপনি লগ ইন করেছেন, তারপরে আপনি প্রশাসন কেন্দ্রে প্রবেশ করতে পারবেন।';
 $txt['good_luck'] = 'সৌভাগ্য!<br>সাধারণ মেশিন';

 $txt['install_welcome'] = 'স্বাগত';
 $txt['install_welcome_desc'] = 'SMF-এ স্বাগতম।  এই স্ক্রিপ্টটি আপনাকে %1$s ইনস্টল করার প্রক্রিয়ার মাধ্যমে গাইড করবে৷  আমরা পরবর্তী কয়েকটি ধাপে আপনার ফোরাম সম্পর্কে কিছু বিবরণ সংগ্রহ করব এবং কয়েক মিনিটের পরে আপনার ফোরাম ব্যবহারের জন্য প্রস্তুত হয়ে যাবে।';
 $txt['install_no_https'] = 'আপনার পরিবেশ https স্ট্রিম সমর্থন করে না।   কিছু ফাংশন, যেমন, simplemachines.org থেকে আপডেট পাওয়া, কাজ করবে না।';
 $txt['install_no_mbstring'] = 'আপনার পরিবেশ প্রয়োজনীয় mbstring লাইব্রেরি সমর্থন করে না।   অনুগ্রহ করে mbstring সক্ষম করুন এবং আবার চেষ্টা করুন।';
 $txt['install_no_fileinfo'] = 'আপনার পরিবেশ প্রয়োজনীয় ফাইলইনফো লাইব্রেরি সমর্থন করে না।   অনুগ্রহ করে ফাইলের তথ্য সক্রিয় করুন এবং আবার চেষ্টা করুন।';
 $txt['install_all_lovely'] = 'আমরা আপনার সার্ভারে কিছু প্রাথমিক পরীক্ষা সম্পন্ন করেছি এবং সবকিছু ঠিকঠাক আছে বলে মনে হচ্ছে।  শুধু &quot;চালিয়ে যান&quot;  শুরু করার জন্য নীচের বোতাম।';

 $txt['user_refresh_install'] = 'ফোরাম রিফ্রেশড';
 $txt['user_refresh_install_desc'] = 'ইনস্টল করার সময়, ইনস্টলারটি খুঁজে পেয়েছিল যে (আপনার দেওয়া বিশদ বিবরণ সহ) এই ইনস্টলার তৈরি করতে পারে এমন এক বা একাধিক টেবিল ইতিমধ্যেই বিদ্যমান রয়েছে৷<br>আপনার ইনস্টলেশনে যে কোনো অনুপস্থিত টেবিলগুলি দিয়ে পুনরায় তৈরি করা হয়েছে  ডিফল্ট ডেটা, কিন্তু বিদ্যমান টেবিল থেকে কোনো ডেটা মুছে ফেলা হয়নি।';

 $txt['default_topic_subject'] = 'SMF-এ স্বাগতম!';
 $txt['default_topic_message'] = 'সিম্পল মেশিন ফোরামে স্বাগতম!<br><br>আমরা আশা করি আপনি আপনার ফোরাম ব্যবহার করে উপভোগ করবেন।&nbsp;  আপনার কোনো সমস্যা হলে, অনুগ্রহ করে নির্দ্বিধায় [url=https://www.simplemachines.org/community/index.php]আমাদের সাহায্যের জন্য জিজ্ঞাসা করুন[/url]।<br><br>ধন্যবাদ!<br>সাধারণ  মেশিন';
 $txt['default_board_name'] = 'সাধারণ আলোচনা';
 $txt['default_board_description'] = 'এই বোর্ডের যেকোনো কিছু এবং সবকিছু নিয়ে নির্দ্বিধায় কথা বলুন।';
 $txt['default_category_name'] = 'সাধারণ বিভাগ';
 $txt['default_time_format'] = '%b %d, %Y, %I:%M %p';
 $txt['default_news'] = 'SMF - এইমাত্র ইনস্টল করা হয়েছে!';
 $txt['default_reserved_names'] = 'অ্যাডমিন\nওয়েবমাস্টার\nঅতিথি\nরুট';
 $txt['default_fugue_smileyset_name'] = 'ফুগু'স সেট';
 $txt['default_alienine_smileyset_name'] = 'এলিয়েনাইন'স সেট';
 $txt['default_aaron_smileyset_name'] = 'অ্যারনের সেট';
 $txt['default_akyhne_smileyset_name'] = 'Akyhne এর সেট';
 $txt['default_legacy_smileyset_name'] = '2.0 ডিফল্ট';
 $txt['default_theme_name'] = 'SMF ডিফল্ট থিম - Curve2';
 
 $txt['default_administrator_group'] = 'প্রশাসক';
 $txt['default_global_moderator_group'] = 'গ্লোবাল মডারেটর';
 $txt['default_moderator_group'] = 'মডারেটর';
 $txt['default_newbie_group'] = 'নতুন';
 $txt['default_junior_group'] = 'জুনিয়র  সদস্য';
 $txt['default_full_group'] = 'পূর্ণ সদস্য';
 $txt['default_senior_group'] = 'sr.  সদস্য';
 $txt['default_hero_group'] = 'বীর সদস্য';

 $txt['default_smiley_smiley'] = 'স্মাইলি';
 $txt['default_wink_smiley'] = 'উইঙ্ক';
 $txt['default_cheesy_smiley'] = 'চিজি';
 $txt['default_grin_smiley'] = 'হাসি';
 $txt['default_angry_smiley'] = 'রাগান্বিত';
 $txt['default_sad_smiley'] = 'দুঃখিত';
 $txt['default_shocked_smiley'] = 'শকড';
 $txt['default_cool_smiley'] = 'কুল';
 $txt['default_huh_smiley'] = 'হুহ?';
 $txt['default_roll_eyes_smiley'] = 'চোখ রোল';
 $txt['default_tongue_smiley'] = 'জিহ্বা';
 $txt['default_embarrassed_smiley'] = 'বিব্রত';
 $txt['default_lips_sealed_smiley'] = 'ঠোঁট সিল';
 $txt['default_undecided_smiley'] = 'অনির্ধারিত';
 $txt['default_kiss_smiley'] = 'চুমু';
 $txt['default_cry_smiley'] = 'কান্না';
 $txt['default_evil_smiley'] = 'Evil';
 $txt['default_azn_smiley'] = 'Azn';
 $txt['default_afro_smiley'] = 'আফ্রো';
 $txt['default_laugh_smiley'] = 'হাসি';
 $txt['default_police_smiley'] = 'পুলিশ';
 $txt['default_angel_smiley'] = 'এঞ্জেল';

 $txt['error_message_click'] = 'এখানে ক্লিক করুন';
 $txt['error_message_try_again'] = 'এই ধাপটি আবার চেষ্টা করার জন্য।';
 $txt['error_message_bad_try_again'] = 'যেভাবেই হোক ইনস্টল করার চেষ্টা করুন, কিন্তু মনে রাখবেন যে এটি <em>দৃঢ়ভাবে</em> নিরুৎসাহিত।';

 $txt['install_settings'] = 'ফোরাম সেটিংস';
 $txt['install_settings_info'] = 'এই পৃষ্ঠাটির জন্য আপনাকে আপনার ফোরামের জন্য কয়েকটি মূল সেটিংস সংজ্ঞায়িত করতে হবে।  SMF স্বয়ংক্রিয়ভাবে আপনার জন্য কী সেটিংস সনাক্ত করেছে৷';
 $txt['install_settings_name'] = 'ফোরামের নাম';
 $txt['install_settings_name_info'] = 'এটি আপনার ফোরামের নাম, যেমন।  &quot;দ্য টেস্টিং ফোরাম&quot;।';
 $txt['install_settings_name_default'] = 'আমার সম্প্রদায়';
 $txt['install_settings_url'] = 'ফোরাম URL';
 $txt['install_settings_url_info'] = 'এটি আপনার ফোরামের URL <strong>পরবর্তী \'/\' ছাড়া!</strong>।<br>অধিকাংশ ক্ষেত্রে, আপনি একা এই বাক্সে ডিফল্ট মানটি ছেড়ে দিতে পারেন  - এটা সাধারণত সঠিক।';
 $txt['install_settings_reg_mode'] = 'রেজিস্ট্রেশন মোড';
 $txt['install_settings_reg_modes'] = 'রেজিস্ট্রেশন মোড';
 $txt['install_settings_reg_immediate'] = 'তাত্ক্ষণিক নিবন্ধন';
 $txt['install_settings_reg_email'] = 'ইমেল অ্যাক্টিভেশন';
 $txt['install_settings_reg_admin'] = 'অ্যাডমিন অনুমোদন';
 $txt['install_settings_reg_disabled'] = 'নিবন্ধন নিষ্ক্রিয়';
 $txt['install_settings_reg_mode_info'] = 'এই ক্ষেত্রটি আপনাকে অবাঞ্ছিত নিবন্ধন প্রতিরোধ করার জন্য ইনস্টলেশনের নিবন্ধকরণের মোড পরিবর্তন করতে দেয়।';
 $txt['install_settings_compress'] = 'Gzip আউটপুট';
 $txt['install_settings_compress_title'] = 'ব্যান্ডউইথ সংরক্ষণ করতে আউটপুট সংকুচিত করুন।';
 // এই স্ট্রিংটিতে, আপনি "PASS" শব্দটি অনুবাদ করতে পারেন যা পরীক্ষায় উত্তীর্ণ হলে এটি যা বলে তা পরিবর্তন করতে।
 $txt['install_settings_compress_info'] = 'এই ফাংশনটি সমস্ত সার্ভারে সঠিকভাবে কাজ করে না, তবে এটি আপনাকে অনেক ব্যান্ডউইথ সংরক্ষণ করতে পারে৷<br>ক্লিক করুন <a href="install.php?obgz=1&amp;pass_string=PASS"  onclick="return reqWin(this.href, 200, 60);"  এটা পরীক্ষা করতে target="_blank" rel="noopener">এখানে</a>  (এটা শুধু "PASS" বলতে হবে।)';
 $txt['install_settings_dbsession'] = 'ডাটাবেস সেশন';
 $txt['install_settings_dbsession_title'] = 'ফাইল ব্যবহার না করে সেশনের জন্য ডাটাবেস ব্যবহার করুন।';
 $txt['install_settings_dbsession_info1'] = 'এই বৈশিষ্ট্যটি প্রায় সবসময়ই সেরা, কারণ এটি সেশনগুলিকে আরও নির্ভরযোগ্য করে তোলে।';
 $txt['install_settings_dbsession_info2'] = 'এই বৈশিষ্ট্যটি সাধারণত একটি ভাল ধারণা, তবে এটি এই সার্ভারে সঠিকভাবে কাজ নাও করতে পারে।';
 $txt['install_settings_stats'] = 'স্ট্যাট সংগ্রহের অনুমতি দিন';
 $txt['install_settings_stats_title'] = 'সাধারণ মেশিনগুলিকে মাসিক মৌলিক পরিসংখ্যান সংগ্রহের অনুমতি দিন';
 $txt['install_settings_stats_info'] = 'সক্রিয় থাকলে, এটি সাধারণ মেশিনগুলিকে মৌলিক পরিসংখ্যান সংগ্রহ করতে মাসে একবার আপনার সাইট দেখার অনুমতি দেবে৷  এটি কোন কনফিগারেশনের জন্য সফ্টওয়্যারটিকে অপ্টিমাইজ করতে হবে সে বিষয়ে সিদ্ধান্ত নিতে আমাদের সাহায্য করবে৷  আরও তথ্যের জন্য অনুগ্রহ করে আমাদের <a href="https://www.simplemachines.org/about/stats.php" target="_blank" rel="noopener">তথ্য পৃষ্ঠা</a> দেখুন।';
 $txt['install_settings_proceed'] = 'এগিয়ে যান';

 $txt['db_settings'] = 'ডাটাবেস সার্ভার সেটিংস';
 $txt['db_settings_info'] = 'এগুলি আপনার ডাটাবেস সার্ভারের জন্য ব্যবহার করার জন্য সেটিংস।  আপনি যদি মানগুলি না জানেন তবে আপনার হোস্টকে জিজ্ঞাসা করা উচিত যে সেগুলি কী।';
 $txt['db_settings_type'] = 'ডাটাবেস টাইপ';
 $txt['db_settings_type_info'] = 'একাধিক সমর্থিত ডাটাবেস প্রকার সনাক্ত করা হয়েছে, আপনি কোনটি ব্যবহার করতে চান?  অনুগ্রহ করে মনে রাখবেন যে একই PostgreSQL ডাটাবেসে নতুন SMF সংস্করণ সহ প্রাক-SMF 2.0 RC3 চালানো সমর্থিত নয়।  সেক্ষেত্রে আপনাকে আপনার পুরানো ইনস্টলেশন আপগ্রেড করতে হবে।';
 $txt['db_settings_server'] = 'সার্ভারের নাম';
 $txt['db_settings_server_info'] = 'এটি প্রায় সবসময়ই লোকালহোস্ট, তাই আপনি যদি না জানেন তাহলে লোকালহোস্ট ব্যবহার করে দেখুন।';
 $txt['db_settings_username'] = 'ব্যবহারকারীর নাম';
 $txt['db_settings_username_info'] = 'এখানে আপনার ডাটাবেসের সাথে সংযোগ করার জন্য যে ব্যবহারকারীর নামটি প্রয়োজন তা পূরণ করুন।<br>এটি কী তা যদি আপনি না জানেন তবে আপনার এফটিপি অ্যাকাউন্টের ব্যবহারকারীর নাম ব্যবহার করে দেখুন, বেশিরভাগ সময় তারা একই থাকে  .';
 $txt['db_settings_password'] = 'পাসওয়ার্ড';
 $txt['db_settings_password_info'] = 'আপনার ডাটাবেসের সাথে সংযোগ করার জন্য আপনার যে পাসওয়ার্ডটি প্রয়োজন তা এখানে রাখুন।<br>আপনি যদি এটি না জানেন তবে আপনার এফটিপি অ্যাকাউন্টে পাসওয়ার্ড ব্যবহার করে দেখুন।';
 $txt['db_settings_database'] = 'ডাটাবেসের নাম';
 $txt['db_settings_database_info'] = 'আপনি SMF এর ডেটা সংরক্ষণ করতে যে ডাটাবেস ব্যবহার করতে চান তার নাম পূরণ করুন।';
 $txt['db_settings_database_info_note'] = 'যদি এই ডাটাবেসটি বিদ্যমান না থাকে তবে এই ইনস্টলার এটি তৈরি করার চেষ্টা করবে।';
 $txt['db_settings_port'] = 'ডাটাবেস পোর্ট';
 $txt['db_settings_port_info'] = 'ডিফল্ট ব্যবহার করতে ফাঁকা ছেড়ে দিন';
 $txt['db_settings_prefix'] = 'টেবিল উপসর্গ';
 $txt['db_settings_prefix_info'] = 'ডাটাবেসের প্রতিটি টেবিলের উপসর্গ।  <strong>একই উপসর্গ সহ দুটি ফোরাম ইনস্টল করবেন না!</strong><br>এই কীটি একটি ডাটাবেসে একাধিক ইনস্টলেশনের অনুমতি দেয়।';
 $txt['db_populate'] = 'পপুলেটেড ডাটাবেস';
 $txt['db_populate_info'] = 'আপনার সেটিংস এখন সংরক্ষিত হয়েছে এবং আপনার ফোরাম চালু ও চালু করার জন্য প্রয়োজনীয় সমস্ত ডেটা দিয়ে ডাটাবেস তৈরি করা হয়েছে।  জনসংখ্যার সারাংশ:';
 $txt['db_populate_info2'] = '&quot;চালিয়ে যান&quot;  অ্যাডমিন অ্যাকাউন্ট তৈরির পৃষ্ঠায় অগ্রসর হতে।';
 $txt['db_populate_inserts'] = 'ঢোকানো হয়েছে %1$d সারি।';
 $txt['db_populate_tables'] = '%1$d টেবিল তৈরি করা হয়েছে।';
 $txt['db_populate_insert_dups'] = '%1$d সদৃশ সন্নিবেশ উপেক্ষা করা হয়েছে।';
 $txt['db_populate_table_dups'] = '%1$d সদৃশ টেবিল উপেক্ষা করা হয়েছে।';

 $txt['user_settings'] = 'আপনার অ্যাকাউন্ট তৈরি করুন';
 $txt['user_settings_info'] = 'ইন্সটলার এখন আপনার জন্য একটি নতুন অ্যাডমিনিস্ট্রেটর অ্যাকাউন্ট তৈরি করবে।';
 $txt['user_settings_username'] = 'আপনার ব্যবহারকারীর নাম';
 $txt['user_settings_username_info'] = 'আপনি যে নাম দিয়ে লগইন করতে চান সেটি বেছে নিন।<br>এটি পরে পরিবর্তন করা যেতে পারে।';
 $txt['user_settings_password'] = 'পাসওয়ার্ড';
 $txt['user_settings_password_info'] = 'এখানে আপনার পছন্দের পাসওয়ার্ডটি পূরণ করুন এবং ভালোভাবে মনে রাখবেন!';
 $txt['user_settings_again'] = 'পাসওয়ার্ড';
 $txt['user_settings_again_info'] = '(শুধুমাত্র যাচাইয়ের জন্য)';
 $txt['user_settings_admin_email'] = 'প্রশাসকের ইমেল ঠিকানা';
 $txt['user_settings_admin_email_info'] = 'আপনার ইমেল ঠিকানা দিন।  এটি অবশ্যই একটি বৈধ ইমেল ঠিকানা হতে হবে!';
 $txt['user_settings_server_email'] = 'ওয়েবমাস্টার ইমেল ঠিকানা';
 $txt['user_settings_server_email_info'] = '<strong>ইমেল ঠিকানা প্রদান করুন যেটি SMF ইমেল পাঠাতে ব্যবহার করবে</strong>।  এটি অবশ্যই একটি বৈধ ইমেল ঠিকানা হতে হবে!';
 $txt['user_settings_database'] = 'ডাটাবেস পাসওয়ার্ড';
 $txt['user_settings_database_info'] = 'নিরাপত্তার কারণে, ইনস্টলারের প্রয়োজন হয় যে আপনি একটি অ্যাডমিনিস্ট্রেটর অ্যাকাউন্ট তৈরি করতে ডাটাবেস পাসওয়ার্ড সরবরাহ করুন।';
 $txt['user_settings_skip'] = 'এড়িয়ে যান';
 $txt['user_settings_skip_sure'] = 'আপনি কি নিশ্চিত যে আপনি অ্যাডমিন অ্যাকাউন্ট তৈরি করা এড়িয়ে যেতে চান?';
 $txt['user_settings_proceed'] = 'শেষ';

 $txt['ftp_checking_writable'] = 'ফাইলগুলি লেখার যোগ্য পরীক্ষা করা হচ্ছে';
 $txt['ftp_setup'] = 'FTP সংযোগ তথ্য';
 $txt['ftp_setup_info'] = 'এই ইনস্টলারটি FTP-এর মাধ্যমে সংযোগ করতে পারে এমন ফাইলগুলিকে ঠিক করতে যা লেখার যোগ্য এবং নয়।  যদি এটি আপনার জন্য কাজ না করে, তাহলে আপনাকে ম্যানুয়ালি প্রবেশ করতে হবে এবং ফাইলগুলি লেখার যোগ্য করে তুলতে হবে।  অনুগ্রহ করে মনে রাখবেন যে এটি এখন SSL সমর্থন করে না।';
 $txt['ftp_setup_why'] = 'এই পদক্ষেপ কিসের জন্য?';
 $txt['ftp_setup_why_info'] = 'এসএমএফ সঠিকভাবে কাজ করার জন্য কিছু ফাইল লেখার যোগ্য হতে হবে।  এই ধাপটি আপনাকে ইনস্টলারকে আপনার জন্য লেখার যোগ্য করে তুলতে দেয়।  যাইহোক, কিছু ক্ষেত্রে এটি কাজ করবে না।  এই ক্ষেত্রে, অনুগ্রহ করে নিম্নলিখিত ফাইলগুলি করুন 777 (লেখাযোগ্য, কিছু হোস্টে 755):';
 $txt['ftp_setup_again'] = 'এই ফাইলগুলি আবার লেখার যোগ্য কিনা পরীক্ষা করার জন্য।';

 $txt['error_missing_files'] = 'এই স্ক্রিপ্টের ডিরেক্টরিতে গুরুত্বপূর্ণ ইনস্টলেশন ফাইল খুঁজে পাওয়া যায়নি!<br><br>দয়া করে নিশ্চিত করুন যে আপনি sql ফাইল সহ সম্পূর্ণ ইনস্টলেশন প্যাকেজ আপলোড করেছেন, এবং তারপরে আবার চেষ্টা করুন।';
 $txt['error_session_save_path'] = 'অনুগ্রহ করে আপনার হোস্টকে জানান যে <strong>session.save_path php.ini তে নির্দিষ্ট করা আছে</strong> বৈধ নয়!   এটিকে এমন একটি ডিরেক্টরিতে পরিবর্তন করতে হবে যা <strong>অস্তিত্বশীল</strong> এবং ব্যবহারকারীর দ্বারা <strong>লিখনযোগ্য</strong> PHP এর অধীনে চলছে৷<br>';
 $txt['error_windows_chmod'] = 'আপনি একটি উইন্ডোজ সার্ভারে আছেন এবং কিছু গুরুত্বপূর্ণ ফাইল লেখার যোগ্য নয়।  অনুগ্রহ করে আপনার হোস্টকে আপনার SMF ইনস্টলেশনের ফাইলগুলির জন্য PHP যে ব্যবহারকারীর অধীনে চলছে তাকে <strong>লিখনের অনুমতি</strong> দিতে বলুন৷  নিম্নলিখিত ফাইল বা ডিরেক্টরি লিখনযোগ্য হতে হবে:';
 $txt['settings_error'] = 'আপনার সেটিংস Settings.php এ সংরক্ষণ করা যায়নি।';
 $txt['error_ftp_no_connect'] = 'বিশদ বিবরণের এই সমন্বয়ের সাথে FTP সার্ভারের সাথে সংযোগ করতে অক্ষম।';
 $txt['error_db_file'] = 'ডাটাবেস সোর্স স্ক্রিপ্ট খুঁজে পাওয়া যাচ্ছে না!  অনুগ্রহ করে দেখুন %1$s ফাইলটি আপনার ফোরামের উৎস ডিরেক্টরির মধ্যে রয়েছে৷';
 $txt['error_db_connect'] = 'সরবরাহকৃত ডাটা দিয়ে ডাটাবেস সার্ভারের সাথে সংযোগ করা যাচ্ছে না।<br><br>আপনি কি টাইপ করবেন সে বিষয়ে নিশ্চিত না হলে অনুগ্রহ করে আপনার হোস্টের সাথে যোগাযোগ করুন।';
 $txt['error_db_connect_settings'] = 'ডাটাবেস সার্ভারের সাথে সংযোগ করা যাচ্ছে না।<br><br>দয়া করে পরীক্ষা করুন যে Settings.php-এ ডাটাবেস তথ্য ভেরিয়েবল সঠিক আছে কিনা;
 $txt['error_db_database'] = 'ইন্সটলার &quot;<em>%1$s</em>&quot; অ্যাক্সেস করতে পারেনি।  ডাটাবেস  কিছু হোস্টের সাথে, SMF এটি ব্যবহার করার আগে আপনাকে আপনার প্রশাসনিক প্যানেলে ডাটাবেস তৈরি করতে হবে।  কেউ কেউ আপনার ডাটাবেসের নামের সাথে উপসর্গ যোগ করে, যেমন আপনার ব্যবহারকারীর নাম।';
 $txt['error_db_queries'] = 'কিছু প্রশ্ন সঠিকভাবে চালানো হয়নি।  এটি আপনার ডাটাবেস সফ্টওয়্যারটির একটি অসমর্থিত (উন্নয়ন বা পুরানো) সংস্করণের কারণে হতে পারে৷<br><br>কোয়েরি সম্পর্কে প্রযুক্তিগত তথ্য:';
 $txt['error_db_queries_line'] = 'লাইন #';
 $txt['error_db_missing'] = 'ইন্সটলার পিএইচপি-তে কোনো ডাটাবেস সমর্থন সনাক্ত করতে পারেনি।  অনুগ্রহ করে আপনার হোস্টকে নিশ্চিত করতে বলুন যে পিএইচপি পছন্দসই ডাটাবেসের সাথে সংকলিত হয়েছে, বা সঠিক এক্সটেনশনটি লোড হচ্ছে।';
 $txt['error_db_script_missing'] = 'ইনস্টলার সনাক্ত করা ডাটাবেসের জন্য কোনো ইনস্টল স্ক্রিপ্ট ফাইল খুঁজে পায়নি।  অনুগ্রহ করে চেক করুন আপনি আপনার ফোরাম ডিরেক্টরিতে প্রয়োজনীয় ইনস্টল স্ক্রিপ্ট ফাইল আপলোড করেছেন, উদাহরণস্বরূপ &quot;%1$s&quot;';
 $txt['error_session_missing'] = 'ইন্সটলার আপনার সার্ভারের পিএইচপি ইনস্টলেশনে সেশন সমর্থন সনাক্ত করতে পারেনি।  অনুগ্রহ করে আপনার হোস্টকে নিশ্চিত করতে বলুন যে পিএইচপি সেশন সমর্থনের সাথে কম্পাইল করা হয়েছে (যা আসলে পিএইচপি ডিফল্ট, যার অর্থ আপনার হোস্ট বর্তমানে এটি স্পষ্টভাবে নিষ্ক্রিয় করেছে)।';
 $txt['error_user_settings_again_match'] = 'আপনি দুটি সম্পূর্ণ ভিন্ন পাসওয়ার্ড টাইপ করেছেন!';
 $txt['error_user_settings_no_password'] = 'আপনার পাসওয়ার্ডটি কমপক্ষে চারটি অক্ষরের হতে হবে।';
 $txt['error_user_settings_taken'] = 'দুঃখিত, একজন সদস্য ইতিমধ্যেই সেই ব্যবহারকারীর নাম এবং/অথবা ইমেল ঠিকানা দিয়ে নিবন্ধিত।<br><br>একটি নতুন অ্যাকাউন্ট তৈরি করা হয়নি।';
 $txt['error_user_settings_query'] = 'একটি অ্যাডমিনিস্ট্রেটর তৈরি করার চেষ্টা করার সময় একটি ডাটাবেস ত্রুটি ঘটেছে৷  এই ত্রুটি ছিল:';
 $txt['error_sourcefile_missing'] = 'সোর্স/%1$s ফাইল খুঁজে পাওয়া যায়নি।  দয়া করে নিশ্চিত করুন যে এটি সঠিকভাবে আপলোড করা হয়েছে, এবং তারপর আবার চেষ্টা করুন৷';
 $txt['error_db_alter_priv'] = 'আপনার নির্দিষ্ট করা ডাটাবেস অ্যাকাউন্টে ডাটাবেসের টেবিল পরিবর্তন, তৈরি এবং/অথবা ড্রপ করার অনুমতি নেই।  এসএমএফ সঠিকভাবে কাজ করার জন্য এটি প্রয়োজনীয়।';
 $txt['error_versions_do_not_match'] = 'ইন্সটলার শনাক্ত করেছে যে নির্দিষ্ট তথ্য সহ ইতিমধ্যেই ইনস্টল করা SMF এর অন্য একটি সংস্করণ।  আপনি যদি আপগ্রেড করার চেষ্টা করছেন, তাহলে আপনার আপগ্রেডার ব্যবহার করা উচিত, ইনস্টলার নয়।<br><br>অন্যথায়, আপনি বিভিন্ন তথ্য ব্যবহার করতে চাইতে পারেন, বা একটি ব্যাকআপ তৈরি করতে পারেন এবং তারপরে বর্তমানে ডাটাবেসে থাকা ডেটা মুছে ফেলতে পারেন।';
 $txt['error_mod_security'] = 'ইনস্টলার শনাক্ত করেছে যে আপনার ওয়েব সার্ভারে mod_security মডিউল ইনস্টল করা আছে।  SMF কিছু বলার আগেই Mod_security জমা দেওয়া ফর্মগুলিকে ব্লক করবে৷  SMF-এর একটি অন্তর্নির্মিত নিরাপত্তা স্ক্যানার রয়েছে যা mod_security থেকে আরও কার্যকরভাবে কাজ করবে এবং জমাকৃত ফর্মগুলিকে ব্লক করবে না।<br><br><a href="https://www.simplemachines.org/redirect/mod_security"  >মোড_সিকিউরিটি নিষ্ক্রিয় করার বিষয়ে আরও তথ্য</a>';
 $txt['error_mod_security_no_write'] = 'ইনস্টলার সনাক্ত করেছে যে আপনার ওয়েব সার্ভারে mod_security মডিউল ইনস্টল করা আছে।  SMF কিছু বলার আগেই Mod_security জমা দেওয়া ফর্মগুলিকে ব্লক করবে৷  SMF-এর একটি অন্তর্নির্মিত নিরাপত্তা স্ক্যানার রয়েছে যা mod_security থেকে আরও কার্যকরভাবে কাজ করবে এবং জমাকৃত ফর্মগুলিকে ব্লক করবে না।<br><br><a href="https://www.simplemachines.org/redirect/mod_security"  >মোড_সিকিউরিটি নিষ্ক্রিয় করার বিষয়ে আরও তথ্য</a><br><br>বিকল্পভাবে, আপনি আপনার এফটিপি ক্লায়েন্ট ব্যবহার করতে চাইতে পারেন chmod .htaccess ফোরাম ডিরেক্টরিতে লেখার জন্য (777), এবং তারপর এই পৃষ্ঠাটি রিফ্রেশ করুন।';
 $txt['error_utf8_version'] = 'আপনার ডাটাবেসের বর্তমান সংস্করণটি UTF-8 অক্ষর সেটের ব্যবহার সমর্থন করে না।  আপনি এখনও কোনও সমস্যা ছাড়াই SMF ইনস্টল করতে পারেন, তবে শুধুমাত্র UTF-8 সমর্থন আনচেক করা আছে।  আপনি যদি ভবিষ্যতে UTF-8-এ স্যুইচ করতে চান (যেমন আপনার ফোরামের ডাটাবেস সার্ভারটি সংস্করণ >= %1$s এ আপগ্রেড হওয়ার পরে), আপনি অ্যাডমিন প্যানেলের মাধ্যমে আপনার ফোরামটিকে UTF-8 এ রূপান্তর করতে পারেন।  ';
 $txt['error_valid_admin_email_needed'] = 'আপনি আপনার অ্যাডমিনিস্ট্রেটর অ্যাকাউন্টের জন্য একটি বৈধ ইমেল ঠিকানা দেননি।';
 $txt['error_valid_server_email_needed'] = 'আপনি একটি বৈধ ওয়েবমাস্টার ইমেল ঠিকানা দেননি।';
 $txt['error_already_installed'] = 'ইনস্টলার সনাক্ত করেছে যে আপনি ইতিমধ্যেই SMF ইনস্টল করেছেন৷  এটি দৃঢ়ভাবে পরামর্শ দেওয়া হচ্ছে যে আপনি একটি বিদ্যমান ইনস্টলেশন ওভাররাইট করার চেষ্টা <strong>করবেন না</strong>, ইনস্টলেশন চালিয়ে যাওয়ার ফলে <strong>বিদ্যমান ডেটা ক্ষতি বা নষ্ট হতে পারে</strong>।<br><br>যদি  আপনি আপগ্রেড করতে চান অনুগ্রহ করে <a href="https://www.simplemachines.org">সিম্পল মেশিন ওয়েবসাইট</a> এ যান এবং সর্বশেষ <em>আপগ্রেড</em> প্যাকেজ ডাউনলোড করুন।<br><br>  আপনি যদি সমস্ত ডেটা সহ আপনার বিদ্যমান ইনস্টলেশনটি ওভাররাইট করতে চান তবে এটি সুপারিশ করা হয় যে আপনি বিদ্যমান ডাটাবেস টেবিলগুলি মুছে ফেলুন এবং Settings.php প্রতিস্থাপন করুন এবং আবার চেষ্টা করুন৷';
 $txt['error_warning_notice'] = 'সতর্কতা!';
 $txt['error_script_outdated'] = 'এই ইনস্টল স্ক্রিপ্টটি পুরানো!  SMF এর বর্তমান সংস্করণটি হল %1$s, কিন্তু এই ইনস্টল স্ক্রিপ্টটি %2$s এর জন্য৷<br><br>
 	 আপনি সর্বশেষ সংস্করণ ইনস্টল করছেন তা নিশ্চিত করার জন্য আপনাকে <a href="https://www.simplemachines.org">সিম্পল মেশিনস</a> ওয়েবসাইট দেখার পরামর্শ দেওয়া হচ্ছে৷';
 $txt['error_db_prefix_numeric'] = 'নির্বাচিত ডাটাবেস প্রকার সংখ্যাসূচক উপসর্গ ব্যবহার সমর্থন করে না।';
 $txt['error_pg_scs'] = 'PostgreSQL ভুলভাবে কনফিগার করা হয়েছে।  অনুগ্রহ করে standard_conforming_strings কনফিগারেশন প্যারামিটার চালু করুন।';
 $txt['error_invalid_characters_username'] = 'ব্যবহারকারীর নামে ব্যবহার করা অবৈধ অক্ষর।';
 $txt['error_username_too_long'] = 'ব্যবহারকারীর নাম শুধুমাত্র 25 অক্ষর পর্যন্ত দীর্ঘ হতে পারে।';
 $txt['error_username_left_empty'] = 'ব্যবহারকারীর নাম ক্ষেত্র খালি রাখা হয়েছিল।';
 $txt['error_db_prefix_reserved'] = 'আপনি যে উপসর্গটি লিখেছেন সেটি একটি সংরক্ষিত উপসর্গ।  অনুগ্রহ করে আরেকটি উপসর্গ লিখুন।';
 $txt['error_utf8_support'] = 'আপনি যে ডাটাবেসটি ব্যবহার করার চেষ্টা করছেন সেটি UTF-8 অক্ষর সেট ব্যবহার করছে না';
 
 $txt['ftp_login'] = 'আপনার FTP সংযোগ তথ্য';
 $txt['ftp_login_info'] = 'আপনার জন্য ইনস্টলেশন স্বয়ংক্রিয় করার জন্য এই ওয়েব ইনস্টলারের আপনার FTP তথ্য প্রয়োজন।  অনুগ্রহ করে মনে রাখবেন যে এই তথ্যগুলির কোনটিই আপনার ইনস্টলেশনে সংরক্ষিত নেই, এটি শুধুমাত্র SMF সেটআপ করতে ব্যবহৃত হয়।';
 $txt['ftp_server'] = 'সার্ভার';
 $txt['ftp_server_info'] = 'আপনার FTP সার্ভারের ঠিকানা (প্রায়ই লোকালহোস্ট) এবং পোর্ট।';
 $txt['ftp_port'] = 'পোর্ট';
 $txt['ftp_username'] = 'ব্যবহারকারীর নাম';
 $txt['ftp_username_info'] = 'লগইন করার জন্য ব্যবহারকারীর নাম।  <em>এটি কোথাও সংরক্ষণ করা হবে না।</em>';
 $txt['ftp_password'] = 'পাসওয়ার্ড';
 $txt['ftp_password_info'] = 'লগইন করার জন্য পাসওয়ার্ড।  <em>এটি কোথাও সংরক্ষণ করা হবে না।</em>';
 $txt['ftp_path'] = 'পাথ ইনস্টল করুন';
 $txt['ftp_path_info'] = 'এটি হল <em>আপেক্ষিক</em> পথ যা আপনি আপনার FTP ক্লায়েন্টে ব্যবহার করেন।';
 $txt['ftp_path_found_info'] = 'উপরের বাক্সের পথটি স্বয়ংক্রিয়ভাবে সনাক্ত করা হয়েছে।';
 $txt['ftp_path_help'] = 'আপনার FTP পাথ হল সেই পাথ যা আপনি দেখতে পান যখন আপনি আপনার FTP ক্লায়েন্টে লগ ইন করেন।  এটি সাধারণত &quot;<pre>www</pre>&quot;, &quot;<pre>public_html</pre>&quot;, অথবা &quot;<pre>httpdocs</pre>&quot; দিয়ে শুরু হয়, তবে এতে ডিরেক্টরি অন্তর্ভুক্ত করা উচিত  SMFও আছে, যেমন &quot;/public_html/forum&quot;।  এটি আপনার URL এবং সম্পূর্ণ পাথ থেকে আলাদা৷<br><br>এই পথের ফাইলগুলি ওভাররাইট করা হতে পারে, তাই নিশ্চিত করুন এটি সঠিক৷';
 $txt['ftp_path_help_close'] = 'বন্ধ';
 $txt['ftp_connect'] = 'সংযোগ করুন';

 $txt['force_ssl'] = 'SSL সক্ষম করুন';
 $txt['force_ssl_label'] = 'ফোরাম জুড়ে SSL বল করুন';
 $txt['force_ssl_info'] = 'নিশ্চিত করুন যে পুরো ফোরাম জুড়ে SSL এবং HTTPS সমর্থিত, অন্যথায় আপনার ফোরাম অ্যাক্সেসযোগ্য হয়ে উঠতে পারে';

 $txt['chmod_linux_info'] = 'যদি আপনার একটি শেল অ্যাকাউন্ট থাকে, তাহলে নিচের সুবিধাজনক কমান্ডটি এই ফাইলগুলিতে স্বয়ংক্রিয়ভাবে অনুমতি সংশোধন করতে পারে';

 // আপগ্রেডারেরও টেক্সট স্ট্রিং দরকার!
 $txt['upgrade_step_login'] = 'লগইন';
 $txt['upgrade_step_options'] = 'আপগ্রেড অপশন';
 $txt['upgrade_step_backup'] = 'ব্যাকআপ';
 $txt['upgrade_step_database'] = 'ডাটাবেস পরিবর্তন';
 $txt['upgrade_step_convertutf'] = 'UTF-8 এ রূপান্তর করুন';
 $txt['upgrade_step_convertjson'] = 'ক্রমিক স্ট্রিংগুলিকে JSON-এ রূপান্তর করুন';
 $txt['upgrade_step_delete'] = 'Upgrade.php মুছুন';

 $txt['upgrade_upgrade_utility'] = 'SMF আপগ্রেড ইউটিলিটি';
 $txt['upgrade_warning'] = 'সতর্কতা!';
 $txt['upgrade_critical_error'] = 'গুরুত্বপূর্ণ ত্রুটি!';
 $txt['upgrade_continue'] = 'চালিয়ে যান';
 $txt['upgrade_skip'] = 'এড়িয়ে যান';
 $txt['upgrade_note'] = 'নোট!';
 $txt['upgrade_step'] = 'পদক্ষেপ';
 $txt['upgrade_steps'] = 'পদক্ষেপ';
 $txt['upgrade_progress'] = 'প্রগতি';
 $txt['upgrade_overall_progress'] = 'সার্বিক অগ্রগতি';
 $txt['upgrade_step_progress'] = 'ধাপে অগ্রগতি';
 $txt['upgrade_time_elapsed'] = 'সময় অতিবাহিত';
 $txt['upgrade_time_mins'] = 'মিনিট';
 $txt['upgrade_time_secs'] = 'সেকেন্ড';
 $txt['upgrade_username'] = 'ব্যবহারকারীর নাম:';
 $txt['upgrade_wrong_username'] = 'ব্যবহারকারীর নাম ভুল';
 $txt['upgrade_password'] = 'পাসওয়ার্ড:';
 $txt['upgrade_wrong_password'] = 'পাসওয়ার্ড ভুল';
 $txt['upgrade_script_timeout_minutes'] = '%1$s অন্তত %2$d মিনিট নিষ্ক্রিয় না হওয়া পর্যন্ত এই আপগ্রেড স্ক্রিপ্ট চালানো যাবে না';
 $txt['upgrade_script_timeout_seconds'] = '%1$s অন্তত %2$d সেকেন্ডের জন্য নিষ্ক্রিয় না হওয়া পর্যন্ত এই আপগ্রেড স্ক্রিপ্ট চালানো যাবে না';

 $txt['upgrade_wait'] = 'একটি ব্যাকআপ তৈরি হওয়ার সময় অনুগ্রহ করে অপেক্ষা করুন।  বড় ফোরামের জন্য এটি কিছুটা সময় নিতে পারে!';
 $txt['upgrade_wait2'] = 'আপনার ডাটাবেস UTF-8 তে রূপান্তরিত হওয়া পর্যন্ত অপেক্ষা করুন।  বড় ফোরামের জন্য এটি কিছুটা সময় নিতে পারে!';
 $txt['upgrade_sec_login'] = 'নিরাপত্তার জন্য আপগ্রেডের সাথে এগিয়ে যেতে অনুগ্রহ করে আপনার অ্যাডমিন অ্যাকাউন্ট দিয়ে লগইন করুন।';
 $txt['upgrade_incomplete'] = 'অসম্পূর্ণ';
 $txt['upgrade_not_quite_done'] = 'এখনও পুরোপুরি করা হয়নি!';
 $txt['upgrade_paused_overload'] = 'আপনার সার্ভার ওভারলোড এড়াতে এই আপগ্রেডটি থামানো হয়েছে।  চিন্তা করবেন না, কিছুই ভুল নয়।  চালিয়ে যেতে নিচের <label for="contbutt">চালিয়ে যান</label> ক্লিক করুন।';
 $txt['upgrade_continue_step'] = 'আপগ্রেড স্ক্রিপ্টের শেষ সম্পাদনের সময় পৌঁছে যাওয়া ধাপ থেকে চালিয়ে যান।';
 $txt['upgrade_bypass'] = '<strong>দ্রষ্টব্য:</strong> যদি প্রয়োজন হয়, উপরের নিরাপত্তা পরীক্ষাটি এমন ব্যবহারকারীদের জন্য বাইপাস করা যেতে পারে যারা সার্ভার পরিচালনা করতে পারে, কিন্তু ফোরামে প্রশাসক অধিকার নাও থাকতে পারে।  উপরের চেক বাইপাস করার জন্য, কেবল &quot;upgrade.php&quot; খুলুন।  একটি পাঠ্য সম্পাদকে এবং প্রতিস্থাপন করুন &quot;$disable_security = false;&quot;  সঙ্গে &quot;$disable_security = true;&quot;  এবং এই পৃষ্ঠাটি রিফ্রেশ করুন।';
 $txt['upgrade_areyouready'] = 'আপগ্রেড শুরু হওয়ার আগে, অনুগ্রহ করে নীচের বিকল্পগুলি পর্যালোচনা করুন এবং &quot;চালিয়ে যান&quot;  যখন আপনি শুরু করতে প্রস্তুত।';
 $txt['upgrade_backup_table'] = 'প্রিফিক্স সহ আপনার ডাটাবেসে একটি টেবিল ব্যাকআপ করুন';
 $txt['upgrade_backup_complete'] = 'ব্যাকআপ সম্পূর্ণ!  এগিয়ে যেতে অবিরত ক্লিক করুন।';
 $txt['upgrade_recommended'] = 'প্রস্তাবিত!';
 $txt['upgrade_maintenance'] = 'আপগ্রেড করার সময় ফোরামটিকে রক্ষণাবেক্ষণ মোডে রাখুন।';
 $txt['upgrade_maintenance_title'] = 'রক্ষণাবেক্ষণ শিরোনাম:';
 $txt['upgrade_maintenance_message'] = 'রক্ষণাবেক্ষণ বার্তা:';
 $txt['upgrade_customize'] = 'কাস্টমাইজ';
 $txt['upgrade_debug_info'] = 'অতিরিক্ত ডিবাগিং তথ্য আউটপুট।';
 $txt['upgrade_empty_errorlog'] = 'আপগ্রেড করার আগে ত্রুটির লগ খালি করুন।';
 $txt['upgrade_delete_karma'] = 'ডিবি থেকে সমস্ত কর্ম সেটিংস এবং তথ্য মুছুন';
 $txt['upgrade_reprocess_attachments'] = 'সংযুক্তি রূপান্তর পুনরায় চালান';
 $txt['upgrade_stats_collection'] = 'সাধারণ মেশিনগুলিকে মাসিক মৌলিক পরিসংখ্যান সংগ্রহ করার অনুমতি দিন।';
 $txt['upgrade_stats_info'] = 'সক্রিয় থাকলে, এটি সাধারণ মেশিনগুলিকে মৌলিক পরিসংখ্যান সংগ্রহ করতে মাসে একবার আপনার সাইট দেখার অনুমতি দেবে৷  এটি কোন কনফিগারেশনের জন্য সফ্টওয়্যারটিকে অপ্টিমাইজ করতে হবে সে বিষয়ে সিদ্ধান্ত নিতে আমাদের সাহায্য করবে৷  আরও তথ্যের জন্য অনুগ্রহ করে আমাদের <a href="%1$s" target="_blank" rel="noopener">তথ্য পৃষ্ঠা</a> দেখুন।';
 $txt['upgrade_migrate_settings_file'] = 'একটি নতুন সেটিংস ফাইলে স্থানান্তর করুন।';
 $txt['upgrade_db_changes'] = 'ডাটাবেস পরিবর্তন কার্যকর করা';
 $txt['upgrade_db_patient'] = 'দয়া করে ধৈর্য ধরুন - এটি বড় ফোরামে কিছু সময় নিতে পারে।  সার্ভার থেকে অগ্রগতি দেখানোর সময় অতিবাহিত বৃদ্ধি করা হচ্ছে।';
 $txt['upgrade_db_complete'] = '1 ডেটাবেস আপডেট সম্পূর্ণ!  এগিয়ে যেতে অবিরত ক্লিক করুন।';
 $txt['upgrade_db_complete2'] = 'ডাটাবেস আপডেট সম্পূর্ণ!  এগিয়ে যেতে অবিরত ক্লিক করুন।';
 $txt['upgrade_script'] = 'আপগ্রেড স্ক্রিপ্ট কার্যকর করা হচ্ছে';
 $txt['upgrade_error'] = 'ত্রুটি!';
 $txt['upgrade_unknown_error'] = 'অজানা ত্রুটি!';
 /* একই বাক্য, 3টি ভিন্ন স্ট্রিং */
 $txt['upgrade_completed'] = 'সম্পূর্ণ';
 $txt['upgrade_outof'] = 'এর বাইরে';
 $txt['upgrade_tables'] = 'টেবিল।';

 $txt['upgrade_run_script'] = 'আমরা সুপারিশ করছি যে আপনি এই স্ক্রিপ্টটি চালাবেন না যদি না আপনি নিশ্চিত হন';
 $txt['upgrade_run_script2'] = 'তাদের আপগ্রেড সম্পন্ন হয়েছে।';
 $txt['upgrade_run'] = 'আপনি হয় শুরু থেকে আবার আপগ্রেড চালানো বা সাম্প্রতিক আপগ্রেডের সময় পৌঁছে যাওয়া শেষ ধাপ থেকে চালিয়ে যাওয়া বেছে নিতে পারেন।';

 $txt['upgrade_completed_table'] = 'সম্পূর্ণ টেবিল:';
 $txt['upgrade_current_table'] = 'বর্তমান টেবিল:';
 $txt['upgrade_fulltext'] = 'অনুগ্রহ করে মনে রাখবেন যে আপনার ফুলটেক্সট সূচকটি রূপান্তর সহজতর করার জন্য বাদ দেওয়া হয়েছে এবং আপগ্রেড সম্পূর্ণ হওয়ার পরে অ্যাডমিন এলাকায় পুনরায় তৈরি করা প্রয়োজন।';
 $txt['upgrade_conversion_proceed'] = 'রূপান্তর সম্পূর্ণ!  এগিয়ে যেতে অবিরত ক্লিক করুন।';
 $txt['upgrade_convert_datajson'] = 'সিরিয়ালাইজ থেকে JSON এ ডেটা রূপান্তর করা হচ্ছে...';
 $txt['upgrade_json_completed'] = 'JSON কমপ্লিটে রূপান্তর করুন!  এগিয়ে যেতে অবিরত ক্লিক করুন।';
 $txt['upgrade_executing'] = 'এক্সিকিউটিং:';
 $txt['upgrade_of'] = 'of';
 $txt['upgrade_admin_login'] = 'অ্যাডমিন লগইন:';
 $txt['upgrade_admin_disabled'] = '(অক্ষম)';
 $txt['upgrade_done'] = 'আপগ্রেড সম্পূর্ণ।  এখন আপনি <a href="%1$s/index.php">আপনার SMF এর ইনস্টলেশন</a> ব্যবহার করার জন্য প্রস্তুত৷  আশা করি ভালো লাগবে!';

 $txt['upgrade_delete_now'] = 'upgrade.php এবং এর ডেটা ফাইল এখনই মুছুন';
 $txt['upgrade_delete_server'] = '(সব সার্ভারে কাজ করে না)।';
 $txt['upgrade_problems'] = 'যদি এই আপগ্রেডে আপনার কোনো সমস্যা হয়, অথবা SMF ব্যবহারে কোনো সমস্যা হয়, তাহলে অনুগ্রহ করে <a href="%1$s">আমাদের সাহায্যের জন্য জিজ্ঞাসা করুন</a> করতে দ্বিধা করবেন না৷  ';
 $txt['upgrade_luck'] = 'শুভেচ্ছা,';

 $txt['upgrade_ftp_login'] = 'আপনার FTP সংযোগ তথ্য';
 $txt['upgrade_ftp_perms'] = 'আপগ্রেডার আপগ্রেড করা যতটা সম্ভব সহজ করার জন্য ফাইলের অনুমতি নিয়ে যেকোনো সমস্যা সমাধান করতে পারে।  শুধু নীচে আপনার সংযোগের তথ্য লিখুন বা বিকল্পভাবে পরিবর্তন করা প্রয়োজন এমন ফাইলগুলির একটি তালিকার জন্য <a href="#" onclick="warning_popup();">এখানে</a> ক্লিক করুন৷';
 $txt['upgrade_ftp_warning'] = 'সতর্কতা';
 $txt['upgrade_ftp_files'] = 'নিম্নলিখিত ফাইলগুলিকে চালিয়ে যাওয়ার জন্য লেখার যোগ্য করতে হবে:';
 $txt['upgrade_ftp_shell'] = 'যদি আপনার একটি শেল অ্যাকাউন্ট থাকে, নীচের কমান্ডটি স্বয়ংক্রিয়ভাবে এই ফাইলগুলিতে অনুমতিগুলি সংশোধন করতে পারে';
 $txt['upgrade_ftp_error'] = 'সংযোগ করার চেষ্টা করার সময় নিম্নলিখিত ত্রুটির সম্মুখীন হয়েছিল:';
 
 $txt['upgrade_ready_proceed'] = 'SMF %1$s এ আপগ্রেড করার জন্য আপনাকে ধন্যবাদ৷  সমস্ত ফাইল যথাস্থানে আছে বলে মনে হচ্ছে এবং আপগ্রেড এখন এগিয়ে যেতে পারে।';
 $txt['upgrade_error_script_js'] = 'আপগ্রেড স্ক্রিপ্টটি script.js খুঁজে পাচ্ছে না বা এটি পুরানো।  নিশ্চিত করুন যে আপনার থিম পাথ সঠিক।  আপনি <a href="%1$s">সিম্পল মেশিন ওয়েবসাইট</a>' থেকে একটি সেটিং চেকার টুল ডাউনলোড করতে পারেন;
 $txt['upgrade_warning_lots_data'] = 'এই আপগ্রেড স্ক্রিপ্টটি সনাক্ত করেছে যে আপনার ফোরামে প্রচুর ডেটা রয়েছে যা আপগ্রেড করার প্রয়োজন৷  এই প্রক্রিয়াটি আপনার সার্ভার এবং ফোরামের আকারের উপর নির্ভর করে বেশ কিছু সময় নিতে পারে এবং খুব বড় ফোরামের জন্য (~300,000 বার্তা) সম্পূর্ণ হতে কয়েক ঘন্টা সময় লাগতে পারে।';
 $txt['upgrade_warning_out_of_date'] = 'এই আপগ্রেড স্ক্রিপ্টটি পুরানো!  SMF এর বর্তমান সংস্করণ হল <em id="smfVersion" style="white-space: nowrap;">??</em> কিন্তু এই আপগ্রেড স্ক্রিপ্টটি <em id="yourVersion" style="white-space:  nowrap;">%1$s</em>।<br><br>আপনি নিশ্চিত করতে <a href="%2$s">সিম্পল মেশিন ওয়েবসাইট</a> দেখার পরামর্শ দেওয়া হচ্ছে  সর্বশেষ সংস্করণে আপগ্রেড করা হচ্ছে।';

 $txt['upgrade_forumdir_settings'] = 'মনে হচ্ছে আপনার ফোরাম ডিরেক্টরি সেটিংস <em>হয়ত</em> ভুল।  আপনার ফোরাম ডিরেক্টরি বর্তমানে &quot;%1$s&quot; সেট করা আছে, কিন্তু সম্ভবত &quot;%2$s&quot; হওয়া উচিত।  Settings.php বর্তমানে আপনার পথগুলিকে এইভাবে তালিকাভুক্ত করে:';
 $txt['upgrade_forumdir'] = 'ফোরাম ডিরেক্টরি:';
 $txt['upgrade_sourcedir'] = 'উৎস ডিরেক্টরি:';
 $txt['upgrade_cachedir'] = 'ক্যাশ ডিরেক্টরি:';
 $txt['upgrade_incorrect_settings'] = 'যদি এগুলি ভুল মনে হয় তাহলে এই আপগ্রেডের সাথে এগিয়ে যাওয়ার আগে অনুগ্রহ করে একটি পাঠ্য সম্পাদকে Settings.php খুলুন৷  আপনি যদি আপনার ফোরামটিকে একটি নতুন অবস্থানে নিয়ে যাওয়ার কারণে সেগুলি ভুল হয় তবে দয়া করে Simple Machines ওয়েবসাইট থেকে <a href="https://download.simplemachines.org/?tools">মেরামত সেটিংস</a> টুলটি ডাউনলোড করুন এবং চালান  চালিয়ে যাওয়ার আগে।';

 $txt['upgrade_fulltext_error'] = 'রূপান্তর সহজতর করার জন্য আপনার ফুলটেক্সট সার্চ ইনডেক্স বাদ দেওয়া হয়েছে।  আপনাকে এটি পুনরায় তৈরি করতে হবে।';
 $txt['upgrade_writable_files'] = 'নিম্নলিখিত ফাইলগুলিকে আপগ্রেড চালিয়ে যেতে লিখতে হবে।  অনুগ্রহ করে নিশ্চিত করুন যে উইন্ডোজ অনুমতিগুলি সঠিকভাবে এটির অনুমতি দেওয়ার জন্য সেট করা আছে:';
 $txt['upgrade_time_user'] = '&quot;%1$s&quot;  আপগ্রেড স্ক্রিপ্ট চলছে।';
 
 // আমরা এখানে সময়কে পিছনের দিকের ভেরিয়েবলে উপস্থাপন করি, কারণ এটি কোডটিকে সহজ করে তোলে।
 $txt['upgrade_time_hms'] = 'আপগ্রেড স্ক্রিপ্টটি গত %3$d ঘন্টা, %2$d মিনিট এবং %1$d সেকেন্ড ধরে চলছে।';
 $txt['upgrade_time_ms'] = 'আপগ্রেড স্ক্রিপ্টটি গত %2$d মিনিট এবং %1$d সেকেন্ড ধরে চলছে।';
 $txt['upgrade_time_s'] = 'আপগ্রেড স্ক্রিপ্টটি গত %1$d সেকেন্ড ধরে চলছে।';
 $txt['upgrade_time_updated_hms'] = 'আপগ্রেড স্ক্রিপ্টটি সর্বশেষ আপডেট করা হয়েছে %3$d ঘন্টা, %2$d মিনিট এবং %1$d সেকেন্ড আগে।';
 $txt['upgrade_time_updated_hm'] = 'আপগ্রেড স্ক্রিপ্টটি সর্বশেষ আপডেট করা হয়েছে %2$d মিনিট এবং %1$d সেকেন্ড আগে।';
 $txt['upgrade_time_updated_s'] = 'আপগ্রেড স্ক্রিপ্টটি সর্বশেষ আপডেট করা হয়েছিল %1$d সেকেন্ড আগে।';
 $txt['upgrade_completed_time_hms'] = '%3$d ঘন্টা, %2$s মিনিট এবং %1$s সেকেন্ডে আপগ্রেড সম্পন্ন হয়েছে';
 $txt['upgrade_completed_time_ms'] = '%2$s মিনিট এবং %1$s সেকেন্ডে আপগ্রেড সম্পন্ন হয়েছে';
 $txt['upgrade_completed_time_s'] = '%1$s সেকেন্ডে আপগ্রেড সম্পন্ন হয়েছে';
 $txt['upgrade_success_time_db'] = 'সফল!  ডাটাবেস আপগ্রেডগুলি %3$d ঘন্টা, %2$d মিনিট এবং %1$d সেকেন্ডে সম্পন্ন হয়েছে৷';

 $txt['upgrade_unsuccessful'] = 'অসফল!';
 $txt['upgrade_thisquery'] = 'এই প্রশ্ন:';
 $txt['upgrade_causerror'] = 'ত্রুটির কারণ:';
 $txt['upgrade_completedtables_outof'] = '%2$d টেবিলের মধ্যে <span id="tab_done">%1$d</span> সম্পূর্ণ হয়েছে।';
 $txt['upgrade_success'] = 'সফল!';
 $txt['upgrade_loop'] = 'আপগ্রেড স্ক্রিপ্ট একটি লুপে যাচ্ছে বলে মনে হচ্ছে - ধাপ: ';
 $txt['upgrade_respondtime'] = 'সার্ভার %1$d সেকেন্ডের জন্য সাড়া দেয়নি।  আবার চেষ্টা করার আগে একটু অপেক্ষা করা মূল্যবান হতে পারে।';
 $txt['upgrade_respondtime_clickhere'] = 'আবার চেষ্টা করতে এখানে ক্লিক করুন।';
 $txt['mtitle'] = 'ফোরাম আপগ্রেড করা হচ্ছে...';
 $txt['mmessage'] = 'চিন্তা করবেন না, আপনার ফোরাম শীঘ্রই আপডেট করা হবে।  এটা মাত্র এক মিনিট হবে ;).';

 // আপগ্রডার ত্রুটি বার্তা
 // যুক্তি(গুলি): টেমপ্লেটের নাম (যদি প্রযোজ্য হয়)
 $txt['error_unexpected_template_call'] = 'ত্রুটি: %1$s টেমপ্লেট ব্যবহার করার জন্য অপ্রত্যাশিত কল।  অনুগ্রহ করে উপরের সমস্ত পাঠ্য অনুলিপি করুন এবং পেস্ট করুন এবং বিকাশকারীদের জানাতে SMF সমর্থন ফোরামে যান যে একটি বাগ রয়েছে৷';
 $txt['error_invalid_template'] = 'আপগ্রেড বাতিল করা হয়েছে!   অবৈধ টেমপ্লেট: টেমপ্লেট_%1$s';
 $txt['error_lang_index_missing'] = 'আপগ্রেডার নির্বাচিত ভাষার জন্য ভাষা ফাইল খুঁজে পায়নি, %1$s।<br>এসএমএফ ভাষা ফাইল ইনস্টল না করে এই ভাষায় কাজ করবে না।<br><br>দয়া করে  হয় সেগুলি ইনস্টল করুন, অথবা <a href="%2$s?step=0;lang=english">এর পরিবর্তে ইংরেজি চেষ্টা করুন</a>।';
 $txt['error_upgrade_files_missing'] = 'আপগ্রেডার কিছু গুরুত্বপূর্ণ ফাইল খুঁজে পায়নি৷<br><br>দয়া করে নিশ্চিত করুন যে আপনি থিম, উত্স এবং অন্যান্য ডিরেক্টরি সহ প্যাকেজে অন্তর্ভুক্ত সমস্ত ফাইল আপলোড করেছেন৷'  ;
 $txt['error_upgrade_old_files'] = 'আপগ্রডার কিছু পুরানো বা পুরানো ফাইল খুঁজে পেয়েছে।<br><br>দয়া করে নিশ্চিত করুন যে আপনি প্যাকেজে অন্তর্ভুক্ত সমস্ত ফাইলের নতুন সংস্করণ আপলোড করেছেন।';
 $txt['error_upgrade_old_lang_files'] = 'আপগ্রডার নির্বাচিত ভাষা, %1$s এর জন্য কিছু পুরানো বা পুরানো ভাষার ফাইল খুঁজে পেয়েছে।<br><br>দয়া করে নিশ্চিত করুন যে আপনি প্যাকেজে অন্তর্ভুক্ত সমস্ত ফাইলের নতুন সংস্করণ আপলোড করেছেন  , এমনকি ডিফল্ট থিমের জন্য থিম এবং ভাষা ফাইল।<br>&nbsp;&nbsp;&nbsp;[<a  href="%2$s?skiplang">SKIP</a>] [<a href="%2$s?lang=english">ইংরেজি ব্যবহার করে দেখুন</a>]';
 $txt['error_php_too_low'] = 'সতর্কতা!   আপনার ওয়েব সার্ভারে PHP-এর কোনো সংস্করণ ইনস্টল করা আছে বলে মনে হচ্ছে না যা SMF এর ন্যূনতম ইনস্টলেশনের প্রয়োজনীয়তা পূরণ করে।<br><br>আপগ্রেড করতে আপনার হোস্টকে বলুন।';
 $txt['error_db_too_low'] = 'আপনার %1$s সংস্করণটি SMF এর ন্যূনতম প্রয়োজনীয়তা পূরণ করে না।<br><br>অনুগ্রহ করে আপনার হোস্টকে আপগ্রেড করতে বলুন।';
 $txt['error_db_privileges'] = 'আপনি Settings.php-এ যে %1$s ব্যবহারকারীকে সেট করেছেন তার যথাযথ বিশেষাধিকার নেই।<br><br>অনুগ্রহ করে আপনার হোস্টকে এই ব্যবহারকারীকে পরিবর্তন, তৈরি এবং ড্রপ সুবিধা দিতে বলুন  .';
 $txt['error_dir_not_writable'] = 'ডিরেক্টরি: %1$s আপগ্রেড চালিয়ে যাওয়ার জন্য লেখার যোগ্য হতে হবে।  অনুগ্রহ করে নিশ্চিত করুন যে এটি অনুমতি দেওয়ার জন্য অনুমতিগুলি সঠিকভাবে সেট করা আছে৷';
 $txt['error_cache_not_found'] = 'ক্যাশে ডিরেক্টরি খুঁজে পাওয়া যায়নি।<br><br>দয়া করে নিশ্চিত করুন যে আপনার কাছে &quot;cache&quot; নামে একটি ডিরেক্টরি আছে।  চালিয়ে যাওয়ার আগে আপনার ফোরাম ডিরেক্টরিতে।';
 $txt['error_agreement_not_writable'] = 'আপগ্রডার চুক্তি.txt-এ লেখার অ্যাক্সেস পেতে পারেনি।<br><br>আপনি যদি লিনাক্স বা ইউনিক্স ভিত্তিক সার্ভার ব্যবহার করেন, তাহলে অনুগ্রহ করে নিশ্চিত করুন যে ফাইলটি chmod\'d  777, অথবা যদি এটি বিদ্যমান না থাকে যে এই আপগ্রডারটি যে ডিরেক্টরিতে রয়েছে সেটি হল 777৷<br>যদি আপনার সার্ভারটি উইন্ডোজ চালায়, অনুগ্রহ করে নিশ্চিত করুন যে  ইন্টারনেট গেস্ট অ্যাকাউন্টের এটি বা ফোল্ডারে যথাযথ অনুমতি রয়েছে।';
 $txt['error_not_admin'] = 'আপগ্রেড করার জন্য আপনাকে অ্যাডমিন হতে হবে!';

 $txt['warning_lang_old'] = 'আপনার নির্বাচিত ভাষার জন্য ভাষা ফাইল, %1$s, সর্বশেষ সংস্করণে আপডেট করা হয়নি।  ফোরাম ডিফল্টের সাথে আপগ্রেড চলতে থাকবে, %2$s।';
 $txt['warning_lang_missing'] = 'আপগ্রডার &quot;ইনস্টল&quot; খুঁজে পায়নি;  আপনার নির্বাচিত ভাষার জন্য ভাষা ফাইল, %1$s।  ফোরাম ডিফল্টের সাথে আপগ্রেড চলতে থাকবে, %2$s।';

 // সংযুক্তি এবং অবতার ফোল্ডার চেক
 $txt['warning_av_missing'] = 'সতর্কতা!  অবতার ডিরেক্টরি পাওয়া যায়নি।  চালিয়ে যাওয়া অনিরাপদ হতে পারে।  অনুগ্রহ করে এগিয়ে যাওয়ার আগে ফোল্ডার সেটিংস নিশ্চিত করুন।';
 $txt['warning_custom_av_missing'] = 'সতর্কতা!  কাস্টম অবতার ডিরেক্টরি পাওয়া যায়নি।  চালিয়ে যাওয়া অনিরাপদ হতে পারে।  অনুগ্রহ করে এগিয়ে যাওয়ার আগে ফোল্ডার সেটিংস নিশ্চিত করুন।';
 $txt['warning_att_dir_missing'] = 'সতর্কতা!  এক বা একাধিক সংযুক্তি ডিরেক্টরি পাওয়া যায়নি৷  চালিয়ে যাওয়া অনিরাপদ হতে পারে।  অনুগ্রহ করে এগিয়ে যাওয়ার আগে ফোল্ডার সেটিংস নিশ্চিত করুন।';

 // পৃষ্ঠা শিরোনাম
 $txt['updating_smf_installation'] = 'আপনার SMF ইনস্টলেশন আপডেট করা হচ্ছে!';
 $txt['upgrade_options'] = 'আপগ্রেড অপশন';
 $txt['backup_database'] = 'ব্যাকআপ ডেটাবেস';
 $txt['database_changes'] = 'ডাটাবেস পরিবর্তন';
 $txt['upgrade_complete'] = 'আপগ্রেড সম্পূর্ণ';
 $txt['converting_utf8'] = 'UTF-8 এ রূপান্তর করা হচ্ছে';
 $txt['converting_json'] = 'JSON এ রূপান্তর করা হচ্ছে';

 ?>