<?php
// Version: 2.1.3; Install

// These should be the same as those in index.language.php.
$txt['lang_character_set'] = 'UTF-8';
$txt['lang_rtl'] = '0';

$txt['install_step_welcome'] = 'স্বাগতম';
$txt['install_step_writable'] = 'লিখনযোগ্য পরীক্ষা';
$txt['install_step_forum'] = 'ফোরাম সেটিংস';
$txt['install_step_databaseset'] = 'ডেটাবেস সেটিংস';
$txt['install_step_databasechange'] = 'ডেটাবেস জনসংখ্যা';
$txt['install_step_admin'] = 'অ্যাডমিন অ্যাকাউন্ট';
$txt['install_step_delete'] = 'স্থাপন সম্পন্ন করুন';

$txt['smf_installer'] = 'এসএমএফ ইনস্টলার';
$txt['installer_language'] = 'ভাষা';
$txt['installer_language_set'] = 'নির্ধারণ করুন';
$txt['congratulations'] = 'অভিনন্দন, ইনস্টলেশন প্রক্রিয়া সম্পন্ন হয়েছে!';
$txt['congratulations_help'] = 'যদি কখনও আপনার সমর্থনের প্রয়োজন হয়, অথবা এসএমএফ সঠিকভাবে কাজ না করে, তবে মনে রাখবেন যে <a href="https://www.simplemachines.org/community/index.php" target="_blank" rel="noopener">সাহায্য পাওয়া যায়</a> যদি আপনার প্রয়োজন হয়।';
$txt['still_writable'] = 'আপনার ইনস্টলেশন ডিরেক্টরি এখনও লিখনযোগ্য। এটি নিরাপত্তার কারণে chmod করা একটি ভাল ধারণা।';
$txt['delete_installer'] = 'এখন এই install.php ফাইলটি মুছতে এখানে ক্লিক করুন।';
$txt['delete_installer_maybe'] = '<em>(সব সার্ভারে কাজ নাও করতে পারে।)</em>';
$txt['go_to_your_forum'] = 'এখন আপনি দেখতে পারেন <a href="%1$s">আপনার নতুন ইনস্টল করা ফোরাম</a> এবং এটি ব্যবহার শুরু করতে পারেন। প্রথমে নিশ্চিত করুন যে আপনি লগ ইন করেছেন, তারপর আপনি প্রশাসনিক কেন্দ্র অ্যাক্সেস করতে সক্ষম হবেন।';
$txt['good_luck'] = 'শুভকামনা!<br>সিম্পল মেশিনস';

$txt['install_welcome'] = 'স্বাগতম';
$txt['install_welcome_desc'] = 'এসএমএফ-এ স্বাগতম। এই স্ক্রিপ্টটি আপনাকে %1$s ইনস্টল করার প্রক্রিয়ায় গাইড করবে। আমরা পরবর্তী কয়েকটি ধাপে আপনার ফোরাম সম্পর্কে কিছু তথ্য সংগ্রহ করব, এবং কয়েক মিনিটের মধ্যে আপনার ফোরাম ব্যবহারের জন্য প্রস্তুত হবে।';
$txt['install_no_https'] = 'আপনার পরিবেশ https স্ট্রিম সমর্থন করে না। নির্দিষ্ট ফাংশন, যেমন simplemachines.org থেকে আপডেট গ্রহণ, কাজ করবে না।';
$txt['install_no_mbstring'] = 'আপনার পরিবেশ প্রয়োজনীয় mbstring লাইব্রেরি সমর্থন করে না। দয়া করে mbstring সক্ষম করুন এবং আবার চেষ্টা করুন।';
$txt['install_no_fileinfo'] = 'আপনার পরিবেশ প্রয়োজনীয় fileinfo লাইব্রেরি সমর্থন করে না। দয়া করে fileinfo সক্ষম করুন এবং আবার চেষ্টা করুন।';
$txt['install_all_lovely'] = 'আমরা আপনার সার্ভারে কিছু প্রাথমিক পরীক্ষা সম্পন্ন করেছি এবং সবকিছু ঠিক মনে হচ্ছে। শুরু করতে নিচের &quot;Continue&quot; বোতামে ক্লিক করুন।';

$txt['user_refresh_install'] = 'ফোরাম রিফ্রেশ করা হয়েছে';
$txt['user_refresh_install_desc'] = 'ইনস্টল করার সময়, ইনস্টলার দেখতে পেয়েছে যে (আপনার প্রদত্ত বিবরণ অনুসারে) এই ইনস্টলার দ্বারা তৈরি করা হতে পারে এমন এক বা একাধিক টেবিল ইতিমধ্যে বিদ্যমান।<br>আপনার ইনস্টলেশনে যে কোন অনুপস্থিত টেবিলগুলি ডিফল্ট ডেটা সহ পুনরায় তৈরি করা হয়েছে, তবে বিদ্যমান টেবিলগুলির থেকে কোন ডেটা মুছে ফেলা হয়নি।';

$txt['default_topic_subject'] = 'এসএমএফ-এ স্বাগতম!';
$txt['default_topic_message'] = 'সিম্পল মেশিনস ফোরামে স্বাগতম!<br><br>আমরা আশা করি আপনি আপনার ফোরাম ব্যবহার করে উপভোগ করবেন। যদি আপনার কোন সমস্যা হয়, তবে দয়া করে [url=https://www.simplemachines.org/community/index.php]আমাদের সাহায্যের জন্য জিজ্ঞাসা করুন[/url]।<br><br>ধন্যবাদ!<br>সিম্পল মেশিনস';
$txt['default_board_name'] = 'সাধারণ আলোচনা';
$txt['default_board_description'] = 'এই বোর্ডে কিছু এবং সবকিছু নিয়ে কথা বলার জন্য স্বাগতম।';
$txt['default_category_name'] = 'সাধারণ বিভাগ';
$txt['default_time_format'] = '%b %d, %Y, %I:%M %p';
$txt['default_news'] = 'এসএমএফ - সদ্য ইনস্টল করা হয়েছে!';
$txt['default_reserved_names'] = 'অ্যাডমিন\nওয়েবমাস্টার\nগেস্ট\nরুট';
$txt['default_fugue_smileyset_name'] = 'ফুগের সেট';
$txt['default_alienine_smileyset_name'] = 'এলিয়েনিনের সেট';
$txt['default_aaron_smileyset_name'] = 'এয়ারনের সেট';
$txt['default_akyhne_smileyset_name'] = 'আকিহনের সেট';
$txt['default_legacy_smileyset_name'] = '2.0 ডিফল্ট';
$txt['default_theme_name'] = 'এসএমএফ ডিফল্ট থিম - কার্ভ2';

$txt['default_administrator_group'] = 'অ্যাডমিনিস্ট্রেটর';
$txt['default_global_moderator_group'] = 'গ্লোবাল মডারেটর';
$txt['default_moderator_group'] = 'মডারেটর';
$txt['default_newbie_group'] = 'নবীন';
$txt['default_junior_group'] = 'জুনিয়র সদস্য';
$txt['default_full_group'] = 'পূর্ণ সদস্য';
$txt['default_senior_group'] = 'সিনিয়র সদস্য';
$txt['default_hero_group'] = 'হিরো সদস্য';

$txt['default_smiley_smiley'] = 'মুখভঙ্গি';
$txt['default_wink_smiley'] = 'চোখ মেলানো';
$txt['default_cheesy_smiley'] = 'চিজি';
$txt['default_grin_smiley'] = 'হাসি';
$txt['default_angry_smiley'] = 'রাগান্বিত';
$txt['default_sad_smiley'] = 'দুঃখিত';
$txt['default_shocked_smiley'] = 'আশ্চর্য';
$txt['default_cool_smiley'] = 'কুল';
$txt['default_huh_smiley'] = 'কী?';
$txt['default_roll_eyes_smiley'] = 'চোখ ঘুরানো';
$txt['default_tongue_smiley'] = 'জিভ';
$txt['default_embarrassed_smiley'] = 'লজ্জিত';
$txt['default_lips_sealed_smiley'] = 'হাঁটুর মুখ বন্ধ';
$txt['default_undecided_smiley'] = 'অবসন্ন';
$txt['default_kiss_smiley'] = 'চুম্বন';
$txt['default_cry_smiley'] = 'কাঁদা';
$txt['default_evil_smiley'] = 'শয়তান';
$txt['default_azn_smiley'] = 'এজিএন';
$txt['default_afro_smiley'] = 'আফ্রো';
$txt['default_laugh_smiley'] = 'হাসা';
$txt['default_police_smiley'] = 'পুলিশ';
$txt['default_angel_smiley'] = 'ফেরেশতা';

$txt['error_message_click'] = 'এখানে ক্লিক করুন';
$txt['error_message_try_again'] = 'এই ধাপটি আবার চেষ্টা করতে।';
$txt['error_message_bad_try_again'] = 'যাইহোক, ইনস্টল করার চেষ্টা করতে, কিন্তু লক্ষ্য করুন যে এটি <em>মহানভাবে</em> নিরুৎসাহিত।';

$txt['install_settings'] = 'ফোরাম সেটিংস';
$txt['install_settings_info'] = 'এই পৃষ্ঠায় আপনার ফোরামের জন্য কিছু মূল সেটিংস নির্ধারণ করতে হবে। এসএমএফ স্বয়ংক্রিয়ভাবে আপনার জন্য মূল সেটিংস সনাক্ত করেছে।';
$txt['install_settings_name'] = 'ফোরামের নাম';
$txt['install_settings_name_info'] = 'এটি আপনার ফোরামের নাম, উদাহরণস্বরূপ &quot;দ্য টেস্টিং ফোরাম&quot;।';
$txt['install_settings_name_default'] = 'আমার কমিউনিটি';
$txt['install_settings_url'] = 'ফোরামের URL';
$txt['install_settings_url_info'] = 'এটি আপনার ফোরামের URL <strong>শেষে \'/\' ছাড়া!</strong>।<br>অধিকাংশ ক্ষেত্রে, আপনি এই বাক্সে ডিফল্ট মানটি একা রাখতে পারেন - এটি সাধারণত সঠিক।';
$txt['install_settings_reg_mode'] = 'নিবন্ধন মোড';
$txt['install_settings_reg_modes'] = 'নিবন্ধন মোড';
$txt['install_settings_reg_immediate'] = 'তাত্ক্ষণিক নিবন্ধন';
$txt['install_settings_reg_email'] = 'ইমেইল সক্রিয়করণ';
$txt['install_settings_reg_admin'] = 'অ্যাডমিন অনুমোদন';
$txt['install_settings_reg_disabled'] = 'নিবন্ধন অক্ষম';
$txt['install_settings_reg_mode_info'] = 'এই ক্ষেত্রটি ইনস্টলেশনের সময় নিবন্ধনের মোড পরিবর্তন করতে দেয় যাতে অপ্রয়োজনীয় নিবন্ধন প্রতিরোধ করা যায়।';
$txt['install_settings_compress'] = 'Gzip আউটপুট';
$txt['install_settings_compress_title'] = 'ব্যান্ডউইথ সাশ্রয়ের জন্য আউটপুট সংকুচিত করুন।';
// In this string, you can translate the word "PASS" to change what it says when the test passes.
$txt['install_settings_compress_info'] = 'এই ফাংশনটি সব সার্ভারে সঠিকভাবে কাজ করে না, তবে এটি আপনাকে অনেক ব্যান্ডউইথ সাশ্রয় করতে পারে।<br>এটি পরীক্ষা করার জন্য <a href="install.php?obgz=1&amp;pass_string=PASS" onclick="return reqWin(this.href, 200, 60);" target="_blank" rel="noopener">এখানে</a> ক্লিক করুন। (এটি শুধু "PASS" বলা উচিত)।';
$txt['install_settings_dbsession'] = 'ডাটাবেজ সেশন';
$txt['install_settings_dbsession_title'] = 'ফাইল ব্যবহারের পরিবর্তে সেশনগুলির জন্য ডাটাবেজ ব্যবহার করুন।';
$txt['install_settings_dbsession_info1'] = 'এই বৈশিষ্ট্যটি প্রায়শই সেরা, কারণ এটি সেশনগুলিকে আরও নির্ভরযোগ্য করে তোলে।';
$txt['install_settings_dbsession_info2'] = 'এই বৈশিষ্ট্যটি সাধারণত একটি ভাল ধারণা, তবে এটি এই সার্ভারে সঠিকভাবে কাজ নাও করতে পারে।';
$txt['install_settings_stats'] = 'স্ট্যাট কালেকশন অনুমোদন করুন';
$txt['install_settings_stats_title'] = 'সিম্পল মেশিনসকে মাসে একবার মৌলিক পরিসংখ্যান সংগ্রহ করতে অনুমতি দিন';
$txt['install_settings_stats_info'] = 'যদি সক্রিয় হয়, তবে এটি সিম্পল মেশিনসকে আপনার সাইটে মাসে একবার পরিসংখ্যান সংগ্রহ করতে অনুমতি দেবে। এটি আমাদের সফটওয়্যারকে অপ্টিমাইজ করার জন্য কোন কনফিগারেশনগুলি নির্বাচন করতে সাহায্য করবে। আরও তথ্যের জন্য, আমাদের <a href="https://www.simplemachines.org/about/stats.php" target="_blank" rel="noopener">তথ্য পৃষ্ঠায়</a> যান।';
$txt['install_settings_proceed'] = 'অগ্রসর হন';

$txt['db_settings'] = 'ডাটাবেজ সার্ভার সেটিংস';
$txt['db_settings_info'] = 'এগুলি আপনার ডাটাবেজ সার্ভারের জন্য ব্যবহার করার সেটিংস। যদি আপনি মানগুলি জানেন না, তবে আপনাকে আপনার হোস্টের কাছে জিজ্ঞাসা করতে হবে।';
$txt['db_settings_type'] = 'ডাটাবেজের ধরন';
$txt['db_settings_type_info'] = 'একাধিক সমর্থিত ডাটাবেজের ধরন সনাক্ত করা হয়েছে, আপনি কোনটি ব্যবহার করতে চান? দয়া করে লক্ষ্য করুন যে একই PostgreSQL ডাটাবেজে পুরানো SMF 2.0 RC3 এর সাথে নতুন SMF সংস্করণ চালানো সমর্থিত নয়। এই ক্ষেত্রে আপনাকে আপনার পুরানো ইনস্টলেশনগুলি আপগ্রেড করতে হবে।';
$txt['db_settings_server'] = 'সার্ভারের নাম';
$txt['db_settings_server_info'] = 'এটি প্রায়শই localhost হয়, তাই আপনি যদি জানেন না, তবে localhost চেষ্টা করুন।';
$txt['db_settings_username'] = 'ব্যবহারকারীর নাম';
$txt['db_settings_username_info'] = 'এখানে আপনার ডাটাবেজের সাথে সংযোগ করতে প্রয়োজনীয় ব্যবহারকারীর নাম পূরণ করুন।<br>যদি আপনি জানেন না, তবে আপনার ftp অ্যাকাউন্টের ব্যবহারকারীর নাম চেষ্টা করুন, অধিকাংশ সময় তারা একই হয়।';
$txt['db_settings_password'] = 'পাসওয়ার্ড';
$txt['db_settings_password_info'] = 'এখানে আপনার ডাটাবেজের সাথে সংযোগ করতে প্রয়োজনীয় পাসওয়ার্ড দিন।<br>যদি আপনি এটি জানেন না, তবে আপনার ftp অ্যাকাউন্টের পাসওয়ার্ড চেষ্টা করুন।';
$txt['db_settings_database'] = 'ডাটাবেজের নাম';
$txt['db_settings_database_info'] = 'এটি পূরণ করুন যে ডাটাবেজটি আপনি SMF-এর জন্য ব্যবহার করতে চান।';
$txt['db_settings_database_info_note'] = 'যদি এই ডাটাবেজটি বিদ্যমান না থাকে, তবে এই ইনস্টলারটি এটি তৈরি করার চেষ্টা করবে।';
$txt['db_settings_port'] = 'ডাটাবেজ পোর্ট';
$txt['db_settings_port_info'] = 'ডিফল্ট ব্যবহার করতে ফাঁকা ছেড়ে দিন';
$txt['db_settings_prefix'] = 'টেবিলের পূর্বনাম';
$txt['db_settings_prefix_info'] = 'ডাটাবেজের প্রতিটি টেবিলের জন্য পূর্বনাম। <strong>একই পূর্বনাম সহ দুটি ফোরাম ইনস্টল করবেন না!</strong><br>এই কী একটি ডাটাবেজে একাধিক ইনস্টলেশনকে অনুমতি দেয়।';
$txt['db_populate'] = 'জনসংখ্যা ডাটাবেজ';
$txt['db_populate_info'] = 'আপনার সেটিংস এখন সংরক্ষিত হয়েছে এবং ডাটাবেজটি আপনার ফোরাম চালু করতে প্রয়োজনীয় সমস্ত তথ্য দিয়ে পূর্ণ হয়েছে। জনসংখ্যার সারসংক্ষেপ:';
$txt['db_populate_info2'] = 'অ্যাডমিন অ্যাকাউন্ট তৈরি পৃষ্ঠায় অগ্রসর হতে "অগ্রসর হন" ক্লিক করুন।';
$txt['db_populate_inserts'] = 'ইনসার্ট করা হয়েছে %1$d সারি।';
$txt['db_populate_tables'] = 'তৈরি হয়েছে %1$d টেবিল।';
$txt['db_populate_insert_dups'] = 'এড়িয়ে গেছে %1$d পুনরাবৃত্ত ইনসার্ট।';
$txt['db_populate_table_dups'] = 'এড়িয়ে গেছে %1$d পুনরাবৃত্ত টেবিল।';

$txt['user_settings'] = 'আপনার অ্যাকাউন্ট তৈরি করুন';
$txt['user_settings_info'] = 'ইনস্টলার এখন আপনার জন্য একটি নতুন অ্যাডমিনিস্ট্রেটর অ্যাকাউন্ট তৈরি করবে।';
$txt['user_settings_username'] = 'আপনার ব্যবহারকারীর নাম';
$txt['user_settings_username_info'] = 'যে নামটি আপনি লগ ইন করতে চান তা নির্বাচন করুন।<br>এটি পরে পরিবর্তন করা যেতে পারে।';
$txt['user_settings_password'] = 'পাসওয়ার্ড';
$txt['user_settings_password_info'] = 'এখানে আপনার পছন্দসই পাসওয়ার্ড পূরণ করুন এবং এটি ভালভাবে মনে রাখুন!';
$txt['user_settings_again'] = 'পাসওয়ার্ড';
$txt['user_settings_again_info'] = '(শুধু যাচাইকরণের জন্য)।';
$txt['user_settings_admin_email'] = 'অ্যাডমিনিস্ট্রেটরের ইমেইল ঠিকানা';
$txt['user_settings_admin_email_info'] = 'আপনার ইমেইল ঠিকানা প্রদান করুন। এটি একটি বৈধ ইমেইল ঠিকানা হতে হবে!';
$txt['user_settings_server_email'] = 'ওয়েবমাস্টারের ইমেইল ঠিকানা';
$txt['user_settings_server_email_info'] = 'প্রদান করুন <strong>সেই ইমেইল ঠিকানা যা SMF ইমেইল পাঠাতে ব্যবহার করবে</strong>. এটি একটি বৈধ ইমেইল ঠিকানা হতে হবে!';
$txt['user_settings_database'] = 'ডাটাবেজ পাসওয়ার্ড';
$txt['user_settings_database_info'] = 'নিরাপত্তার কারণে, ইনস্টলারটি একটি অ্যাডমিনিস্ট্রেটর অ্যাকাউন্ট তৈরি করতে ডাটাবেজ পাসওয়ার্ড সরবরাহ করতে বলে।';
$txt['user_settings_skip'] = 'ছাড়া দিন';
$txt['user_settings_skip_sure'] = 'আপনি কি নিশ্চিত যে অ্যাডমিন অ্যাকাউন্ট তৈরি করা এড়িয়ে যেতে চান?';
$txt['user_settings_proceed'] = 'শেষ করুন';

$txt['ftp_checking_writable'] = 'ফাইলগুলি লেখার জন্য যাচাই করা হচ্ছে';
$txt['ftp_setup'] = 'FTP সংযোগের তথ্য';
$txt['ftp_setup_info'] = 'এই ইনস্টলারটি FTP-এর মাধ্যমে সংযোগ করতে পারে যাতে লেখার জন্য প্রয়োজনীয় এবং নয় এমন ফাইলগুলি ঠিক করা যায়। যদি এটি আপনার জন্য কাজ না করে, তবে আপনাকে ম্যানুয়ালি প্রবেশ করতে হবে এবং ফাইলগুলি লেখার জন্য তৈরি করতে হবে। দয়া করে লক্ষ্য করুন যে এটি বর্তমানে SSL সমর্থন করে না।';
$txt['ftp_setup_why'] = 'এই পদক্ষেপের উদ্দেশ্য কী?';
$txt['ftp_setup_why_info'] = 'কিছু ফাইল SMF সঠিকভাবে কাজ করার জন্য লেখার জন্য প্রয়োজন। এই পদক্ষেপটি আপনাকে ইনস্টলারটিকে আপনার জন্য সেগুলি লেখার জন্য তৈরি করতে দেয়। তবে, কিছু ক্ষেত্রে এটি কাজ নাও করতে পারে। এই ক্ষেত্রে, দয়া করে নিম্নলিখিত ফাইলগুলি 777 (লেখার জন্য, কিছু হোস্টে 755) করুন:';
$txt['ftp_setup_again'] = 'এই ফাইলগুলি আবার লেখার জন্য পরীক্ষা করতে।';

$txt['error_missing_files'] = 'এই স্ক্রিপ্টের ডিরেক্টরিতে গুরুত্বপূর্ণ ইনস্টলেশন ফাইলগুলি খুঁজে পাওয়া যাচ্ছে না!<br><br>দয়া করে নিশ্চিত করুন যে আপনি সম্পূর্ণ ইনস্টলেশন প্যাকেজটি আপলোড করেছেন, sql ফাইলসহ, এবং তারপর আবার চেষ্টা করুন।';
$txt['error_session_save_path'] = 'দয়া করে আপনার হোস্টকে জানিয়ে দিন যে <strong>php.ini-তে উল্লেখিত session.save_path</strong> বৈধ নয়! এটি একটি <strong>অবস্থিত</strong> এবং <strong>লেখার জন্য উপযোগী</strong> ডিরেক্টরিতে পরিবর্তন করতে হবে।<br>';
$txt['error_windows_chmod'] = 'আপনি একটি উইন্ডোজ সার্ভারে আছেন এবং কিছু গুরুত্বপূর্ণ ফাইল লেখার জন্য উপযোগী নয়। দয়া করে আপনার হোস্টকে জিজ্ঞাসা করুন যে SMF ইনস্টলেশনের ফাইলগুলির জন্য PHP যে ব্যবহারকারীর অধীনে চলছে তার জন্য <strong>লেখার অনুমতি</strong> দিন। নিম্নলিখিত ফাইল বা ডিরেক্টরিগুলি লেখার জন্য উপযোগী হতে হবে:';
$txt['settings_error'] = 'আপনার সেটিংস Settings.php-এ সংরক্ষণ করা যায়নি।';
$txt['error_ftp_no_connect'] = 'এই তথ্যের সংমিশ্রণে FTP সার্ভারে সংযোগ করা যাচ্ছে না।';
$txt['error_db_file'] = 'ডাটাবেজ সোর্স স্ক্রিপ্ট খুঁজে পাওয়া যাচ্ছে না! দয়া করে নিশ্চিত করুন যে ফাইল %1$s আপনার ফোরামের সোর্স ডিরেক্টরির মধ্যে রয়েছে।';
$txt['error_db_connect'] = 'প্রদানকৃত তথ্য দিয়ে ডাটাবেজ সার্ভারে সংযোগ করা যাচ্ছে না।<br><br>যদি আপনি নিশ্চিত না হন যে কি লিখতে হবে, দয়া করে আপনার হোস্টের সাথে যোগাযোগ করুন।';
$txt['error_db_connect_settings'] = 'ডাটাবেজ সার্ভারে সংযোগ করা যাচ্ছে না।<br><br>দয়া করে নিশ্চিত করুন যে Settings.php-এ ডাটাবেজ তথ্য ভেরিয়েবলগুলি সঠিক।';
$txt['error_db_database'] = 'ইনস্টলার &quot;<em>%1$s</em>&quot; ডাটাবেজে প্রবেশ করতে অক্ষম ছিল। কিছু হোস্টের সাথে, আপনাকে SMF ব্যবহার করার আগে আপনার প্রশাসনিক প্যানেলে ডাটাবেজ তৈরি করতে হবে। কিছু হোস্ট আপনার ডাটাবেজ নামের সাথে আপনার ব্যবহারকারীর নামের মতো পূর্বনামও যোগ করে।';
$txt['error_db_queries'] = 'কিছু কোয়েরি সঠিকভাবে কার্যকর হয়নি। এটি আপনার ডাটাবেজ সফটওয়্যারের একটি অ সমর্থিত (উন্নয়ন বা পুরানো) সংস্করণের কারণে হতে পারে।<br><br>কোয়েরিগুলির প্রযুক্তিগত তথ্য:';
$txt['error_db_queries_line'] = 'লাইন #';
$txt['error_db_missing'] = 'ইনস্টলার PHP-তে কোনও ডাটাবেজ সমর্থন সনাক্ত করতে অক্ষম ছিল। দয়া করে আপনার হোস্টকে জিজ্ঞাসা করুন যে PHP প্রয়োজনীয় ডাটাবেজের সাথে কম্পাইল করা হয়েছে, অথবা সঠিক এক্সটেনশন লোড হচ্ছে কিনা তা নিশ্চিত করতে।';
$txt['error_db_script_missing'] = 'ইনস্টলার সনাক্ত করা ডাটাবেজগুলির জন্য কোনও ইনস্টল স্ক্রিপ্ট ফাইল খুঁজে পায়নি। দয়া করে নিশ্চিত করুন যে আপনি আপনার ফোরাম ডিরেক্টরিতে প্রয়োজনীয় ইনস্টল স্ক্রিপ্ট ফাইলগুলি আপলোড করেছেন, উদাহরণস্বরূপ &quot;%1$s&quot;';
$txt['error_session_missing'] = 'ইনস্টলার আপনার সার্ভারের PHP ইনস্টলেশনে সেশন সমর্থন সনাক্ত করতে অক্ষম ছিল। দয়া করে আপনার হোস্টকে জিজ্ঞাসা করুন যে PHP সেশন সমর্থনের সাথে কম্পাইল করা হয়েছে (যা আসলে PHP এর ডিফল্ট, যার মানে আপনার হোস্ট বর্তমানে এটি স্পষ্টভাবে নিষ্ক্রিয় করেছে)।';
$txt['error_user_settings_again_match'] = 'আপনি দুটি সম্পূর্ণ ভিন্ন পাসওয়ার্ড লিখেছেন!';
$txt['error_user_settings_no_password'] = 'আপনার পাসওয়ার্ড কমপক্ষে চারটি অক্ষরের দীর্ঘ হতে হবে।';
$txt['error_user_settings_taken'] = 'দুঃখিত, সেই ব্যবহারকারীর নাম এবং/অথবা ইমেইল ঠিকানার সাথে ইতিমধ্যে একটি সদস্য নিবন্ধিত হয়েছে।<br><br>নতুন একটি অ্যাকাউন্ট তৈরি করা হয়নি।';
$txt['error_user_settings_query'] = 'একটি অ্যাডমিনিস্ট্রেটর তৈরি করার সময় একটি ডাটাবেজ ত্রুটি ঘটেছে। এই ত্রুটি ছিল:';
$txt['error_sourcefile_missing'] = 'Sources/%1$s ফাইলটি খুঁজে পাওয়া যাচ্ছে না। দয়া করে নিশ্চিত করুন যে এটি সঠিকভাবে আপলোড করা হয়েছে, এবং তারপর আবার চেষ্টা করুন।';
$txt['error_db_alter_priv'] = 'আপনি যে ডাটাবেজ অ্যাকাউন্টটি উল্লেখ করেছেন সেটির ALTER, CREATE, এবং/অথবা DROP টেবিল করার অনুমতি নেই। SMF সঠিকভাবে কাজ করার জন্য এটি প্রয়োজন।';
$txt['error_versions_do_not_match'] = 'ইনস্টলারটি সনাক্ত করেছে যে উল্লেখিত তথ্যের সাথে ইতিমধ্যে SMF-এর আরেকটি সংস্করণ ইনস্টল করা হয়েছে। যদি আপনি আপগ্রেড করতে চান, তবে আপনাকে ইনস্টলার নয়, আপগ্রেডার ব্যবহার করা উচিত।<br><br>অন্যথায়, আপনি ভিন্ন তথ্য ব্যবহার করতে পারেন, অথবা একটি ব্যাকআপ তৈরি করতে পারেন এবং তারপর ডাটাবেজে বর্তমানে থাকা তথ্য মুছে ফেলতে পারেন।';
$txt['error_mod_security'] = 'ইনস্টলারটি আপনার ওয়েব সার্ভারে mod_security মডিউল ইনস্টল করা সনাক্ত করেছে। Mod_security জমা দেওয়া ফর্মগুলি ব্লক করবে এমনকি SMF কিছু বলার আগে। SMF-এর একটি বিল্ট-ইন সিকিউরিটি স্ক্যানার রয়েছে যা mod_security এর চেয়ে আরও কার্যকরভাবে কাজ করবে এবং যা জমা দেওয়া ফর্মগুলি ব্লক করবে না।<br><br><a href="https://www.simplemachines.org/redirect/mod_security">mod_security নিষ্ক্রিয় করার বিষয়ে আরও তথ্য</a>';
$txt['error_mod_security_no_write'] = 'ইনস্টলারটি আপনার ওয়েব সার্ভারে mod_security মডিউল ইনস্টল করা সনাক্ত করেছে। Mod_security জমা দেওয়া ফর্মগুলি ব্লক করবে এমনকি SMF কিছু বলার আগে। SMF-এর একটি বিল্ট-ইন সিকিউরিটি স্ক্যানার রয়েছে যা mod_security এর চেয়ে আরও কার্যকরভাবে কাজ করবে এবং যা জমা দেওয়া ফর্মগুলি ব্লক করবে না।<br><br><a href="https://www.simplemachines.org/redirect/mod_security">mod_security নিষ্ক্রিয় করার বিষয়ে আরও তথ্য</a><br><br>বিকল্পভাবে, আপনি আপনার FTP ক্লায়েন্ট ব্যবহার করে ফোরাম ডিরেক্টরির .htaccess কে লেখার জন্য উপযোগী (777) করতে chmod করতে পারেন, এবং তারপর এই পৃষ্ঠাটি রিফ্রেশ করুন।';
$txt['error_utf8_version'] = 'আপনার ডাটাবেজের বর্তমান সংস্করণ UTF-8 অক্ষর সেটের ব্যবহার সমর্থন করে না। আপনি এখনও SMF ইনস্টল করতে পারেন কোনো সমস্যা ছাড়াই, কিন্তু শুধুমাত্র UTF-8 সমর্থন অচেক করা অবস্থায়। যদি আপনি ভবিষ্যতে UTF-8 এ পরিবর্তন করতে চান (যেমন, আপনার ফোরামের ডাটাবেজ সার্ভার সংস্করণ >= %1$s-এ আপগ্রেড করা হয়েছে), আপনি প্রশাসনিক প্যানেলের মাধ্যমে আপনার ফোরামকে UTF-8 এ রূপান্তর করতে পারেন।';
$txt['error_valid_admin_email_needed'] = 'আপনি আপনার অ্যাডমিনিস্ট্রেটর অ্যাকাউন্টের জন্য একটি বৈধ ইমেইল ঠিকানা প্রদান করেননি।';
$txt['error_valid_server_email_needed'] = 'আপনি একটি বৈধ ওয়েবমাস্টার ইমেইল ঠিকানা প্রদান করেননি।';
$txt['error_already_installed'] = 'ইনস্টলারটি সনাক্ত করেছে যে আপনি ইতিমধ্যে SMF ইনস্টল করেছেন। এটি অত্যন্ত সুপারিশ করা হয় যে আপনি একটি বিদ্যমান ইনস্টলেশনকে ওভাররাইট করার চেষ্টা করবেন না, ইনস্টলেশন চালিয়ে যাওয়া <strong>বিদ্যমান তথ্যের ক্ষতি বা ভেঙে যাওয়ার ফলস্বরূপ হতে পারে</strong>।<br><br>যদি আপনি আপগ্রেড করতে চান তবে দয়া করে <a href="https://www.simplemachines.org">Simple Machines ওয়েবসাইটে</a> যান এবং সর্বশেষ <em>আপগ্রেড</em> প্যাকেজটি ডাউনলোড করুন।<br><br>যদি আপনি আপনার বিদ্যমান ইনস্টলেশনকে ওভাররাইট করতে চান, সমস্ত তথ্য সহ, তবে সুপারিশ করা হয় যে আপনি বিদ্যমান ডাটাবেজ টেবিলগুলি মুছে ফেলুন এবং Settings.php প্রতিস্থাপন করুন এবং আবার চেষ্টা করুন।';
$txt['error_warning_notice'] = 'সতর্কতা!';
$txt['error_script_outdated'] = 'এই ইনস্টল স্ক্রিপ্টটি পুরনো! SMF-এর বর্তমান সংস্করণ হল %1$s, কিন্তু এই ইনস্টল স্ক্রিপ্টটি %2$s-এর জন্য।<br><br>
    আপনার সর্বশেষ সংস্করণ ইনস্টল করার জন্য <a href="https://www.simplemachines.org">Simple Machines</a> ওয়েবসাইটে যাওয়ার সুপারিশ করা হচ্ছে।';
$txt['error_db_prefix_numeric'] = 'নির্বাচিত ডাটাবেজ ধরনের জন্য সংখ্যাগত প্রিফিক্স ব্যবহার সমর্থিত নয়।';
$txt['error_pg_scs'] = 'PostgreSQL ভুলভাবে কনফিগার করা হয়েছে। দয়া করে standard_conforming_strings কনফিগারেশন প্যারামিটারটি চালু করুন।';
$txt['error_invalid_characters_username'] = 'ইউজারনেমে অবৈধ অক্ষর ব্যবহার করা হয়েছে।';
$txt['error_username_too_long'] = 'ইউজারনেম সর্বাধিক ২৫ অক্ষর দীর্ঘ হতে পারে।';
$txt['error_username_left_empty'] = 'ইউজারনেম ক্ষেত্রটি খালি রাখা হয়েছে।';
$txt['error_db_prefix_reserved'] = 'আপনি যে প্রিফিক্সটি প্রবেশ করেছেন তা একটি রিজার্ভড প্রিফিক্স। দয়া করে অন্য একটি প্রিফিক্স প্রবেশ করুন।';
$txt['error_utf8_support'] = 'আপনি যে ডাটাবেজটি ব্যবহার করতে চাচ্ছেন তা UTF-8 অক্ষর সেট ব্যবহার করছে না।';

$txt['ftp_login'] = 'আপনার FTP সংযোগের তথ্য';
$txt['ftp_login_info'] = 'এই ওয়েব ইনস্টলারটি আপনার ইনস্টলেশন স্বয়ংক্রিয় করতে আপনার FTP তথ্য প্রয়োজন। দয়া করে লক্ষ্য করুন যে এই তথ্যগুলির মধ্যে কোনটি আপনার ইনস্টলেশনে সংরক্ষিত হবে না, এটি কেবল SMF সেটআপ করতে ব্যবহৃত হবে।';
$txt['ftp_server'] = 'সার্ভার';
$txt['ftp_server_info'] = 'আপনার FTP সার্ভারের ঠিকানা (অধিকাংশ সময় localhost) এবং পোর্ট।';
$txt['ftp_port'] = 'পোর্ট';
$txt['ftp_username'] = 'ইউজারনেম';
$txt['ftp_username_info'] = 'লগইন করার জন্য ইউজারনেম। <em>এটি কোথাও সংরক্ষিত হবে না।</em>';
$txt['ftp_password'] = 'পাসওয়ার্ড';
$txt['ftp_password_info'] = 'লগইন করার জন্য পাসওয়ার্ড। <em>এটি কোথাও সংরক্ষিত হবে না।</em>';
$txt['ftp_path'] = 'ইনস্টল পাথ';
$txt['ftp_path_info'] = 'এটি আপনার FTP ক্লায়েন্টে ব্যবহৃত <em>আপেক্ষিক</em> পাথ।';
$txt['ftp_path_found_info'] = 'উপরের বক্সে পাথটি স্বয়ংক্রিয়ভাবে সনাক্ত করা হয়েছে।';
$txt['ftp_path_help'] = 'আপনার FTP পাথ হল সেই পাথ যা আপনি আপনার FTP ক্লায়েন্টে লগইন করার সময় দেখেন। এটি সাধারণত &quot;<pre>www</pre>&quot;, &quot;<pre>public_html</pre>&quot;, অথবা &quot;<pre>httpdocs</pre>&quot; দিয়ে শুরু হয়, তবে এটি SMF যেখানে অবস্থিত সেই ডিরেক্টরিও অন্তর্ভুক্ত করা উচিত, যেমন &quot;/public_html/forum&quot;। এটি আপনার URL এবং পূর্ণ পাথ থেকে ভিন্ন।<br><br>এই পাথে থাকা ফাইলগুলি ওভাররাইট করা হতে পারে, তাই নিশ্চিত করুন এটি সঠিক।';
$txt['ftp_path_help_close'] = 'বন্ধ করুন';
$txt['ftp_connect'] = 'সংযুক্ত করুন';

$txt['force_ssl'] = 'SSL সক্রিয় করুন';
$txt['force_ssl_label'] = 'ফোরামে SSL জোর করে সক্রিয় করুন';
$txt['force_ssl_info'] = 'নিশ্চিত করুন যে ফোরামে SSL এবং HTTPS সমর্থিত, অন্যথায় আপনার ফোরাম অগ্রহণযোগ্য হয়ে যেতে পারে।';

$txt['chmod_linux_info'] = 'যদি আপনার একটি শেল অ্যাকাউন্ট থাকে, তবে নীচের সুবিধাজনক কমান্ডটি এই ফাইলগুলির অনুমতিগুলি স্বয়ংক্রিয়ভাবে সঠিক করতে পারে।';

// আপগ্রেডারের জন্য টেক্সট স্ট্রিংগুলির প্রয়োজন!
$txt['upgrade_step_login'] = 'লগইন';
$txt['upgrade_step_options'] = 'আপগ্রেড অপশন';
$txt['upgrade_step_backup'] = 'ব্যাকআপ';
$txt['upgrade_step_database'] = 'ডাটাবেজ পরিবর্তন';
$txt['upgrade_step_convertutf'] = 'UTF-8 এ রূপান্তর করুন';
$txt['upgrade_step_convertjson'] = 'সিরিয়ালাইজড স্ট্রিংগুলি JSON এ রূপান্তর করুন';
$txt['upgrade_step_delete'] = 'Upgrade.php মুছুন';

$txt['upgrade_upgrade_utility'] = 'SMF আপগ্রেড ইউটিলিটি';
$txt['upgrade_warning'] = 'সতর্কতা!';
$txt['upgrade_critical_error'] = 'গুরুতর ত্রুটি!';
$txt['upgrade_continue'] = 'চালিয়ে যান';
$txt['upgrade_skip'] = 'ছাড়িয়ে যান';
$txt['upgrade_note'] = 'নোট!';
$txt['upgrade_step'] = 'ধাপ';
$txt['upgrade_steps'] = 'ধাপগুলি';
$txt['upgrade_progress'] = 'অগ্রগতি';
$txt['upgrade_overall_progress'] = 'মোট অগ্রগতি';
$txt['upgrade_step_progress'] = 'ধাপের অগ্রগতি';
$txt['upgrade_time_elapsed'] = 'অতিবাহিত সময়';
$txt['upgrade_time_mins'] = 'মিনিট';
$txt['upgrade_time_secs'] = 'সেকেন্ড';
$txt['upgrade_username'] = 'ইউজারনেম:';
$txt['upgrade_wrong_username'] = 'ইউজারনেম ভুল';
$txt['upgrade_password'] = 'পাসওয়ার্ড:';
$txt['upgrade_wrong_password'] = 'পাসওয়ার্ড ভুল';
$txt['upgrade_script_timeout_minutes'] = 'এই আপগ্রেড স্ক্রিপ্টটি %1$s কমপক্ষে %2$d মিনিটের জন্য নিষ্ক্রিয় না হওয়া পর্যন্ত চালানো যাবে না।';
$txt['upgrade_script_timeout_seconds'] = 'এই আপগ্রেড স্ক্রিপ্টটি %1$s কমপক্ষে %2$d সেকেন্ডের জন্য নিষ্ক্রিয় না হওয়া পর্যন্ত চালানো যাবে না।';

$txt['upgrade_wait'] = 'একটি ব্যাকআপ তৈরি হতে দয়া করে অপেক্ষা করুন। বড় ফোরামের জন্য এটি কিছু সময় নিতে পারে!';
$txt['upgrade_wait2'] = 'আপনার ডাটাবেজ UTF-8 এ রূপান্তর হতে দয়া করে অপেক্ষা করুন। বড় ফোরামের জন্য এটি কিছু সময় নিতে পারে!';
$txt['upgrade_sec_login'] = 'নিরাপত্তার কারণে আপগ্রেড চালিয়ে যেতে আপনার প্রশাসক অ্যাকাউন্ট দিয়ে লগইন করুন।';
$txt['upgrade_incomplete'] = 'অপূর্ণ';
$txt['upgrade_not_quite_done'] = 'এখনও সম্পূর্ণ হয়নি!';
$txt['upgrade_paused_overload'] = 'আপনার সার্ভারকে অতিরিক্ত চাপ থেকে রক্ষা করার জন্য এই আপগ্রেডটি স্থগিত করা হয়েছে। চিন্তা করবেন না, কিছু ভুল হয়নি। চলতে রাখতে নীচের <label for="contbutt">চালিয়ে যাওয়ার বোতাম</label> এ ক্লিক করুন।';
$txt['upgrade_continue_step'] = 'শেষ আপগ্রেড স্ক্রিপ্টের চলাকালীন পৌঁছানো ধাপ থেকে চালিয়ে যান।';
$txt['upgrade_bypass'] = '<strong>নোট:</strong> প্রয়োজন হলে, উপরের নিরাপত্তা পরীক্ষা সেই ব্যবহারকারীদের জন্য বাইপাস করা যেতে পারে যারা একটি সার্ভার পরিচালনা করতে পারেন, তবে ফোরামে প্রশাসক অধিকার নাও থাকতে পারে। উপরের পরীক্ষাটি বাইপাস করতে, কেবল &quot;upgrade.php&quot; একটি টেক্সট সম্পাদক খুলুন এবং &quot;$disable_security = false;&quot; এর পরিবর্তে &quot;$disable_security = true;&quot; লিখুন এবং এই পৃষ্ঠাটি রিফ্রেশ করুন।';
$txt['upgrade_areyouready'] = 'আপগ্রেড শুরু হওয়ার আগে, দয়া করে নীচের অপশনগুলি পর্যালোচনা করুন এবং শুরু করতে প্রস্তুত হলে &quot;চালিয়ে যান&quot; বোতামে ক্লিক করুন।';
$txt['upgrade_backup_table'] = 'আপনার ডাটাবেজে প্রিফিক্স সহ একটি টেবিলের ব্যাকআপ তৈরি করুন।';
$txt['upgrade_backup_complete'] = 'ব্যাকআপ সম্পন্ন! এগিয়ে যেতে চালিয়ে যান ক্লিক করুন।';
$txt['upgrade_recommended'] = 'সুপারিশকৃত!';
$txt['upgrade_maintenance'] = 'আপগ্রেড চলাকালীন ফোরামটি রক্ষণাবেক্ষণ মোডে রাখুন।';
$txt['upgrade_maintenance_title'] = 'রক্ষণাবেক্ষণের শিরোনাম:';
$txt['upgrade_maintenance_message'] = 'রক্ষণাবেক্ষণের বার্তা:';
$txt['upgrade_customize'] = 'কাস্টমাইজ করুন';
$txt['upgrade_debug_info'] = 'অতিরিক্ত ডিবাগিং তথ্য আউটপুট করুন।';
$txt['upgrade_empty_errorlog'] = 'আপগ্রেড করার আগে ত্রুটি লগ খালি করুন।';
$txt['upgrade_delete_karma'] = 'ডিবি থেকে সমস্ত কর্মা সেটিংস এবং তথ্য মুছুন।';
$txt['upgrade_reprocess_attachments'] = 'অ্যাটাচমেন্ট রূপান্তর পুনরায় চালান।';
$txt['upgrade_stats_collection'] = 'সাধারণ পরিসংখ্যান মাসে একবার সংগ্রহ করতে সিম্পল মেশিনগুলিকে অনুমতি দিন।';
$txt['upgrade_stats_info'] = 'যদি সক্রিয় করা হয়, এটি সিম্পল মেশিনগুলিকে আপনার সাইটে মাসে একবার পরিদর্শন করতে দেবে যাতে মৌলিক পরিসংখ্যান সংগ্রহ করা যায়। এটি আমাদের সিদ্ধান্ত নিতে সাহায্য করবে কোন কনফিগারেশনগুলি সফটওয়্যারটি অপটিমাইজ করার জন্য। আরও তথ্যের জন্য আমাদের <a href="%1$s" target="_blank" rel="noopener">তথ্য পৃষ্ঠা</a> পরিদর্শন করুন।';
$txt['upgrade_migrate_settings_file'] = 'নতুন সেটিংস ফাইলে স্থানান্তর করুন।';
$txt['upgrade_db_changes'] = 'ডাটাবেজ পরিবর্তন কার্যকর করা হচ্ছে';
$txt['upgrade_db_patient'] = 'দয়া করে ধৈর্য ধরুন - এটি বড় ফোরামের জন্য কিছু সময় নিতে পারে। সার্ভার থেকে সময় অতিবাহিত হচ্ছে, যাতে অগ্রগতি হচ্ছে তা দেখা যায়।';
$txt['upgrade_db_complete'] = '১টি ডাটাবেজ আপডেট সম্পন্ন! এগিয়ে যেতে চালিয়ে যান ক্লিক করুন।';
$txt['upgrade_db_complete2'] = 'ডাটাবেজ আপডেট সম্পন্ন! এগিয়ে যেতে চালিয়ে যান ক্লিক করুন।';
$txt['upgrade_script'] = 'আপগ্রেড স্ক্রিপ্ট কার্যকর করা হচ্ছে';
$txt['upgrade_error'] = 'ত্রুটি!';
$txt['upgrade_unknown_error'] = 'অজানা ত্রুটি!';
/* একই বাক্য, ৩টি ভিন্ন স্ট্রিং */
$txt['upgrade_completed'] = 'সম্পন্ন';
$txt['upgrade_outof'] = 'এর মধ্যে';
$txt['upgrade_tables'] = 'টেবিল।';

$txt['upgrade_run_script'] = 'আমরা সুপারিশ করি যে আপনি এই স্ক্রিপ্টটি চালাবেন না, যতক্ষণ না আপনি নিশ্চিত হন যে';
$txt['upgrade_run_script2'] = 'তাদের আপগ্রেড সম্পন্ন হয়েছে।';
$txt['upgrade_run'] = 'আপনি আবার শুরু থেকে আপগ্রেডটি চালানোর অথবা সর্বশেষ আপগ্রেড চলাকালীন পৌঁছানো ধাপ থেকে চালিয়ে যাওয়ার বিকল্প বেছে নিতে পারেন।';

$txt['upgrade_completed_table'] = 'সম্পন্ন টেবিল:';
$txt['upgrade_current_table'] = 'বর্তমান টেবিল:';
$txt['upgrade_fulltext'] = 'দয়া করে লক্ষ্য করুন যে আপনার পূর্ণপাঠ সূচক রূপান্তর সহজতর করার জন্য মুছে ফেলা হয়েছে এবং আপগ্রেড সম্পন্ন হলে এটি প্রশাসক এলাকায় পুনরায় তৈরি করতে হবে।';
$txt['upgrade_conversion_proceed'] = 'রূপান্তর সম্পন্ন! এগিয়ে যেতে চালিয়ে যান ক্লিক করুন।';
$txt['upgrade_convert_datajson'] = 'সিরিয়ালাইজড ডেটা থেকে JSON এ রূপান্তর করা হচ্ছে...';
$txt['upgrade_json_completed'] = 'JSON এ রূপান্তর সম্পন্ন! এগিয়ে যেতে চালিয়ে যান ক্লিক করুন।';
$txt['upgrade_executing'] = 'কার্যকর করা হচ্ছে:';
$txt['upgrade_of'] = 'এর';
$txt['upgrade_admin_login'] = 'অ্যাডমিন লগইন:';
$txt['upgrade_admin_disabled'] = '(নিষ্ক্রিয়)';
$txt['upgrade_done'] = 'আপগ্রেড সম্পন্ন। এখন আপনি <a href="%1$s/index.php">SMF এর আপনার ইনস্টলেশন</a> ব্যবহার করতে প্রস্তুত। আশা করি আপনি এটি পছন্দ করবেন!';

$txt['upgrade_delete_now'] = 'এখন upgrade.php এবং এর ডেটা ফাইলগুলি মুছে ফেলুন';
$txt['upgrade_delete_server'] = '(সব সার্ভারে কাজ করে না)।';
$txt['upgrade_problems'] = 'যদি আপনার এই আপগ্রেডের সাথে কোনো সমস্যা হয়ে থাকে, অথবা SMF ব্যবহার করতে কোনো সমস্যা হয়ে থাকে, তাহলে দয়া করে <a href="%1$s">আমাদের কাছে সাহায্য চাইতে দ্বিধা করবেন না</a>।';
$txt['upgrade_luck'] = 'শুভকামনা,';

$txt['upgrade_ftp_login'] = 'আপনার FTP সংযোগের তথ্য';
$txt['upgrade_ftp_perms'] = 'আপগ্রেডারটি ফাইলের অনুমতিতে যেকোনো সমস্যা সমাধান করতে পারে যাতে আপগ্রেডটি যতটা সম্ভব সহজ হয়। নিচে আপনার সংযোগের তথ্য লিখুন অথবা বিকল্পভাবে পরিবর্তন করা প্রয়োজন এমন ফাইলের তালিকার জন্য <a href="#" onclick="warning_popup();">এখানে</a> ক্লিক করুন।';
$txt['upgrade_ftp_warning'] = 'সতর্কতা';
$txt['upgrade_ftp_files'] = 'নিচের ফাইলগুলিকে লেখার জন্য উপযুক্ত করতে হবে যাতে চলতে পারে:';
$txt['upgrade_ftp_shell'] = 'যদি আপনার একটি শেল অ্যাকাউন্ট থাকে, তাহলে নিচের কমান্ডটি এই ফাইলগুলির অনুমতি স্বয়ংক্রিয়ভাবে সংশোধন করতে পারে।';
$txt['upgrade_ftp_error'] = 'সংযোগ করার চেষ্টা করার সময় নিম্নলিখিত ত্রুটি পাওয়া গেছে:';

$txt['upgrade_ready_proceed'] = 'SMF %1$s এ আপগ্রেড করার জন্য আপনাকে ধন্যবাদ। সব ফাইল সঠিক স্থানে রয়েছে এবং আপগ্রেড এখন এগিয়ে যেতে পারে।';
$txt['upgrade_error_script_js'] = 'আপগ্রেড স্ক্রিপ্ট script.js খুঁজে পাচ্ছে না অথবা এটি পুরানো। আপনার থিমের পাথগুলি সঠিক কিনা তা নিশ্চিত করুন। আপনি <a href="%1$s">সিম্পল মেশিনস ওয়েবসাইট</a> থেকে একটি সেটিং চেকার টুল ডাউনলোড করতে পারেন।';
$txt['upgrade_warning_lots_data'] = 'এই আপগ্রেড স্ক্রিপ্টটি সনাক্ত করেছে যে আপনার ফোরামে অনেক ডেটা রয়েছে যা আপগ্রেড করতে হবে। এই প্রক্রিয়াটি আপনার সার্ভার এবং ফোরামের আকারের উপর নির্ভর করে কিছু সময় নিতে পারে এবং খুব বড় ফোরামের জন্য (~300,000 বার্তা) এটি সম্পন্ন হতে কয়েক ঘন্টা সময় লাগতে পারে।';
$txt['upgrade_warning_out_of_date'] = 'এই আপগ্রেড স্ক্রিপ্টটি পুরানো! SMF এর বর্তমান সংস্করণ হল <em id="smfVersion" style="white-space: nowrap;">??</em> কিন্তু এই আপগ্রেড স্ক্রিপ্টটির জন্য <em id="yourVersion" style="white-space: nowrap;">%1$s</em>।<br><br>আপনার সর্বশেষ সংস্করণে আপগ্রেড নিশ্চিত করতে <a href="%2$s">সিম্পল মেশিনস ওয়েবসাইট</a> পরিদর্শন করার সুপারিশ করা হচ্ছে।';

$txt['upgrade_forumdir_settings'] = 'এটি মনে হচ্ছে আপনার ফোরাম ডিরেক্টরি সেটিংস <em>ভুল</em> হতে পারে। আপনার ফোরাম ডিরেক্টরি বর্তমানে &quot;%1$s&quot; সেট করা আছে, কিন্তু এটি সম্ভবত &quot;%2$s&quot; হওয়া উচিত। Settings.php বর্তমানে আপনার পাথগুলি এইভাবে তালিকাবদ্ধ করেছে:';
$txt['upgrade_forumdir'] = 'ফোরাম ডিরেক্টরি:';
$txt['upgrade_sourcedir'] = 'সোর্স ডিরেক্টরি:';
$txt['upgrade_cachedir'] = 'ক্যাশে ডিরেক্টরি:';
$txt['upgrade_incorrect_settings'] = 'যদি এগুলি ভুল মনে হয় তবে এই আপগ্রেডটি চালানোর আগে দয়া করে Settings.php একটি টেক্সট এডিটরে খুলুন। যদি এগুলি আপনার ফোরামকে নতুন স্থানে স্থানান্তর করার কারণে ভুল হয়ে থাকে তবে চলতে যাওয়ার আগে সিম্পল মেশিনস ওয়েবসাইট থেকে <a href="https://download.simplemachines.org/?tools">মেরামত সেটিংস</a> টুলটি ডাউনলোড এবং কার্যকর করুন।';

$txt['upgrade_fulltext_error'] = 'আপনার পূর্ণপাঠ অনুসন্ধান সূচক রূপান্তর সহজতর করার জন্য মুছে ফেলা হয়েছে। আপনাকে এটি পুনরায় তৈরি করতে হবে।';
$txt['upgrade_writable_files'] = 'নিচের ফাইলগুলিকে আপগ্রেড চালিয়ে যেতে লেখার জন্য উপযুক্ত করতে হবে। দয়া করে নিশ্চিত করুন যে উইন্ডোজের অনুমতিগুলি সঠিকভাবে সেট করা হয়েছে:';
$txt['upgrade_time_user'] = '&quot;%1$s&quot; আপগ্রেড স্ক্রিপ্টটি চালাচ্ছে।';

// আমরা এখানে সময়কে উল্টো ভেরিয়েবলে উপস্থাপন করি, কারণ এটি কোডটিকে সহজ করে তোলে।
$txt['upgrade_time_hms'] = 'আপগ্রেড স্ক্রিপ্টটি শেষ %3$d ঘন্টা, %2$d মিনিট এবং %1$d সেকেন্ড ধরে চলছে।';
$txt['upgrade_time_ms'] = 'আপগ্রেড স্ক্রিপ্টটি শেষ %2$d মিনিট এবং %1$d সেকেন্ড ধরে চলছে।';
$txt['upgrade_time_s'] = 'আপগ্রেড স্ক্রিপ্টটি শেষ %1$d সেকেন্ড ধরে চলছে।';
$txt['upgrade_time_updated_hms'] = 'আপগ্রেড স্ক্রিপ্টটি শেষ %3$d ঘন্টা, %2$d মিনিট এবং %1$d সেকেন্ড আগে আপডেট হয়েছে।';
$txt['upgrade_time_updated_hm'] = 'আপগ্রেড স্ক্রিপ্টটি শেষ %2$d মিনিট এবং %1$d সেকেন্ড আগে আপডেট হয়েছে।';
$txt['upgrade_time_updated_s'] = 'আপগ্রেড স্ক্রিপ্টটি শেষ %1$d সেকেন্ড আগে আপডেট হয়েছে।';
$txt['upgrade_completed_time_hms'] = 'আপগ্রেড সম্পন্ন হয়েছে %3$d ঘন্টা, %2$s মিনিট এবং %1$s সেকেন্ডে।';
$txt['upgrade_completed_time_ms'] = 'আপগ্রেড সম্পন্ন হয়েছে %2$s মিনিট এবং %1$s সেকেন্ডে।';
$txt['upgrade_completed_time_s'] = 'আপগ্রেড সম্পন্ন হয়েছে %1$s সেকেন্ডে।';
$txt['upgrade_success_time_db'] = 'সফল! ডেটাবেস আপগ্রেড %3$d ঘন্টা, %2$d মিনিট এবং %1$d সেকেন্ডে সম্পন্ন হয়েছে।';

$txt['upgrade_unsuccessful'] = 'অসফল!';
$txt['upgrade_thisquery'] = 'এই কোয়েরি:';
$txt['upgrade_causerror'] = 'ত্রুটি সৃষ্টি করেছে:';
$txt['upgrade_completedtables_outof'] = 'সম্পন্ন হয়েছে <span id="tab_done">%1$d</span> এর মধ্যে %2$d টেবিল।';
$txt['upgrade_success'] = 'সফল!';
$txt['upgrade_loop'] = 'আপগ্রেড স্ক্রিপ্টটি একটি লুপে যাচ্ছে মনে হচ্ছে - পদক্ষেপ: ';
$txt['upgrade_respondtime'] = 'সার্ভার %1$d সেকেন্ড ধরে সাড়া দেয়নি। আবার চেষ্টা করার আগে কিছুক্ষণ অপেক্ষা করা মূল্যবান হতে পারে।';
$txt['upgrade_respondtime_clickhere'] = 'আবার চেষ্টা করতে এখানে ক্লিক করুন।';
$txt['mtitle'] = 'ফোরাম আপগ্রেড করা হচ্ছে...';
$txt['mmessage'] = 'চিন্তা করবেন না, আপনার ফোরাম শীঘ্রই আপডেট হবে। এটি কেবল এক মিনিটের বিষয় ;)।';

// আপগ্রেডার ত্রুটি বার্তা
// আর্গুমেন্ট(গুলি): টেম্পলেটের নাম (যদি প্রযোজ্য হয়)
$txt['error_unexpected_template_call'] = 'ত্রুটি: %1$s টেম্পলেট ব্যবহার করার জন্য অপ্রত্যাশিত কল। দয়া করে উপরের সমস্ত টেক্সট কপি এবং পেস্ট করুন এবং ডেভেলপারদের জানাতে SMF সমর্থন ফোরামে যান যে এখানে একটি বাগ রয়েছে।';
$txt['error_invalid_template'] = 'আপগ্রেড বাতিল! অকার্যকর টেম্পলেট: template_%1$s';
$txt['error_lang_index_missing'] = 'আপগ্রেডারটি নির্বাচিত ভাষার জন্য ভাষা ফাইলগুলি খুঁজে পেতে অক্ষম, %1$s।<br>ভাষা ফাইলগুলি ইনস্টল না হলে SMF এই ভাষায় কাজ করবে না।<br><br>দয়া করে এগুলি ইনস্টল করুন, অথবা <a href="%2$s?step=0;lang=english">বিকল্পভাবে ইংরেজি চেষ্টা করুন</a>।';
$txt['error_upgrade_files_missing'] = 'আপগ্রেডারটি কিছু গুরুত্বপূর্ণ ফাইল খুঁজে পেতে অক্ষম।<br><br>দয়া করে নিশ্চিত করুন যে আপনি প্যাকেজে অন্তর্ভুক্ত সমস্ত ফাইল আপলোড করেছেন, থিম, সোর্স এবং অন্যান্য ডিরেক্টরিগুলি সহ।';
$txt['error_upgrade_old_files'] = 'আপগ্রেডারটি কিছু পুরানো বা অপ্রচলিত ফাইল খুঁজে পেয়েছে।<br><br>দয়া করে নিশ্চিত করুন যে আপনি প্যাকেজে অন্তর্ভুক্ত সমস্ত ফাইলের নতুন সংস্করণ আপলোড করেছেন।';
$txt['error_upgrade_old_lang_files'] = 'আপগ্রেডারটি নির্বাচিত ভাষার জন্য কিছু পুরানো বা অপ্রচলিত ভাষা ফাইল খুঁজে পেয়েছে, %1$s।<br><br>দয়া করে নিশ্চিত করুন যে আপনি প্যাকেজে অন্তর্ভুক্ত সমস্ত ফাইলের নতুন সংস্করণ আপলোড করেছেন, এমনকি ডিফল্ট থিমের জন্য থিম এবং ভাষা ফাইলগুলিও।<br>&nbsp;&nbsp;&nbsp;[<a href="%2$s?skiplang">এড়িয়ে যান</a>] [<a href="%2$s?lang=english">ইংরেজি চেষ্টা করুন</a>]';
$txt['error_php_too_low'] = 'সতর্কতা! আপনার ওয়েবসার্ভারে SMF এর ন্যূনতম ইনস্টলেশন প্রয়োজনীয়তা পূরণ করে এমন PHP এর একটি সংস্করণ ইনস্টল করা নেই।<br><br>দয়া করে আপনার হোস্টকে আপগ্রেড করতে বলুন।';
$txt['error_db_too_low'] = 'আপনার %1$s সংস্করণ SMF এর ন্যূনতম প্রয়োজনীয়তা পূরণ করে না।<br><br>দয়া করে আপনার হোস্টকে আপগ্রেড করতে বলুন।';
$txt['error_db_privileges'] = 'Settings.php এ আপনি যে %1$s ব্যবহারকারী নির্ধারণ করেছেন তার যথাযথ অধিকার নেই।<br><br>দয়া করে আপনার হোস্টকে এই ব্যবহারকারীকে ALTER, CREATE, এবং DROP অধিকার দেওয়ার জন্য বলুন।';
$txt['error_dir_not_writable'] = 'ডিরেক্টরি: %1$s আপগ্রেড চালিয়ে যেতে লেখার জন্য উপযুক্ত হতে হবে। দয়া করে নিশ্চিত করুন যে অনুমতিগুলি সঠিকভাবে সেট করা হয়েছে।';
$txt['error_cache_not_found'] = 'ক্যাশে ডিরেক্টরি খুঁজে পাওয়া যায়নি।<br><br>দয়া করে নিশ্চিত করুন যে আপনি আপনার ফোরাম ডিরেক্টরিতে &quot;cache&quot; নামে একটি ডিরেক্টরি আছে।';
$txt['error_agreement_not_writable'] = 'আপগ্রেডারটি agreement.txt এ লেখার অধিকার পেতে অক্ষম।<br><br>যদি আপনি একটি লিনাক্স বা ইউনিক্স ভিত্তিক সার্ভার ব্যবহার করেন, তাহলে দয়া করে নিশ্চিত করুন যে ফাইলটি 777 এ chmod করা হয়েছে, অথবা যদি এটি বিদ্যমান না থাকে তবে এই আপগ্রেডারটি যে ডিরেক্টরিতে রয়েছে সেটি 777।<br>যদি আপনার সার্ভার উইন্ডোজ চালায়, তাহলে দয়া করে নিশ্চিত করুন যে ইন্টারনেট অতিথি অ্যাকাউন্টটির উপর সঠিক অনুমতি রয়েছে।';
$txt['error_not_admin'] = 'আপগ্রেড করতে আপনাকে একজন প্রশাসক হতে হবে!';

$txt['warning_lang_old'] = 'আপনার নির্বাচিত ভাষার জন্য ভাষা ফাইলগুলি, %1$s, সর্বশেষ সংস্করণে আপডেট করা হয়নি। আপগ্রেড ফোরামের ডিফল্ট, %2$s এর সাথে চলতে থাকবে।';
$txt['warning_lang_missing'] = 'আপগ্রেডারটি আপনার নির্বাচিত ভাষার জন্য &quot;ইনস্টল&quot; ভাষা ফাইলটি খুঁজে পেতে অক্ষম, %1$s। আপগ্রেড ফোরামের ডিফল্ট, %2$s এর সাথে চলতে থাকবে।';

// সংযুক্তি এবং অ্যাভাটার ফোল্ডার পরীক্ষা
$txt['warning_av_missing'] = 'সতর্কতা! অ্যাভাটার ডিরেক্টরি পাওয়া যায়নি। চলতে থাকা নিরাপদ হতে পারে না। দয়া করে এগিয়ে যাওয়ার আগে ফোল্ডার সেটিংস নিশ্চিত করুন।';
$txt['warning_custom_av_missing'] = 'সতর্কতা! কাস্টম অ্যাভাটার ডিরেক্টরি পাওয়া যায়নি। চলতে থাকা নিরাপদ হতে পারে না। দয়া করে এগিয়ে যাওয়ার আগে ফোল্ডার সেটিংস নিশ্চিত করুন।';
$txt['warning_att_dir_missing'] = 'সতর্কতা! একটি বা একাধিক সংযুক্তি ডিরেক্টরি পাওয়া যায়নি। চলতে থাকা নিরাপদ হতে পারে না। দয়া করে এগিয়ে যাওয়ার আগে ফোল্ডার সেটিংস নিশ্চিত করুন।';

// পৃষ্ঠার শিরোনাম
$txt['updating_smf_installation'] = 'আপনার SMF ইনস্টলেশন আপডেট করা হচ্ছে!';
$txt['upgrade_options'] = 'আপগ্রেড বিকল্পগুলি';
$txt['backup_database'] = 'ডেটাবেস ব্যাকআপ';
$txt['database_changes'] = 'ডেটাবেস পরিবর্তন';
$txt['upgrade_complete'] = 'আপগ্রেড সম্পন্ন';
$txt['converting_utf8'] = 'UTF-8 এ রূপান্তরিত হচ্ছে';
$txt['converting_json'] = 'JSON এ রূপান্তরিত হচ্ছে';

?>