<?php
 // সংস্করণ: 2.1.0;  ম্যানেজ পেইড

 বিশ্বব্যাপী $boardurl;

 // কিছু পেমেন্ট গেটওয়ের ভাষা নির্দিষ্ট তথ্য প্রয়োজন।
 $txt['lang_paypal'] = 'মার্কিন';

 // প্রতীক।
 $txt['usd_symbol'] = '$%1.2f';
 $txt['eur_symbol'] = '&euro;%1.2f';
 $txt['gbp_symbol'] = '&pound;%1.2f';
 $txt['cad_symbol'] = 'C$%1.2f';
 $txt['aud_symbol'] = 'A$%1.2f';

 $txt['usd'] = 'USD ($)';
 $txt['eur'] = 'EUR (&euro;)';
 $txt['gbp'] = 'GBP (&পাউন্ড;)';
 $txt['cad'] = 'CAD (C$)';
 $txt['aud'] = 'AUD (A$)';
 $txt['other'] = 'অন্য';

 $txt['paid_username'] = 'ব্যবহারকারীর নাম';

 $txt['paid_subscriptions_desc'] = 'এই বিভাগ থেকে আপনি আপনার ফোরামে অর্থপ্রদানের সাবস্ক্রিপশন পদ্ধতি যোগ, অপসারণ এবং সম্পাদনা করতে পারেন।';
 $txt['paid_subs_settings'] = 'সেটিংস';
 $txt['paid_subs_settings_desc'] = 'এখান থেকে আপনি আপনার ব্যবহারকারীদের জন্য উপলব্ধ অর্থপ্রদান পদ্ধতি সম্পাদনা করতে পারেন।';
 $txt['paid_subs_view'] = 'সাবস্ক্রিপশন দেখুন';
 $txt['paid_subs_view_desc'] = 'এই বিভাগ থেকে আপনি আপনার উপলব্ধ সমস্ত সদস্যতা দেখতে পারেন।';

 // সেটিং টাইপ স্ট্রিং।
 $txt['paid_enabled'] = 'প্রদেয় সাবস্ক্রিপশন সক্ষম করুন';
 $txt['paid_enabled_desc'] = 'প্রদত্ত সাবস্ক্রিপশন ফোরামে ব্যবহার করার জন্য এটি অবশ্যই পরীক্ষা করা উচিত।';
 $txt['paid_email'] = 'বিজ্ঞপ্তি ইমেল পাঠান';
 $txt['paid_email_desc'] = 'সাবস্ক্রিপশন স্বয়ংক্রিয়ভাবে পরিবর্তন হলে অ্যাডমিনকে জানান।';
 $txt['paid_email_to'] = 'পত্রালাপের জন্য ইমেল';
 $txt['paid_email_to_desc'] = 'বিজ্ঞপ্তি পাঠানোর জন্য ইমেলে ঠিকানার কমা দ্বারা পৃথক করা তালিকা।';
 $txt['paidsubs_test'] = 'পরীক্ষা মোড সক্ষম করুন';
 $txt['paidsubs_test_desc'] = 'এটি প্রদত্ত সাবস্ক্রিপশনকে &quot;পরীক্ষা&quot;  মোড, যা যেখানেই সম্ভব, PayPal, Authorize.net ইত্যাদিতে স্যান্ডবক্স অর্থপ্রদানের পদ্ধতি ব্যবহার করবে। আপনি কী করছেন তা না জানলে সক্ষম করবেন না!';
 $txt['paidsubs_test_confirm'] = 'আপনি কি পরীক্ষা মোড সক্ষম করার বিষয়ে নিশ্চিত?';
 $txt['paid_email_no'] = 'কোনো বিজ্ঞপ্তি পাঠাবেন না';
 $txt['paid_email_error'] = 'সাবস্ক্রিপশন ব্যর্থ হলে জানান';
 $txt['paid_email_all'] = 'সমস্ত স্বয়ংক্রিয় সাবস্ক্রিপশন পরিবর্তন সম্পর্কে অবহিত করুন';
 $txt['paid_currency'] = 'মুদ্রা নির্বাচন করুন';
 $txt['paid_currency_code'] = 'মুদ্রা কোড';
 $txt['paid_currency_code_desc'] = 'পেমেন্ট ব্যবসায়ীদের দ্বারা ব্যবহৃত কোড';
 $txt['paid_currency_symbol'] = 'প্রদান পদ্ধতি দ্বারা ব্যবহৃত প্রতীক';
 $txt['paid_currency_symbol_desc'] = 'সংখ্যা কোথায় যায় তা নির্দিষ্ট করতে \'%1.2f\' ব্যবহার করুন।  যেমন $%1.2f, %1.2f EUR ইত্যাদি';
 $txt['paid_settings_save'] = 'সংরক্ষণ করুন';

 $txt['paypal_email'] = 'পেপাল ইমেল ঠিকানা';
 $txt['paypal_email_desc'] = 'আপনি যদি পেপাল ব্যবহার করতে না চান তাহলে ফাঁকা রাখুন।';
 $txt['paypal_additional_emails'] = 'প্রাথমিক পেপ্যাল ​​ইমেল ঠিকানা';
 $txt['paypal_additional_emails_desc'] = 'যদি ভিন্ন (ব্যবসায়িক অ্যাকাউন্টের জন্য)';
 $txt['paypal_sandbox_email'] = 'পেপাল স্যান্ডবক্স ইমেল ঠিকানা';
 $txt['paypal_sandbox_email_desc'] = 'পরীক্ষা মোড নিষ্ক্রিয় থাকলে বা পেপ্যাল ​​ব্যবহার না করলে খালি রাখা যেতে পারে।';
 
 // যুক্তি(গুলি): $boardurl
 $txt['paid_note'] = '<strong class="alert">দ্রষ্টব্য:</strong><br>
 SMF বর্তমানে <strong>PayPal</strong> কে ইনস্টল করা অর্থপ্রদানের পদ্ধতি হিসাবে সমর্থন করে।
 <ul class="bbc_list">
 	 <li>আপনার পেপ্যাল ​​অ্যাকাউন্টে IPN সক্রিয় করার প্রয়োজন নেই;  কিন্তু আপনি যদি তা করেন, তাহলে ফোরাম আপনার অ্যাকাউন্টে করা সমস্ত অর্থপ্রদানের জন্য অর্থপ্রদানের বিজ্ঞপ্তি পাবে এবং এটি সদস্যতা সম্পর্কিত নয় এমন অর্থপ্রদানের জন্য অর্থপ্রদত্ত সাবস্ক্রিপশন ত্রুটি তৈরি করবে৷</li>
 	 <li>পুনরাবৃত্ত অর্থপ্রদান ব্যবহার করার জন্য আপনার অবশ্যই একটি ব্যবসা বা প্রিমিয়ার অ্যাকাউন্ট থাকতে হবে।</li>
 	 <li>বৈধকরণের উদ্দেশ্যে আপনাকে অবশ্যই আপনার প্রাথমিক পেপাল ইমেল ঠিকানা প্রদান করতে হবে।</li>
 </ul>
 <br>
 আপনি যদি একটি ভিন্ন পেমেন্ট গেটওয়ে ইনস্টল করেন, তাহলে আপনাকে অর্থপ্রদানের বিজ্ঞপ্তির জন্য একটি রিটার্ন URL সেট আপ করতে হতে পারে।  সব ধরনের পেমেন্টের জন্য, এই রিটার্ন URL এইভাবে সেট করা উচিত:
 <br><br>
 <ul class="bbc_list">
 	 <li><strong>%1$s/subscriptions.php</strong></li>
 </ul>
 <br>
 আপনি সাধারণত এটি আপনার গ্রাহক প্যানেলে খুঁজে পেতে পারেন, সাধারণত &quot;রিটার্ন URL&quot;  অথবা &quot;কলব্যাক URL&quot;।';

 // সাবস্ক্রিপশন স্ট্রিং দেখুন।
 $txt['paid_name'] = 'নাম';
 $txt['paid_status'] = 'স্থিতি';
 $txt['paid_cost'] = 'খরচ';
 $txt['paid_duration'] = 'সময়কাল';
 $txt['paid_active'] = 'সক্রিয়';
 $txt['paid_pending'] = 'পেন্ডিং পেমেন্ট';
 $txt['paid_finished'] = 'সমাপ্ত';
 $txt['paid_total'] = 'মোট';
 $txt['paid_is_active'] = 'সক্রিয়';
 $txt['paid_none_yet'] = 'আপনি এখনো কোনো সদস্যতা সেট আপ করেননি।';
 $txt['paid_payments_pending'] = 'পেমেন্ট মুলতুবি';
 $txt['paid_order'] = 'অর্ডার';

 $txt['yes'] = 'হ্যাঁ';
 $txt['no'] = 'না';

 // সাবস্ক্রিপশন যোগ/সম্পাদনা/মুছুন।
 $txt['paid_add_subscription'] = 'সাবস্ক্রিপশন যোগ করুন';
 $txt['paid_edit_subscription'] = 'সাবস্ক্রিপশন সম্পাদনা করুন';
 $txt['paid_delete_subscription'] = 'সাবস্ক্রিপশন মুছুন';

 $txt['paid_mod_name'] = 'সাবস্ক্রিপশন নাম';
 $txt['paid_mod_desc'] = 'বিবরণ';
 $txt['paid_mod_reminder'] = 'অনুস্মারক ইমেল পাঠান';
 $txt['paid_mod_reminder_desc'] = 'অনুস্মারক পাঠাতে সাবস্ক্রিপশনের মেয়াদ শেষ হওয়ার কয়েক দিন আগে।';
 $txt['paid_mod_email'] = 'সম্পূর্ণ হওয়ার পরে পাঠানোর জন্য ইমেল';
 $txt['paid_mod_email_desc'] = 'যেখানে {NAME} সদস্যদের নাম;  {FORUM} হল সম্প্রদায়ের নাম।  ইমেইল বিষয় প্রথম লাইন হতে হবে.  কোনো ইমেল বিজ্ঞপ্তির জন্য ফাঁকা।';
 $txt['paid_mod_cost_usd'] = 'খরচ (USD)';
 $txt['paid_mod_cost_eur'] = 'খরচ (EUR)';
 $txt['paid_mod_cost_gbp'] = 'খরচ (GBP)';
 $txt['paid_mod_cost_cad'] = 'খরচ (CAD)';
 $txt['paid_mod_cost_aud'] = 'খরচ (AUD)';
 $txt['paid_mod_cost_blank'] = 'এই মুদ্রা অফার না করার জন্য এটি ফাঁকা রাখুন।';
 $txt['paid_mod_span'] = 'সাবস্ক্রিপশনের দৈর্ঘ্য';
 $txt['paid_mod_span_days'] = 'দিন';
 $txt['paid_mod_span_weeks'] = 'সপ্তাহ';
 $txt['paid_mod_span_months'] = 'মাস';
 $txt['paid_mod_span_years'] = 'বছর';
 $txt['paid_mod_active'] = 'সক্রিয়';
 $txt['paid_mod_active_desc'] = 'নতুন সদস্যদের যোগদানের জন্য একটি সাবস্ক্রিপশন সক্রিয় থাকতে হবে।';
 $txt['paid_mod_prim_group'] = 'সাবস্ক্রিপশনের ভিত্তিতে প্রাথমিক গ্রুপ';
 $txt['paid_mod_prim_group_desc'] = 'প্রাথমিক গোষ্ঠী যাতে ব্যবহারকারীরা যখন সাবস্ক্রাইব করেন।';
 $txt['paid_mod_add_groups'] = 'সাবস্ক্রিপশনের উপর অতিরিক্ত গ্রুপ';
 $txt['paid_mod_add_groups_desc'] = 'সাবস্ক্রিপশনের পরে ব্যবহারকারীকে যুক্ত করার জন্য অতিরিক্ত গ্রুপ।';
 $txt['paid_mod_no_group'] = 'পরিবর্তন করবেন না';
 $txt['paid_mod_edit_note'] = 'উল্লেখ্য যে এই গ্রুপে বিদ্যমান গ্রাহক থাকায় গ্রুপ সেটিংস পরিবর্তন করা যাবে না!';
 $txt['paid_mod_delete_warning'] = '<strong>সতর্কতা</strong><br><br>যদি আপনি এই সদস্যতাটি মুছে দেন তবে বর্তমানে সদস্যতা নেওয়া সমস্ত ব্যবহারকারী সদস্যতা দ্বারা প্রদত্ত অ্যাক্সেসের অধিকার হারাবেন৷  আপনি যদি নিশ্চিত না হন যে আপনি এটি করতে চান তবে এটি বাঞ্ছনীয় যে আপনি কেবল একটি সদস্যতা মুছে ফেলার পরিবর্তে নিষ্ক্রিয় করুন৷<br>';
 $txt['paid_mod_repeatable'] = 'ব্যবহারকারীকে এই সদস্যতা স্বয়ংক্রিয়ভাবে পুনর্নবীকরণ করার অনুমতি দিন';
 $txt['paid_mod_fixed_price'] = 'নির্দিষ্ট মূল্য এবং সময়ের জন্য সদস্যতা';
 $txt['paid_mod_flexible_price'] = 'সাবস্ক্রিপশন মূল্য অর্ডারের সময়কালের উপর পরিবর্তিত হয়';
 $txt['paid_mod_price_breakdown'] = 'ফ্লেক্সিবল প্রাইস ব্রেকডাউন';
 $txt['paid_mod_price_breakdown_desc'] = 'এখানে সংজ্ঞায়িত করুন যে সাবস্ক্রিপশনের কত খরচ হওয়া উচিত তাদের সাবস্ক্রাইব করা সময়ের উপর নির্ভর করে।  উদাহরণস্বরূপ, এক মাসের জন্য সদস্যতা নিতে 12USD খরচ হতে পারে, কিন্তু এক বছরের জন্য মাত্র 100USD।  আপনি যদি একটি নির্দিষ্ট সময়ের জন্য মূল্য নির্ধারণ করতে না চান তবে এটি খালি রাখুন।';
 $txt['flexible'] = 'নমনীয়';

 $txt['paid_per_day'] = 'প্রতিদিনের দাম';
 $txt['paid_per_week'] = 'প্রতি সপ্তাহে মূল্য';
 $txt['paid_per_month'] = 'প্রতি মাসে মূল্য';
 $txt['paid_per_year'] = 'প্রতি বছর মূল্য';
 $txt['day'] = 'দিন';
 $txt['week'] = 'সপ্তাহ';
 $txt['month'] = 'মাস';
 $txt['year'] = 'বছর';

 // সাবস্ক্রাইব করা ব্যবহারকারীদের দেখুন।
 $txt['viewing_users_subscribed'] = 'ব্যবহারকারীদের দেখা';
 $txt['view_users_subscribed'] = 'সাবস্ক্রাইব করা ব্যবহারকারীদের দেখা: &quot;%1$s&quot;';
 $txt['no_subscribers'] = 'বর্তমানে এই সাবস্ক্রিপশনের কোনো সদস্য নেই।';
 $txt['add_subscriber'] = 'নতুন গ্রাহক যোগ করুন';
 $txt['edit_subscriber'] = 'সাবস্ক্রাইবার সম্পাদনা করুন';
 $txt['delete_selected'] = 'নির্বাচিত মুছুন';
 $txt['complete_selected'] = 'সম্পূর্ণ নির্বাচিত';
 
 // @todo এই স্ট্রিংগুলি জাভাস্ক্রিপ্টের সাথে ব্যবহার করা হয়।  সংখ্যাসূচক সত্তা ব্যবহার করুন।
 $txt['delete_are_sure'] = 'আপনি কি নিশ্চিত যে আপনি নির্বাচিত সাবস্ক্রিপশনের সমস্ত রেকর্ড মুছে ফেলতে চান?';
 $txt['complete_are_sure'] = 'আপনি কি নিশ্চিত যে আপনি নির্বাচিত সদস্যতা সম্পূর্ণ করতে চান?';

 $txt['start_date'] = 'শুরু করার তারিখ';
 $txt['end_date'] = 'শেষ তারিখ';
 $txt['start_date_and_time'] = 'শুরু করার তারিখ এবং সময়';
 $txt['end_date_and_time'] = 'শেষ তারিখ এবং সময়';
 $txt['edit'] = 'সম্পাদনা';
 $txt['one_username'] = 'অনুগ্রহ করে শুধুমাত্র একটি ব্যবহারকারীর নাম লিখুন।';
 $txt['minute'] = 'মিনিট';
 $txt['error_member_not_found'] = 'প্রবেশ করা সদস্য খুঁজে পাওয়া যায়নি';
 $txt['member_already_subscribed'] = 'এই সদস্য ইতিমধ্যেই এই সাবস্ক্রিপশনে সদস্যতা নিয়েছেন।  তাদের বিদ্যমান সদস্যতা সম্পাদনা করুন.';
 $txt['search_sub'] = 'ব্যবহারকারী খুঁজুন';

 // পেমেন্ট করুন।
 $txt['paid_confirm_payment'] = 'পেমেন্ট নিশ্চিত করুন';
 $txt['paid_confirm_desc'] = 'পেমেন্ট করা চালিয়ে যেতে অনুগ্রহ করে নিচের বিশদ বিবরণ দেখুন এবং &quot;অর্ডার&quot;' চাপুন;
 $txt['paypal'] = 'PayPal';
 $txt['paid_confirm_paypal'] = '<a href="https://www.paypal.com">PayPal</a> ব্যবহার করে অর্থ প্রদান করতে অনুগ্রহ করে নীচের বোতামে ক্লিক করুন।  অর্থপ্রদানের জন্য আপনাকে পেপ্যাল ​​সাইটে নির্দেশিত করা হবে।';
 $txt['paid_paypal_order'] = 'পেপাল দিয়ে অর্ডার করুন';
 $txt['paid_done'] = 'পেমেন্ট সম্পূর্ণ';
 $txt['paid_done_desc'] = 'আপনার পেমেন্টের জন্য ধন্যবাদ।  একবার লেনদেন যাচাই করা হলে সাবস্ক্রিপশন সক্রিয় করা হবে।';
 $txt['paid_sub_return'] = 'সাবস্ক্রিপশনে ফিরে যান';
 $txt['paid_current_desc'] = 'নীচে আপনার সমস্ত বর্তমান এবং পূর্ববর্তী সদস্যতার একটি তালিকা রয়েছে৷  একটি বিদ্যমান সাবস্ক্রিপশন বাড়ানোর জন্য শুধুমাত্র উপরের তালিকা থেকে এটি নির্বাচন করুন।';
 $txt['paid_admin_add'] = 'এই সাবস্ক্রিপশন যোগ করুন';

 $txt['paid_not_set_currency'] = 'আপনি এখনও আপনার মুদ্রা সেটআপ করেননি।  অনুগ্রহ করে চালিয়ে যাওয়ার আগে <a href="%1$s">সেটিংস</a> বিভাগ থেকে তা করুন৷';
 $txt['paid_no_cost_value'] = 'আপনাকে অবশ্যই একটি খরচ এবং সদস্যতার দৈর্ঘ্য লিখতে হবে।';
 $txt['paid_invalid_duration'] = 'আপনাকে এই সদস্যতার জন্য একটি বৈধ সময়কাল লিখতে হবে।';
 $txt['paid_invalid_duration_D'] = 'যদি দিনে পরিমাপ করা সাবস্ক্রিপশনের দৈর্ঘ্য দেওয়া হয়, আপনি শুধুমাত্র 1 থেকে 90 দিন ব্যবহার করতে পারবেন।  আপনি যদি এত দীর্ঘ সাবস্ক্রিপশন চান তবে আপনার সপ্তাহ, মাস বা বছর ব্যবহার করা উচিত।';
 $txt['paid_invalid_duration_W'] = 'যদি সাবস্ক্রিপশনের দৈর্ঘ্য সপ্তাহে পরিমাপ করা হয়, আপনি শুধুমাত্র 1 থেকে 52 সপ্তাহ ব্যবহার করতে পারবেন।  আপনি যদি এত দীর্ঘ সাবস্ক্রিপশন চান তবে আপনাকে মাস বা বছর ব্যবহার করতে হবে।';
 $txt['paid_invalid_duration_M'] = 'যদি মাসগুলিতে পরিমাপ করা সাবস্ক্রিপশনের দৈর্ঘ্য রাখা হয়, আপনি শুধুমাত্র 1 থেকে 24 মাস ব্যবহার করতে পারবেন।  আপনি যদি এত দীর্ঘ সাবস্ক্রিপশন চান তবে আপনাকে বছর ব্যবহার করতে হবে।';
 $txt['paid_invalid_duration_Y'] = 'যদি বছরে পরিমাপ করা সাবস্ক্রিপশনের দৈর্ঘ্য রাখা হয়, আপনি শুধুমাত্র 1 থেকে 5 বছর ব্যবহার করতে পারবেন।';
 $txt['paid_all_freq_blank'] = 'আপনাকে অবশ্যই চারটি মেয়াদের মধ্যে অন্তত একটির জন্য একটি খরচ লিখতে হবে।';
 
 // কিছু ত্রুটি স্ট্রিং।
 $txt['paid_no_data'] = 'স্ক্রিপ্টে কোনো বৈধ তথ্য পাঠানো হয়নি।';

 $txt['paypal_could_not_connect'] = 'পেপাল সার্ভারের সাথে সংযোগ করা যায়নি';
 $txt['paid_sub_not_active'] = 'সেটি সাবস্ক্রিপশন কোনো নতুন ব্যবহারকারী নিচ্ছে না।';
 $txt['paid_disabled'] = 'প্রদেয় সাবস্ক্রিপশন বর্তমানে নিষ্ক্রিয়।';
 $txt['paid_unknown_transaction_type'] = 'অজানা প্রদত্ত সাবস্ক্রিপশন লেনদেনের ধরন।';
 $txt['paid_empty_member'] = 'প্রদেয় সাবস্ক্রিপশন হ্যান্ডলার সদস্য আইডি পুনরুদ্ধার করতে পারেনি';
 $txt['paid_could_not_find_member'] = 'প্রদেয় সাবস্ক্রিপশন হ্যান্ডলার আইডি সহ সদস্য খুঁজে পায়নি: %1$d';
 $txt['paid_count_not_find_subscription'] = 'প্রদত্ত সাবস্ক্রিপশন হ্যান্ডলার সদস্য আইডি: %1$s, সাবস্ক্রিপশন আইডি: %2$s'-এর সদস্যতা খুঁজে পায়নি;
 $txt['paid_count_not_find_subscription_log'] = 'প্রদেয় সাবস্ক্রিপশন হ্যান্ডলার সদস্য আইডির জন্য সদস্যতা লগ এন্ট্রি খুঁজে পায়নি: %1$s, সদস্যতা আইডি: %2$s';
 $txt['paid_count_not_find_outstanding_payment'] = 'সদস্য আইডির জন্য বকেয়া পেমেন্ট এন্ট্রি খুঁজে পাওয়া যায়নি: %1$s, সাবস্ক্রিপশন আইডি: %2$s তাই উপেক্ষা করা হচ্ছে';
 $txt['paid_admin_not_setup_gateway'] = 'দুঃখিত, প্রশাসক এখনও প্রদত্ত সাবস্ক্রিপশন সেট আপ শেষ করেননি৷  পরে আবার চেক করুন.';
 $txt['paid_make_recurring'] = 'এটিকে একটি পুনরাবৃত্ত অর্থ প্রদান করুন';

 $txt['subscriptions'] = 'সাবস্ক্রিপশন';
 $txt['subscription'] = 'সাবস্ক্রিপশন';
 $txt['paid_subs_desc'] = 'নিচে এই ফোরামে উপলব্ধ সমস্ত সদস্যতার একটি তালিকা রয়েছে।';
 $txt['paid_subs_none'] = 'বর্তমানে কোনো প্রদত্ত সাবস্ক্রিপশন উপলব্ধ নেই।';

 $txt['paid_current'] = 'বিদ্যমান সদস্যতা';
 $txt['pending_payments'] = 'পেন্ডিং পেমেন্ট';
 $txt['pending_payments_desc'] = 'এই সদস্য এই সাবস্ক্রিপশনের জন্য নিম্নলিখিত অর্থপ্রদান করার চেষ্টা করেছে কিন্তু ফোরামের পক্ষ থেকে নিশ্চিতকরণ পাওয়া যায়নি।  আপনি যদি নিশ্চিত হন যে অর্থপ্রদান গৃহীত হয়েছে &quot;স্বীকার করুন&quot;  সদস্যতা কর্মের জন্য.  বিকল্পভাবে আপনি &quot;সরান&quot; ক্লিক করতে পারেন।  পেমেন্টের সমস্ত রেফারেন্স মুছে ফেলার জন্য।';
 $txt['pending_payments_value'] = 'মান';
 $txt['pending_payments_accept'] = 'স্বীকার করুন';
 $txt['pending_payments_remove'] = 'সরান';

 ?>