<?php
 // সংস্করণ: 2.1.4;  পোস্ট

 বিশ্বব্যাপী $প্রসঙ্গ;

 $txt['post_reply'] = 'উত্তর পোস্ট করুন';
 $txt['message_icon'] = 'মেসেজ আইকন';
 $txt['subject_not_filled'] = 'বিষয় ক্ষেত্রটি পূরণ করা হয়নি।  এটা প্রয়োজন.';
 $txt['message_body_not_filled'] = 'বার্তার অংশটি পূরণ করা হয়নি।  এটা প্রয়োজন.';
 // নিচের স্ট্রিং-এ সাংখ্যিক সত্তা ব্যবহার করুন।
 $txt['add_bbc'] = 'বিবিসি ট্যাগ যোগ করুন';

 $txt['disable_smileys'] = 'স্মাইলি নিষ্ক্রিয় করুন';
 $txt['dont_use_smileys'] = 'স্মাইলি ব্যবহার করবেন না';
 // এখানে যেকোনো একক উদ্ধৃতি দুবার এড়িয়ে যান.. 'it\'s' -> 'it\\\'s'।
 $txt['posted_on'] = 'পোস্ট করা হয়েছে';
 $txt['standard'] = 'স্ট্যান্ডার্ড';
 $txt['thumbs_up'] = 'থাম্ব আপ';
 $txt['thumbs_down'] = 'থাম্ব ডাউন';
 $txt['exclamation_point'] = 'বিস্ময়সূচক বিন্দু';
 $txt['question_mark'] = 'প্রশ্ন চিহ্ন';
 $txt['icon_poll'] = 'পোল';
 $txt['lamp'] = 'প্রদীপ';
 $txt['add_smileys'] = 'স্মাইলি যোগ করুন';
 $txt['topic_notify_no'] = 'বিজ্ঞপ্তি সহ কোনো বিষয় নেই';
 // post_too_long অব্যবহৃত বলে মনে হচ্ছে (ত্রুটির নকল: error_post_too_long
 $txt['post_too_long'] = 'আপনার বার্তাটি অনেক লম্বা।  অনুগ্রহ করে ফিরে যান এবং এটি ছোট করুন, তারপর আবার চেষ্টা করুন।';

 // নিচের পাঁচটি স্ট্রিং-এ সাংখ্যিক সত্তা ব্যবহার করুন।
 $txt['notifyUnsubscribe'] = 'এখানে ক্লিক করে এই বিষয়ে সদস্যতা ত্যাগ করুন';

 $txt['lock_after_post'] = 'পোস্টের পর লক';
 $txt['notify_replies'] = 'আমাকে উত্তর সম্পর্কে অবহিত করুন';
 $txt['lock_topic'] = 'এই বিষয়টি লক করুন';
 $txt['shortcuts'] = 'শর্টকাট: ALT+S পোস্ট বা ALT+P পূর্বরূপ';
 $txt['shortcuts_drafts'] = 'শর্টকাট: ALT+S পোস্ট, ALT+P প্রিভিউ, ALT+D সেভ ড্রাফ্ট';
 $txt['shortcuts_firefox'] = 'শর্টকাট: SHIFT+ALT+S পোস্ট, SHIFT+ALT+P পূর্বরূপ';
 $txt['shortcuts_drafts_firefox'] = 'শর্টকাট: SHIFT+ALT+S পোস্ট, SHIFT+ALT+P পূর্বরূপ, SHIFT+ALT+D খসড়া সংরক্ষণ করুন';
 $txt['shortcuts_mac'] = 'শর্টকাট: ⌃⌥S পোস্ট বা ⌃⌥P পূর্বরূপ';
 $txt['shortcuts_drafts_mac'] = 'শর্টকাট: ⌃⌥S পোস্ট, ⌃⌥P পূর্বরূপ, ⌃⌥D খসড়া সংরক্ষণ করুন';
 $txt['option'] = 'বিকল্প';
 $txt['reset_votes'] = 'ভোটের সংখ্যা পুনরায় সেট করুন';
 $txt['reset_votes_check'] = 'আপনি যদি সমস্ত ভোট গণনা 0 এ পুনরায় সেট করতে চান তবে এটি পরীক্ষা করুন।';
 $txt['votes'] = 'ভোট';
 $txt['attach'] = 'সংযুক্ত করুন';
 $txt['attachment'] = 'সংযুক্তি';
 $txt['attachments'] = 'সংযুক্তি';
 $txt['clean_attach'] = 'সংযুক্তিগুলি পরিষ্কার করুন';
 $txt['attached'] = 'সংযুক্ত';
 $txt['allowed_types'] = 'অনুমোদিত ফাইল প্রকার';
 $txt['attach_add'] = 'ফাইল যোগ করুন';
 $txt['attach_drop_zone'] = 'ফাইল সংযুক্ত করতে এখানে ক্লিক করুন বা টেনে আনুন।';
 $txt['attach_drop_unlimited'] = 'সীমাহীন';
 $txt['attach_drop_zone_no'] = 'আপনার ব্রাউজার ড্র্যাগ অ্যান্ড ড্রপ ফাইল আপলোড সমর্থন করে না';
 $txt['cant_upload_type'] = 'আপনি এই ধরনের ফাইল আপলোড করতে পারবেন না।  শুধুমাত্র অনুমোদিত এক্সটেনশন হল %1$s৷';
 $txt['uncheck_unwatchd_attach'] = 'আপনি যে সংযুক্তিগুলি আর সংযুক্ত করতে চান না সেগুলি আনচেক করুন';
 $txt['restricted_filename'] = 'এটি একটি সীমাবদ্ধ ফাইলের নাম।  একটি ভিন্ন ফাইলের নাম চেষ্টা করুন.';
 $txt['topic_locked_no_reply'] = 'সতর্কতা!  এই বিষয়টি বর্তমানে/লক করা হবে<br>শুধুমাত্র প্রশাসক এবং মডারেটররাই উত্তর দিতে পারবেন।';
 $txt['awaiting_approval'] = 'অনুমোদনের অপেক্ষায়';
 $txt['attachment_requires_approval'] = 'উল্লেখ্য যে কোনো মডারেটর অনুমোদিত না হওয়া পর্যন্ত কোনো ফাইল সংযুক্ত করা হবে না।';
 $txt['error_temp_attachments'] = 'অ্যাটাচমেন্ট পাওয়া গেছে, যেগুলো আপনি আগে সংযুক্ত করেছেন কিন্তু পোস্ট করেননি।  এই সংযুক্তিগুলি এখন এই পোস্টে সংযুক্ত করা হয়েছে.  আপনি যদি তাদের এই পোস্টে অন্তর্ভুক্ত করতে না চান তবে আপনি সেগুলিকে <a href="#postAttachment">এখানে</a> সরিয়ে দিতে পারেন৷';
 // নিচের স্ট্রিং-এ সাংখ্যিক সত্তা ব্যবহার করুন।
 $txt['js_post_will_require_approval'] = 'অনুস্মারক: একজন মডারেটর অনুমোদিত না হওয়া পর্যন্ত এই পোস্টটি প্রদর্শিত হবে না।';

 $txt['enter_comment'] = 'মন্তব্য লিখুন';
 // নিচের দুটি স্ট্রিং-এ সাংখ্যিক সত্তা ব্যবহার করুন।
 $txt['reported_post'] = 'রিপোর্ট করা পোস্ট';
 $txt['reported_to_mod_by'] = 'দ্বারা';
 $txt['report_submit'] = 'জমা দিন';
 // নিচের চারটি স্ট্রিং-এ সাংখ্যিক সত্তা ব্যবহার করুন।
 $txt['report_following_post'] = 'নিম্নলিখিত পোস্ট, "%1$s" দ্বারা';
 $txt['reported_by'] = 'এর দ্বারা রিপোর্ট করা হয়েছে';
 $txt['board_moderate'] = 'একটি বোর্ডে আপনি মডারেট';
 $txt['report_comment'] = 'প্রতিবেদক নিম্নলিখিত মন্তব্য করেছেন';

 // নিচের তিনটি স্ট্রিং-এ সাংখ্যিক সত্তা ব্যবহার করুন।
 $txt['report_profile'] = '\'%1$s\' এর প্রোফাইল প্রতিবেদন করুন;
 $txt['reported_profile'] = 'প্রতিবেদিত ব্যবহারকারী';
 $txt['report_following_user'] = '%2$s'-এ "%1$s"-এর প্রোফাইল;

 $txt['attach_restrict_attachmentPostLimit'] = 'সর্বোচ্চ মোট আকার %1$s KB';
 $txt['attach_restrict_attachmentPostLimit_MB'] = 'সর্বোচ্চ মোট আকার %1$s MB';
 $txt['attach_restrict_attachmentSizeLimit'] = 'সর্বাধিক পৃথক আকার %1$s KB';
 $txt['attach_restrict_attachmentSizeLimit_MB'] = 'সর্বাধিক পৃথক আকার %1$s MB';
 $txt['attach_restrict_attachmentNumPerPostLimit'] = 'প্রতি পোস্টে %1$d';
 $txt['attach_restrictions'] = 'নিষেধাজ্ঞা:';

 $txt['post_additionalopt_attach'] = 'সংযুক্তি এবং অন্যান্য বিকল্প';
 $txt['post_additionalopt'] = 'অন্যান্য বিকল্প';
 $txt['sticky_after_posting'] = 'এই বিষয়টি স্টিকি';
 $txt['move_after_posting'] = 'এই বিষয়টি সরান';
 $txt['back_to_topic'] = 'এই বিষয়ে ফিরে যান';
 $txt['approve_this_post'] = 'এই পোস্টটি অনুমোদন করুন';

 $txt['retrieving_quote'] = 'উদ্ধৃতি পুনরুদ্ধার করা হচ্ছে...';

 $txt['post_visual_verification_label'] = 'যাচাই';
 $txt['post_visual_verification_desc'] = 'এই পোস্টটি করার জন্য অনুগ্রহ করে উপরের ছবিতে কোডটি লিখুন।';

 $txt['poll_options'] = 'পোল অপশন';
 $txt['poll_run'] = 'এর জন্য পোল চালান';
 $txt['poll_run_limit'] = '(কোন সীমা ছাড়াই ফাঁকা ছেড়ে দিন।)';
 $txt['poll_results_visibility'] = 'ফলাফল দৃশ্যমানতা';
 $txt['poll_results_anyone'] = 'পোলের ফলাফল যে কাউকে দেখান।';
 $txt['poll_results_voted'] = 'কেউ ভোট দেওয়ার পরে শুধুমাত্র ফলাফল দেখান।';
 $txt['poll_results_after'] = 'শুধুমাত্র ভোটের মেয়াদ শেষ হওয়ার পর ফলাফল দেখান।';
 $txt['poll_max_votes'] = 'ব্যবহারকারী প্রতি সর্বোচ্চ ভোট';
 $txt['poll_do_change_vote'] = 'ব্যবহারকারীদের ভোট পরিবর্তন করার অনুমতি দিন';
 $txt['poll_too_many_votes'] = 'আপনি অনেকগুলো বিকল্প বেছে নিয়েছেন।  এই পোলের জন্য, আপনি শুধুমাত্র %1$s বিকল্প নির্বাচন করতে পারেন৷';
 $txt['poll_add_option'] = 'অপশন যোগ করুন';
 $txt['poll_guest_vote'] = 'অতিথিদের ভোট দেওয়ার অনুমতি দিন';

 $txt['spellcheck_done'] = 'বানান পরীক্ষা সম্পূর্ণ।';
 $txt['spellcheck_change_to'] = 'এতে পরিবর্তন করুন:';
 $txt['spellcheck_suggest'] = 'পরামর্শ:';
 $txt['spellcheck_change'] = 'পরিবর্তন';
 $txt['spellcheck_change_all'] = 'সব পরিবর্তন করুন';
 $txt['spellcheck_ignore'] = 'উপেক্ষা করুন';
 $txt['spellcheck_ignore_all'] = 'সব উপেক্ষা করুন';

 $txt['more_attachments'] = 'আরো সংযুক্তি';
 // নিচের স্ট্রিং এ সত্তা ব্যবহার করবেন না।
 $txt['more_attachments_error'] = 'দুঃখিত, আপনাকে আর কোনো সংযুক্তি পোস্ট করার অনুমতি নেই।';

 $txt['more_smileys'] = 'আরো';
 $txt['more_smileys_title'] = 'অতিরিক্ত স্মাইলিস';
 $txt['more_smileys_pick'] = 'একটি স্মাইলি বাছুন';
 $txt['more_smileys_close_window'] = 'জানালা বন্ধ করুন';

 $txt['error_new_reply'] = 'সতর্কতা - আপনি যখন টাইপ করছিলেন তখন একটি নতুন উত্তর পোস্ট করা হয়েছে।  আপনি আপনার পোস্ট পর্যালোচনা করতে পারেন.';
 $txt['error_new_replies'] = 'সতর্কতা - আপনি যখন টাইপ করছিলেন তখন %1$dটি নতুন উত্তর পোস্ট করা হয়েছে।  আপনি আপনার পোস্ট পর্যালোচনা করতে পারেন.';
 $txt['error_new_reply_reading'] = 'সতর্কতা - আপনি যখন পড়ছিলেন তখন একটি নতুন উত্তর পোস্ট করা হয়েছে।  আপনি আপনার পোস্ট পর্যালোচনা করতে পারেন.';
 $txt['error_new_replies_reading'] = 'সতর্কতা - আপনি যখন পড়ছিলেন তখন %1$dটি নতুন উত্তর পোস্ট করা হয়েছে।  আপনি আপনার পোস্ট পর্যালোচনা করতে পারেন.';

 $txt['error_topic_locked'] = 'সতর্কতা - আপনি যখন টপিক টাইপ করছিলেন তখন লক হয়ে গিয়েছিল।  আপনি যদি এই ক্রিয়াটিকে পূর্বাবস্থায় ফেরাতে না চান তাহলে অনুগ্রহ করে নীচের "সংযুক্তি এবং অন্যান্য বিকল্পগুলি" এর অধীনে "এই বিষয়টি লক করুন" বাক্সটি চেক করুন৷';
 $txt['error_topic_unlocked'] = 'সতর্কতা - আপনি যখন বিষয় টাইপ করছিলেন তখন তা আনলক করা হয়েছিল।  আপনি যদি এই ক্রিয়াটিকে পূর্বাবস্থায় ফেরাতে না চান তাহলে অনুগ্রহ করে নীচের "সংযুক্তি এবং অন্যান্য বিকল্পগুলি" এর অধীনে "এই বিষয়টি লক করুন" বাক্সটি আনচেক করুন৷';
 $txt['error_topic_stickied'] = 'সতর্কতা - আপনি যখন টাইপ করছিলেন তখন বিষয় স্টিকি করা হয়েছিল।  আপনি যদি এই ক্রিয়াটিকে পূর্বাবস্থায় ফেরাতে না চান তাহলে অনুগ্রহ করে নীচের "সংযুক্তি এবং অন্যান্য বিকল্পগুলির" নীচে "স্টিকি এই বিষয়" বাক্সটি চেক করুন৷';
 $txt['error_topic_unstickied'] = 'সতর্কবাণী - আপনি যখন টপিকটি টাইপ করছিলেন তখন সেটি আনস্টিকি করা হয়নি।  আপনি যদি এই ক্রিয়াটিকে পূর্বাবস্থায় ফিরিয়ে আনতে না চান তাহলে অনুগ্রহ করে নীচের "সংযুক্তি এবং অন্যান্য বিকল্পগুলির" নীচে "স্টিকি এই বিষয়" বাক্সটি আনচেক করুন৷';

 $txt['announce_this_topic'] = 'সদস্যদের কাছে এই বিষয় সম্পর্কে একটি ঘোষণা পাঠান:';
 $txt['announce_title'] = 'একটি ঘোষণা পাঠান';
 $txt['announce_desc'] = 'এই ফর্মটি আপনাকে এই বিষয় সম্পর্কে নির্বাচিত সদস্য গোষ্ঠীতে একটি ঘোষণা পাঠাতে দেয়।';
 $txt['announce_sending'] = 'বিষয়ের ঘোষণা পাঠানো হচ্ছে';
 $txt['announce_done'] = 'সম্পন্ন';
 $txt['announce_continue'] = 'চালিয়ে যান';
 $txt['announce_topic'] = 'বিষয় ঘোষণা করুন';
 $txt['announce_regular_members'] = 'নিয়মিত সদস্য';

 $txt['digest_subject_daily'] = 'দৈনিক ডাইজেস্ট';
 $txt['digest_subject_weekly'] = 'সাপ্তাহিক ডাইজেস্ট';
 $txt['digest_intro_daily'] = 'নীচে আজ %1$s-এ আপনার সদস্যতা নেওয়া বোর্ড এবং বিষয়গুলির সমস্ত কার্যকলাপের সারাংশ রয়েছে৷  আনসাবস্ক্রাইব করতে নিচের লিঙ্কে যান।';
 $txt['digest_intro_weekly'] = 'নিচে এই সপ্তাহে %1$s-এ আপনার সদস্যতা নেওয়া বোর্ড এবং বিষয়গুলির সমস্ত কার্যকলাপের সারাংশ রয়েছে৷  আনসাবস্ক্রাইব করতে নিচের লিঙ্কে যান।';
 $txt['digest_new_topics'] = 'নিম্নলিখিত বিষয়গুলি শুরু করা হয়েছে';
 $txt['digest_new_topics_line'] = '"%2$s" এ "%1$s";
 $txt['digest_new_replies'] = 'নিম্নলিখিত বিষয়গুলিতে উত্তর দেওয়া হয়েছে';
 $txt['digest_new_replies_one'] = '1টি উত্তর "%1$s"';
 $txt['digest_new_replies_many'] = '%1$d উত্তর "%2$s" এ;
 $txt['digest_mod_actions'] = 'নিম্নলিখিত সংযম ব্যবস্থা নেওয়া হয়েছে';
 $txt['digest_mod_act_sticky'] = '"%1$s" স্টিকি করা হয়েছে';
 $txt['digest_mod_act_lock'] = '"%1$s" লক করা হয়েছে';
 $txt['digest_mod_act_unlock'] = '"%1$s" আনলক করা হয়েছে';
 $txt['digest_mod_act_remove'] = '"%1$s" সরানো হয়েছে';
 $txt['digest_mod_act_move'] = '"%1$s" সরানো হয়েছে';
 $txt['digest_mod_act_merge'] = '"%1$s" মার্জ করা হয়েছে';
 $txt['digest_mod_act_split'] = '"%1$s" বিভক্ত হয়েছে';

 $txt['attach_error_title'] = 'সংযুক্তি আপলোড করার সময় ত্রুটি।';
 $txt['attach_warning'] = '<strong>%1$s</strong> আপলোড করার সময় একটি সমস্যা ছিল।';
 $txt['attach_check_nag'] = 'অসম্পূর্ণ ডেটার (%1$s) কারণে চালিয়ে যাওয়া যাচ্ছে না।';
 $txt['attach_max_total_file_size'] = 'দুঃখিত, আপনি সংযুক্তি স্থানের বাইরে।  পোস্ট প্রতি অনুমোদিত মোট সংযুক্তি আকার হল %1$s KB৷  অবশিষ্ট স্থান %2$s KB.';
 $txt['attach_max_total_file_size_current'] = 'দুঃখিত, আপনি সংযুক্তি স্থানের বাইরে।  পোস্ট প্রতি অনুমোদিত বর্তমান মোট সংযুক্তি আকার হল {currentTotal} KB৷  নির্বাচিত ফাইলের মোট পরিমাণ হল {currentRemain} KB৷  অনুগ্রহ করে এক বা একাধিক সংযুক্তি মুছুন৷';
 $txt['attach_max_size_progress'] = 'প্রতি পোস্টে অনুমোদিত বর্তমান মোট সংযুক্তি আকার হল {currentTotal} KB।  নির্বাচিত ফাইলের মোট পরিমাণ হল {currentRemain} KB.';
 $txt['attach_folder_warning'] = 'সংযুক্তি ডিরেক্টরিটি অবস্থিত করা যাবে না।  অনুগ্রহ করে এই সমস্যার একজন প্রশাসককে অবহিত করুন।';
 $txt['attach_folder_admin_warning'] = 'সংযুক্তি ডিরেক্টরির (%1$s) পথটি ভুল।  আপনার অ্যাডমিন প্যানেলের সংযুক্তি সেটিংস এলাকায় এটি সংশোধন করুন.';
 $txt['attach_limit_nag'] = 'আপনি পোস্ট প্রতি অনুমোদিত সংযুক্তির সর্বোচ্চ সংখ্যায় পৌঁছেছেন।';
 $txt['attach_no_upload'] = 'একটি সমস্যা ছিল এবং আপনার সংযুক্তি আপলোড করা যায়নি';
 $txt['attach_remaining'] = '<span class="attach_remaining">%1$d</span> বাকি';
 $txt['attach_available'] = '%1$s KB উপলব্ধ';
 $txt['attach_kb'] = '(%1$s KB)';
 $txt['attach_0_byte_file'] = 'ফাইলটি খালি বলে মনে হচ্ছে।  এটি একটি সমস্যা হতে থাকলে আপনার ফোরাম প্রশাসকের সাথে যোগাযোগ করুন';
 $txt['attached_files_in_session'] = 'উপরে আন্ডারলাইন করা ফাইল(গুলি) আপলোড করা হয়েছে কিন্তু জমা না হওয়া পর্যন্ত এই পোস্টে সংযুক্ত করা হবে না।';
 $txt['attached_file_uploaded'] = 'সংযুক্তি সফলভাবে আপলোড হয়েছে!';
 $txt['attached_file_delete'] = 'মুছুন';
 $txt['attached_file_cannot'] = 'আপনি সংযুক্তি আপলোড করতে পারবেন না';
 $txt['attached_file_deleted'] = 'সংযুক্তিটি সফলভাবে মুছে ফেলা হয়েছে।';
 $txt['attached_file_deleted_error'] = 'মোছার সময় একটি ত্রুটি ছিল।';
 $txt['attached_insert_bbc'] = 'ঢোকান';
 $txt['attached_cancel_all'] = 'সব বাতিল করুন';
 $txt['attached_upload_all'] = 'সব আপলোড করুন';
 $txt['attachments_left'] = 'কিছু সংযুক্তি বাকি আছে, অনুগ্রহ করে সেগুলো আপলোড করুন বা পোস্ট করার আগে বাতিল করুন।';
 $txt['attached_insert_width'] = 'প্রস্থ সন্নিবেশ (px):';
 $txt['attached_insert_height'] = 'ঢোকান উচ্চতা (px):';

 $txt['attach_php_error'] = 'একটি ত্রুটির কারণে, আপনার সংযুক্তি আপলোড করা যায়নি।  এই সমস্যা চলতে থাকলে অনুগ্রহ করে ফোরাম প্রশাসকের সাথে যোগাযোগ করুন।';
 $txt['php_upload_error_1'] = 'আপলোড করা ফাইলটি php.ini-এ upload_max_filesize নির্দেশকে ছাড়িয়ে গেছে।  আপনি যদি এই সমস্যাটি সংশোধন করতে অক্ষম হন তাহলে অনুগ্রহ করে আপনার হোস্টের সাথে যোগাযোগ করুন৷';
 $txt['php_upload_error_3'] = 'আপলোড করা ফাইলটি শুধুমাত্র আংশিকভাবে আপলোড করা হয়েছে।  এটি একটি পিএইচপি সম্পর্কিত ত্রুটি।  এই সমস্যা চলতে থাকলে আপনার হোস্টের সাথে যোগাযোগ করুন।';
 $txt['php_upload_error_4'] = 'কোন ফাইল আপলোড করা হয়নি।  এটি একটি পিএইচপি সম্পর্কিত ত্রুটি।  এই সমস্যা চলতে থাকলে আপনার হোস্টের সাথে যোগাযোগ করুন।';
 $txt['php_upload_error_6'] = 'সংরক্ষণ করতে অক্ষম।  একটি অস্থায়ী ডিরেক্টরি অনুপস্থিত.  আপনি যদি এই সমস্যাটি সংশোধন করতে না পারেন তাহলে অনুগ্রহ করে আপনার হোস্টের সাথে যোগাযোগ করুন।';
 $txt['php_upload_error_7'] = 'ডিস্কে ফাইল লিখতে ব্যর্থ।  এটি একটি পিএইচপি সম্পর্কিত ত্রুটি।  এই সমস্যা চলতে থাকলে আপনার হোস্টের সাথে যোগাযোগ করুন।';
 $txt['php_upload_error_8'] = 'একটি PHP এক্সটেনশন ফাইল আপলোড বন্ধ করে দিয়েছে।  এটি একটি পিএইচপি সম্পর্কিত ত্রুটি।  এই সমস্যা চলতে থাকলে আপনার হোস্টের সাথে যোগাযোগ করুন।';
 $txt['error_temp_attachments_new'] = 'এমন কিছু সংযুক্তি আছে যা আপনি আগে সংযুক্ত করেছিলেন কিন্তু পোস্ট করেননি।  এই সংযুক্তিগুলি এখনও এই পোস্টে সংযুক্ত আছে.  এই সংযুক্তিগুলি সংরক্ষিত বা সরানোর আগে এই পোস্টটি জমা দিতে হবে৷  আপনি এটি <a href="#postAttachment">এখানে</a>' করতে পারেন;
 $txt['error_temp_attachments_found'] = 'নিম্নলিখিত সংযুক্তিগুলি পাওয়া গেছে যেগুলি আপনি আগে অন্য পোস্টে সংযুক্ত করেছিলেন কিন্তু পোস্ট করা হয়নি৷  এটি বাঞ্ছনীয় যে আপনি পোস্ট করবেন না যতক্ষণ না এগুলি সরানো হয় বা পোস্ট জমা না হয়৷<br>সেই সংযুক্তিগুলি সরাতে <a href="%1$s">এখানে</a> ক্লিক করুন৷  অথবা সেই পোস্টে ফিরে যেতে <a href="%2$s">এখানে</a>৷%3$s';
 $txt['error_temp_attachments_lost'] = 'নিম্নলিখিত সংযুক্তিগুলি পাওয়া গেছে যেগুলি আপনি আগে অন্য পোস্টে সংযুক্ত করেছিলেন কিন্তু পোস্ট করা হয়নি৷  এটি বাঞ্ছনীয় যে যতক্ষণ না এগুলি সরানো হয় বা পোস্ট জমা না দেওয়া হয় ততক্ষণ আপনি আর কোনো সংযুক্তি আপলোড করবেন না৷ এই সংযুক্তিগুলি সরাতে <a href="%1$s">এখানে</a> ক্লিক করুন৷%2$  s';
 $txt['error_temp_attachments_gone'] = 'এই সংযুক্তিগুলি এখন সরানো হয়েছে এবং আপনি যে পৃষ্ঠায় আগে ছিলেন সেখানে আপনাকে ফিরিয়ে দেওয়া হয়েছে';
 $txt['error_temp_attachments_flushed'] = 'অনুগ্রহ করে মনে রাখবেন যে কোনো ফাইল যা আগে সংযুক্ত করা হয়েছিল কিন্তু পোস্ট করা হয়নি এখন সরিয়ে দেওয়া হয়েছে।';
 $txt['error_cannot_post_attachment'] = 'আপনার কাছে %1$s এ সংযুক্তি পোস্ট করার অনুমতি নেই।  তাদের সরিয়ে দেওয়া হয়েছে।';
 $txt['error_topic_already_announced'] = 'অনুগ্রহ করে মনে রাখবেন যে এই বিষয়টি ইতিমধ্যেই ঘোষণা করা হয়েছে।';

 $txt['cant_access_upload_path'] = 'সংযুক্তি আপলোড পাথ অ্যাক্সেস করতে পারবেন না!';
 $txt['file_too_big'] = 'আপনার ফাইলটি অনেক বড়।  অনুমোদিত সর্বোচ্চ সংযুক্তি আকার হল %1$s KB।';
 $txt['attach_timeout'] = 'আপনার সংযুক্তি সংরক্ষণ করা যায়নি।  এটি ঘটতে পারে কারণ এটি আপলোড করতে খুব বেশি সময় নিয়েছে বা ফাইলটি সার্ভারের অনুমতির চেয়ে বড়৷<br><br>আরো তথ্যের জন্য দয়া করে আপনার সার্ভার প্রশাসকের সাথে পরামর্শ করুন৷';
 $txt['bad_attachment'] = 'আপনার সংযুক্তি নিরাপত্তা পরীক্ষা ব্যর্থ হয়েছে এবং আপলোড করা যাবে না।  অনুগ্রহ করে ফোরাম প্রশাসকের সাথে পরামর্শ করুন।';
 $txt['ran_out_of_space'] = 'আপলোড ডিরেক্টরি পূর্ণ।  এই সমস্যা সম্পর্কে একজন প্রশাসকের সাথে যোগাযোগ করুন।';
 $txt['attachments_no_write'] = 'সংযুক্তি আপলোড ডিরেক্টরি লেখার যোগ্য নয়।  আপনার সংযুক্তি সংরক্ষণ করা যাবে না.';
 $txt['avatars_no_write'] = 'অবতার আপলোড ডিরেক্টরি লেখার যোগ্য নয়।  আপনার অবতার সংরক্ষণ করা যাবে না.';
 $txt['attachments_no_create'] = 'একটি নতুন সংযুক্তি ডিরেক্টরি তৈরি করতে অক্ষম।  আপনার সংযুক্তি বা অবতার সংরক্ষণ করা যাবে না.';
 $txt['attachments_limit_per_post'] = 'আপনি প্রতি পোস্টে %1$dটির বেশি সংযুক্তি আপলোড করতে পারবেন না';

 $txt['approval_status'] = 'অনুমোদনের স্থিতি';
 $txt['approval_status_1'] = 'অনুমোদিত';
 $txt['approval_status_0'] = 'অনুমোদনের অপেক্ষায়';

 ?>