<?php
// Version: 2.1.4; Post

global $context;

$txt['post_reply'] = 'প্রতিবেদন পোস্ট করুন';
$txt['message_icon'] = 'বার্তার আইকন';
$txt['subject_not_filled'] = 'বিষয় ক্ষেত্র পূর্ণ করা হয়নি। এটি আবশ্যক।';
$txt['message_body_not_filled'] = 'বার্তার শরীর পূর্ণ করা হয়নি। এটি আবশ্যক।';
// Use numeric entities in the below string.
$txt['add_bbc'] = 'BBC ট্যাগ যোগ করুন';

$txt['disable_smileys'] = 'মুখাবয়ব নিষ্ক্রিয় করুন';
$txt['dont_use_smileys'] = 'মুখাবয়ব ব্যবহার করবেন না';
// Escape any single quotes in here twice.. 'it\'s' -> 'it\\\'s'.
$txt['posted_on'] = 'প্রকাশিত হয়েছে';
$txt['standard'] = 'মানক';
$txt['thumbs_up'] = 'থাম্ব আপ';
$txt['thumbs_down'] = 'থাম্ব ডাউন';
$txt['exclamation_point'] = 'বিস্ময়বোধক চিহ্ন';
$txt['question_mark'] = 'প্রশ্নবোধক চিহ্ন';
$txt['icon_poll'] = 'পোল';
$txt['lamp'] = 'ল্যাম্প';
$txt['add_smileys'] = 'মুখাবয়ব যোগ করুন';
$txt['topic_notify_no'] = 'কোনও বিজ্ঞপ্তি সহ বিষয় নেই';
// post_too_long seems unused (duplicate in Errors: error_post_too_long
$txt['post_too_long'] = 'আপনার বার্তা খুব দীর্ঘ। দয়া করে ফিরে যান এবং এটি সংক্ষিপ্ত করুন, তারপর আবার চেষ্টা করুন।';

// Use numeric entities in the below five strings.
$txt['notifyUnsubscribe'] = 'এই বিষয় থেকে সদস্যতা বাতিল করতে এখানে ক্লিক করুন';

$txt['lock_after_post'] = 'পোস্ট করার পর লক করুন';
$txt['notify_replies'] = 'প্রতিক্রিয়ার জন্য আমাকে জানান';
$txt['lock_topic'] = 'এই বিষয়টি লক করুন';
$txt['shortcuts'] = 'শর্টকাট: ALT+S পোস্ট বা ALT+P প্রিভিউ';
$txt['shortcuts_drafts'] = 'শর্টকাট: ALT+S পোস্ট, ALT+P প্রিভিউ, ALT+D খসড়া সংরক্ষণ করুন';
$txt['shortcuts_firefox'] = 'শর্টকাট: SHIFT+ALT+S পোস্ট, SHIFT+ALT+P প্রিভিউ';
$txt['shortcuts_drafts_firefox'] = 'শর্টকাট: SHIFT+ALT+S পোস্ট, SHIFT+ALT+P প্রিভিউ, SHIFT+ALT+D খসড়া সংরক্ষণ করুন';
$txt['shortcuts_mac'] = 'শর্টকাট: ⌃⌥S পোস্ট বা ⌃⌥P প্রিভিউ';
$txt['shortcuts_drafts_mac'] = 'শর্টকাট: ⌃⌥S পোস্ট, ⌃⌥P প্রিভিউ, ⌃⌥D খসড়া সংরক্ষণ করুন';
$txt['option'] = 'বিকল্প';
$txt['reset_votes'] = 'ভোটের সংখ্যা পুনরায় সেট করুন';
$txt['reset_votes_check'] = 'আপনি যদি সমস্ত ভোটের সংখ্যা 0-এ পুনরায় সেট করতে চান তবে এটি চেক করুন।';
$txt['votes'] = 'ভোট';
$txt['attach'] = 'সংযুক্ত করুন';
$txt['attachment'] = 'সংযুক্তি';
$txt['attachments'] = 'সংযুক্তিগুলি';
$txt['clean_attach'] = 'সংযুক্তি পরিষ্কার করুন';
$txt['attached'] = 'সংযুক্ত';
$txt['allowed_types'] = 'অনুমোদিত ফাইলের ধরন';
$txt['attach_add'] = 'ফাইল যোগ করুন';
$txt['attach_drop_zone'] = 'সংযুক্ত করতে এখানে ক্লিক করুন বা ফাইলগুলি ড্র্যাগ করুন।';
$txt['attach_drop_unlimited'] = 'অসীম';
$txt['attach_drop_zone_no'] = 'আপনার ব্রাউজার ড্র্যাগ এবং ড্রপ ফাইল আপলোড সমর্থন করে না';
$txt['cant_upload_type'] = 'আপনি সেই ধরনের ফাইল আপলোড করতে পারছেন না। একমাত্র অনুমোদিত এক্সটেনশনগুলি হল %1$s।';
$txt['uncheck_unwatchd_attach'] = 'যে সংযুক্তিগুলি আপনি আর সংযুক্ত রাখতে চান না সেগুলি আনচেক করুন';
$txt['restricted_filename'] = 'এটি একটি সীমাবদ্ধ ফাইলের নাম। দয়া করে একটি ভিন্ন ফাইলের নাম চেষ্টা করুন।';
$txt['topic_locked_no_reply'] = 'সতর্কতা! এই বিষয়টি বর্তমানে/হবে লক করা<br>শুধুমাত্র অ্যাডমিন এবং মডারেটররা উত্তর দিতে পারবেন।';
$txt['awaiting_approval'] = 'অনুমোদনের অপেক্ষায়';
$txt['attachment_requires_approval'] = 'যে কোনও ফাইল সংযুক্ত করা হলে তা মডারেটরের দ্বারা অনুমোদিত না হওয়া পর্যন্ত প্রদর্শিত হবে না, তা মনে রাখবেন।';
$txt['error_temp_attachments'] = 'এমন কিছু সংযুক্তি পাওয়া গেছে, যা আপনি আগে সংযুক্ত করেছিলেন কিন্তু পোস্ট করেননি। এই সংযুক্তিগুলি এখন এই পোস্টে সংযুক্ত। যদি আপনি এগুলি এই পোস্টে অন্তর্ভুক্ত করতে না চান তবে আপনি সেগুলি <a href="#postAttachment">এখানে</a> মুছে ফেলতে পারেন।';
// Use numeric entities in the below string.
$txt['js_post_will_require_approval'] = 'মনে রাখবেন: এই পোস্টটি একটি মডারেটর দ্বারা অনুমোদিত না হওয়া পর্যন্ত প্রদর্শিত হবে না।';

$txt['enter_comment'] = 'মন্তব্য লিখুন';
// Use numeric entities in the below two strings.
$txt['reported_post'] = 'প্রতিবেদিত পোস্ট';
$txt['reported_to_mod_by'] = 'দ্বারা';
$txt['report_submit'] = 'জমা দিন';
// Use numeric entities in the below four strings.
$txt['report_following_post'] = 'নিচের পোস্ট, "%1$s" দ্বারা';
$txt['reported_by'] = 'দ্বারা প্রতিবেদন করা হয়েছে';
$txt['board_moderate'] = 'একটি বোর্ডে যা আপনি পরিচালনা করেন';
$txt['report_comment'] = 'প্রতিবেদক নিম্নলিখিত মন্তব্য করেছেন';

// Use numeric entities in the below three strings.
$txt['report_profile'] = '\'%1$s\' এর প্রোফাইল রিপোর্ট করুন';
$txt['reported_profile'] = 'প্রতিবেদিত ব্যবহারকারী';
$txt['report_following_user'] = '"%1$s" এর প্রোফাইল %2$s এ';

$txt['attach_restrict_attachmentPostLimit'] = 'সর্বাধিক মোট আকার %1$s KB';
$txt['attach_restrict_attachmentPostLimit_MB'] = 'সর্বাধিক মোট আকার %1$s MB';
$txt['attach_restrict_attachmentSizeLimit'] = 'সর্বাধিক একক আকার %1$s KB';
$txt['attach_restrict_attachmentSizeLimit_MB'] = 'সর্বাধিক একক আকার %1$s MB';
$txt['attach_restrict_attachmentNumPerPostLimit'] = '%1$d প্রতি পোস্ট';
$txt['attach_restrictions'] = 'সীমাবদ্ধতা:';

$txt['post_additionalopt_attach'] = 'সংযুক্তি এবং অন্যান্য বিকল্প';
$txt['post_additionalopt'] = 'অন্যান্য বিকল্প';
$txt['sticky_after_posting'] = 'এই বিষয়টি স্টিকি করুন';
$txt['move_after_posting'] = 'এই বিষয়টি সরান';
$txt['back_to_topic'] = 'এই বিষয়টিতে ফিরে যান';
$txt['approve_this_post'] = 'এই পোস্টটি অনুমোদন করুন';

$txt['retrieving_quote'] = 'উদ্ধৃতি পুনরুদ্ধার করা হচ্ছে...';

$txt['post_visual_verification_label'] = 'যাচাইকরণ';
$txt['post_visual_verification_desc'] = 'এই পোস্টটি করতে উপরের ছবির কোডটি দয়া করে লিখুন।';

$txt['poll_options'] = 'পোলের বিকল্পগুলি';
$txt['poll_run'] = 'পোলটি চালান';
$txt['poll_run_limit'] = '(সীমা ছাড়াই খালি রাখুন।)';
$txt['poll_results_visibility'] = 'ফলাফল দৃশ্যমানতা';
$txt['poll_results_anyone'] = 'পোলের ফলাফল যেকোনো ব্যক্তির জন্য দেখান।';
$txt['poll_results_voted'] = 'কেবল তখনই ফলাফল দেখান যখন কেউ ভোট দিয়েছে।';
$txt['poll_results_after'] = 'পোলের মেয়াদ শেষ হওয়ার পর কেবল ফলাফল দেখান।';
$txt['poll_max_votes'] = 'প্রতি ব্যবহারকারীর জন্য সর্বাধিক ভোট';
$txt['poll_do_change_vote'] = 'ব্যবহারকারীদের ভোট পরিবর্তন করতে অনুমতি দিন';
$txt['poll_too_many_votes'] = 'আপনি খুব বেশি বিকল্প নির্বাচন করেছেন। এই পোলের জন্য, আপনি কেবল %1$sটি বিকল্প নির্বাচন করতে পারেন।';
$txt['poll_add_option'] = 'বিকল্প যোগ করুন';
$txt['poll_guest_vote'] = 'অতিথিদের ভোট দিতে অনুমতি দিন';

$txt['spellcheck_done'] = 'বানান পরীক্ষা সম্পন্ন।';
$txt['spellcheck_change_to'] = 'এতে পরিবর্তন করুন:';
$txt['spellcheck_suggest'] = 'সুপারিশ:';
$txt['spellcheck_change'] = 'পরিবর্তন করুন';
$txt['spellcheck_change_all'] = 'সব পরিবর্তন করুন';
$txt['spellcheck_ignore'] = 'উপেক্ষা করুন';
$txt['spellcheck_ignore_all'] = 'সব উপেক্ষা করুন';

$txt['more_attachments'] = 'আরও সংযুক্তি';
// Don't use entities in the below string.
$txt['more_attachments_error'] = 'দুঃখিত, আপনাকে আর কোনও সংযুক্তি পোস্ট করার অনুমতি দেওয়া হয়নি।';

$txt['more_smileys'] = 'আরও';
$txt['more_smileys_title'] = 'অতিরিক্ত স্মাইলি';
$txt['more_smileys_pick'] = 'একটি স্মাইলি নির্বাচন করুন';
$txt['more_smileys_close_window'] = 'জানলা বন্ধ করুন';

$txt['error_new_reply'] = 'সতর্কতা - যখন আপনি নতুন একটি উত্তর টাইপ করছিলেন, তখন একটি নতুন উত্তর পোস্ট করা হয়েছে। আপনি আপনার পোস্টটি পর্যালোচনা করতে চাইতে পারেন।';
$txt['error_new_replies'] = 'সতর্কতা - যখন আপনি টাইপ করছিলেন, %1$d নতুন উত্তর পোস্ট করা হয়েছে। আপনি আপনার পোস্টটি পর্যালোচনা করতে চাইতে পারেন।';
$txt['error_new_reply_reading'] = 'সতর্কতা - যখন আপনি পড়ছিলেন, তখন একটি নতুন উত্তর পোস্ট করা হয়েছে। আপনি আপনার পোস্টটি পর্যালোচনা করতে চাইতে পারেন।';
$txt['error_new_replies_reading'] = 'সতর্কতা - যখন আপনি পড়ছিলেন, %1$d নতুন উত্তর পোস্ট করা হয়েছে। আপনি আপনার পোস্টটি পর্যালোচনা করতে চাইতে পারেন।';

$txt['error_topic_locked'] = 'সতর্কতা - যখন আপনি টাইপ করছিলেন, বিষয়টি লক করা হয়েছিল। আপনি যদি এই কাজটি বাতিল করতে না চান তবে "সংযুক্তি এবং অন্যান্য বিকল্প" এর অধীনে "এই বিষয়টি লক করুন" বাক্সটি চেক করুন।';
$txt['error_topic_unlocked'] = 'সতর্কতা - যখন আপনি টাইপ করছিলেন, বিষয়টি আনলক করা হয়েছিল। আপনি যদি এই কাজটি বাতিল করতে না চান তবে "সংযুক্তি এবং অন্যান্য বিকল্প" এর অধীনে "এই বিষয়টি লক করুন" বাক্সটি আনচেক করুন।';
$txt['error_topic_stickied'] = 'সতর্কতা - যখন আপনি টাইপ করছিলেন, বিষয়টি স্টিকি করা হয়েছিল। আপনি যদি এই কাজটি বাতিল করতে না চান তবে "সংযুক্তি এবং অন্যান্য বিকল্প" এর অধীনে "এই বিষয়টি স্টিকি করুন" বাক্সটি চেক করুন।';
$txt['error_topic_unstickied'] = 'সতর্কতা - যখন আপনি টাইপ করছিলেন, বিষয়টি আনস্টিকি করা হয়েছিল। আপনি যদি এই কাজটি বাতিল করতে না চান তবে "সংযুক্তি এবং অন্যান্য বিকল্প" এর অধীনে "এই বিষয়টি স্টিকি করুন" বাক্সটি আনচেক করুন।';

$txt['announce_this_topic'] = 'এই বিষয় সম্পর্কে সদস্যদের জন্য একটি ঘোষণা পাঠান:';
$txt['announce_title'] = 'একটি ঘোষণা পাঠান';
$txt['announce_desc'] = 'এই ফর্মটি আপনাকে নির্বাচিত সদস্যগোষ্ঠীর কাছে এই বিষয় সম্পর্কে একটি ঘোষণা পাঠাতে দেয়।';
$txt['announce_sending'] = 'বিষয়ের ঘোষণা পাঠানো হচ্ছে';
$txt['announce_done'] = 'সম্পন্ন';
$txt['announce_continue'] = 'জারি রাখুন';
$txt['announce_topic'] = 'বিষয় ঘোষণা করুন';
$txt['announce_regular_members'] = 'নিয়মিত সদস্যরা';

$txt['digest_subject_daily'] = 'দৈনিক সারসংক্ষেপ';
$txt['digest_subject_weekly'] = 'সাপ্তাহিক সারসংক্ষেপ';
$txt['digest_intro_daily'] = 'নীচে %1$s এ আপনার সাবস্ক্রাইব করা বোর্ড এবং বিষয়গুলিতে সমস্ত কার্যকলাপের একটি সারসংক্ষেপ রয়েছে। সদস্যতা বাতিল করতে দয়া করে নিচের লিঙ্কটি পরিদর্শন করুন।';
$txt['digest_intro_weekly'] = 'নীচে %1$s এ আপনার সাবস্ক্রাইব করা বোর্ড এবং বিষয়গুলিতে সমস্ত কার্যকলাপের একটি সারসংক্ষেপ রয়েছে। সদস্যতা বাতিল করতে দয়া করে নিচের লিঙ্কটি পরিদর্শন করুন।';
$txt['digest_new_topics'] = 'নিচের বিষয়গুলি শুরু হয়েছে';
$txt['digest_new_topics_line'] = '"%1$s" এ "%2$s"';
$txt['digest_new_replies'] = 'নিচের বিষয়গুলিতে উত্তর দেওয়া হয়েছে';
$txt['digest_new_replies_one'] = '"%1$s" এ 1টি উত্তর';
$txt['digest_new_replies_many'] = '"%2$s" এ %1$dটি উত্তর';
$txt['digest_mod_actions'] = 'নিচের মডারেশন কার্যক্রমগুলি ঘটেছে';
$txt['digest_mod_act_sticky = '"%1$s" স্টিকি করা হয়েছে';
$txt['digest_mod_act_lock'] = '"%1$s" লক করা হয়েছে';
$txt['digest_mod_act_unlock'] = '"%1$s" আনলক করা হয়েছে';
$txt['digest_mod_act_remove'] = '"%1$s" মুছে ফেলা হয়েছে';
$txt['digest_mod_act_move'] = '"%1$s" স্থানান্তরিত হয়েছে';
$txt['digest_mod_act_merge'] = '"%1$s" একত্রিত করা হয়েছে';
$txt['digest_mod_act_split'] = '"%1$s" বিভক্ত করা হয়েছে';

$txt['attach_error_title'] = 'সংযুক্তি আপলোড করতে ত্রুটি।';
$txt['attach_warning'] = '<strong>%1$s</strong> আপলোড করার সময় একটি সমস্যা হয়েছে।';
$txt['attach_check_nag'] = 'অপূর্ণ ডেটার কারণে ( %1$s ) এগিয়ে যাওয়া সম্ভব নয়।';
$txt['attach_max_total_file_size'] = 'দুঃখিত, আপনার সংযুক্তির স্থান শেষ হয়ে গেছে। প্রতি পোস্টে অনুমোদিত সর্বাধিক সংযুক্তির আকার %1$s KB। অবশিষ্ট স্থান %2$s KB।';
$txt['attach_max_total_file_size_current'] = 'দুঃখিত, আপনার সংযুক্তির স্থান শেষ হয়ে গেছে। প্রতি পোস্টে বর্তমানে অনুমোদিত সর্বাধিক সংযুক্তির আকার {currentTotal} KB। নির্বাচিত ফাইলগুলির মোট পরিমাণ {currentRemain} KB। দয়া করে একটি বা একাধিক সংযুক্তি মুছে ফেলুন।';
$txt['attach_max_size_progress'] = 'প্রতি পোস্টে বর্তমানে অনুমোদিত সর্বাধিক সংযুক্তির আকার {currentTotal} KB। নির্বাচিত ফাইলগুলির মোট পরিমাণ {currentRemain} KB।';
$txt['attach_folder_warning'] = 'সংযুক্তির ডিরেক্টরি খুঁজে পাওয়া যায়নি। দয়া করে এই সমস্যার বিষয়ে একজন প্রশাসককে জানান।';
$txt['attach_folder_admin_warning'] = 'সংযুক্তির ডিরেক্টরির পাথ (%1$s) ভুল। দয়া করে এটি আপনার প্রশাসক প্যানেলের সংযুক্তি সেটিংস এলাকায় সঠিক করুন।';
$txt['attach_limit_nag'] = 'আপনি প্রতি পোস্টে অনুমোদিত সর্বাধিক সংখ্যক সংযুক্তিতে পৌঁছেছেন।';
$txt['attach_no_upload'] = 'একটি সমস্যা হয়েছে এবং আপনার সংযুক্তিগুলি আপলোড করা যায়নি।';
$txt['attach_remaining'] = '<span class="attach_remaining">%1$d</span> অবশিষ্ট';
$txt['attach_available'] = '%1$s KB উপলব্ধ';
$txt['attach_kb'] = ' (%1$s KB)';
$txt['attach_0_byte_file'] = 'ফাইলটি খালি মনে হচ্ছে। যদি এই সমস্যা অব্যাহত থাকে তবে দয়া করে আপনার ফোরাম প্রশাসকের সাথে যোগাযোগ করুন।';
$txt['attached_files_in_session'] = 'উপরের আন্ডারলাইন করা ফাইল(গুলি) আপলোড করা হয়েছে কিন্তু এটি জমা না হওয়া পর্যন্ত এই পোস্টের সাথে সংযুক্ত হবে না।';
$txt['attached_file_uploaded'] = 'সংযুক্তি সফলভাবে আপলোড করা হয়েছে!';
$txt['attached_file_delete'] = 'মুছুন';
$txt['attached_file_cannot'] = 'আপনি সংযুক্তি আপলোড করতে পারবেন না।';
$txt['attached_file_deleted'] = 'সংযুক্তিটি সফলভাবে মুছে ফেলা হয়েছে।';
$txt['attached_file_deleted_error'] = 'মুছে ফেলার সময় একটি ত্রুটি হয়েছে।';
$txt['attached_insert_bbc'] = 'সন্নিবেশ করুন';
$txt['attached_cancel_all'] = 'সব বাতিল করুন';
$txt['attached_upload_all'] = 'সব আপলোড করুন';
$txt['attachments_left'] = 'কিছু সংযুক্তি বাকি রয়েছে, দয়া করে সেগুলি আপলোড করুন অথবা পোস্ট করার আগে বাতিল করুন।';
$txt['attached_insert_width'] = 'প্রস্থ সন্নিবেশ করুন (px):';
$txt['attached_insert_height'] = 'উচ্চতা সন্নিবেশ করুন (px):';

$txt['attach_php_error'] = 'একটি ত্রুটির কারণে, আপনার সংযুক্তিটি আপলোড করা যায়নি। যদি এই সমস্যা অব্যাহত থাকে তবে দয়া করে ফোরাম প্রশাসকের সাথে যোগাযোগ করুন।';
$txt['php_upload_error_1'] = 'আপলোড করা ফাইলটি php.ini তে upload_max_filesize নির্দেশিকা অতিক্রম করে। যদি আপনি এই সমস্যা সমাধান করতে অক্ষম হন তবে দয়া করে আপনার হোস্টের সাথে যোগাযোগ করুন।';
$txt['php_upload_error_3'] = 'আপলোড করা ফাইলটি কেবল আংশিকভাবে আপলোড হয়েছে। এটি একটি PHP সম্পর্কিত ত্রুটি। যদি এই সমস্যা অব্যাহত থাকে তবে দয়া করে আপনার হোস্টের সাথে যোগাযোগ করুন।';
$txt['php_upload_error_4'] = 'কোন ফাইল আপলোড করা হয়নি। এটি একটি PHP সম্পর্কিত ত্রুটি। যদি এই সমস্যা অব্যাহত থাকে তবে দয়া করে আপনার হোস্টের সাথে যোগাযোগ করুন।';
$txt['php_upload_error_6'] = 'সংরক্ষণ করতে অক্ষম। অস্থায়ী ডিরেক্টরি অনুপস্থিত। যদি আপনি এই সমস্যা সমাধান করতে অক্ষম হন তবে দয়া করে আপনার হোস্টের সাথে যোগাযোগ করুন।';
$txt['php_upload_error_7'] = 'ডিস্কে ফাইল লেখার ক্ষেত্রে ব্যর্থ হয়েছে। এটি একটি PHP সম্পর্কিত ত্রুটি। যদি এই সমস্যা অব্যাহত থাকে তবে দয়া করে আপনার হোস্টের সাথে যোগাযোগ করুন।';
$txt['php_upload_error_8'] = 'একটি PHP এক্সটেনশন ফাইল আপলোড বন্ধ করে দিয়েছে। এটি একটি PHP সম্পর্কিত ত্রুটি। যদি এই সমস্যা অব্যাহত থাকে তবে দয়া করে আপনার হোস্টের সাথে যোগাযোগ করুন।';
$txt['error_temp_attachments_new'] = 'আপনার কিছু সংযুক্তি রয়েছে যা আপনি আগে সংযুক্ত করেছিলেন কিন্তু পোস্ট করেননি। এই সংযুক্তিগুলি এখনও এই পোস্টের সাথে সংযুক্ত রয়েছে। এই সংযুক্তিগুলি সংরক্ষণ বা মুছে ফেলার আগে এই পোস্ট জমা দেওয়া প্রয়োজন। আপনি এটি <a href="#postAttachment">এখানে</a> করতে পারেন।';
$txt['error_temp_attachments_found'] = 'নিচের সংযুক্তিগুলি পাওয়া গেছে যা আপনি আগে অন্য একটি পোস্টে সংযুক্ত করেছিলেন কিন্তু পোস্ট করেননি। আপনি এইগুলি মুছে ফেলা বা সেই পোস্ট জমা না হওয়া পর্যন্ত পোস্ট না করার পরামর্শ দেওয়া হচ্ছে।<br>সেগুলি মুছে ফেলার জন্য <a href="%1$s">এখানে</a> ক্লিক করুন। অথবা <a href="%2$s">এখানে</a> ক্লিক করে সেই পোস্টে ফিরে যান।%3$s';
$txt['error_temp_attachments_lost'] = 'নিচের সংযুক্তিগুলি পাওয়া গেছে যা আপনি আগে অন্য একটি পোস্টে সংযুক্ত করেছিলেন কিন্তু পোস্ট করেননি। আপনি এইগুলি মুছে ফেলা বা সেই পোস্ট জমা না হওয়া পর্যন্ত আর কোনও সংযুক্তি আপলোড না করার পরামর্শ দেওয়া হচ্ছে।<br>এই সংযুক্তিগুলি মুছে ফেলার জন্য <a href="%1$s">এখানে</a> ক্লিক করুন।%2$s';
$txt['error_temp_attachments_gone'] = 'সেই সংযুক্তিগুলি এখন মুছে ফেলা হয়েছে এবং আপনি পূর্ববর্তী পৃষ্ঠায় ফিরে গেছেন।';
$txt['error_temp_attachments_flushed'] = 'দয়া করে মনে রাখবেন যে পূর্বে সংযুক্ত করা কিন্তু পোস্ট করা হয়নি এমন কোনও ফাইল এখন মুছে ফেলা হয়েছে।';
$txt['error_cannot_post_attachment'] = 'আপনার %1$s-এ সংযুক্তি পোস্ট করার অনুমতি নেই। সেগুলি মুছে ফেলা হয়েছে।';
$txt['error_topic_already_announced'] = 'দয়া করে মনে রাখবেন যে এই বিষয়টি ইতিমধ্যেই ঘোষণা করা হয়েছে।';

$txt['cant_access_upload_path'] = 'সংযুক্তি আপলোড পাথ অ্যাক্সেস করা যাচ্ছে না!';
$txt['file_too_big'] = 'আপনার ফাইলটি খুব বড়। অনুমোদিত সর্বাধিক সংযুক্তির আকার %1$s KB।';
$txt['attach_timeout'] = 'আপনার সংযুক্তিটি সংরক্ষণ করা যায়নি। এটি হতে পারে কারণ আপলোড করতে খুব বেশি সময় লেগেছে অথবা ফাইলটি সার্ভার দ্বারা অনুমোদিত আকারের চেয়ে বড়।<br><br>আরও তথ্যের জন্য আপনার সার্ভার প্রশাসকের সাথে পরামর্শ করুন।';
$txt['bad_attachment'] = 'আপনার সংযুক্তিটি নিরাপত্তা পরীক্ষা ব্যর্থ হয়েছে এবং এটি আপলোড করা যায়নি। দয়া করে ফোরাম প্রশাসকের সাথে পরামর্শ করুন।';
$txt['ran_out_of_space'] = 'আপলোড ডিরেক্টরি পূর্ণ। এই সমস্যার বিষয়ে একজন প্রশাসকের সাথে যোগাযোগ করুন।';
$txt['attachments_no_write'] = 'সংযুক্তি আপলোড ডিরেক্টরিতে লেখার অনুমতি নেই। আপনার সংযুক্তিটি সংরক্ষণ করা যাবে না।';
$txt['avatars_no_write'] = 'অ্যাভাটার আপলোড ডিরেক্টরিতে লেখার অনুমতি নেই। আপনার অ্যাভাটার সংরক্ষণ করা যাবে না।';
$txt['attachments_no_create'] = 'নতুন সংযুক্তি ডিরেক্টরি তৈরি করতে অক্ষম। আপনার সংযুক্তি বা অ্যাভাটার সংরক্ষণ করা যাবে না।';
$txt['attachments_limit_per_post'] = 'আপনি প্রতি পোস্টে %1$dটির বেশি সংযুক্তি আপলোড করতে পারবেন না।';

$txt['approval_status'] = 'অনুমোদন স্থিতি';
$txt['approval_status_1'] = 'অনুমোদিত';
$txt['approval_status_0'] = 'অনুমোদনের অপেক্ষায়';

?>